#loc = loc(unknown)
#loc1 = loc("images")
module @yolov8n attributes {module.FLOPs = 1440546520 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "cv181x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.inputs = ["images"], module.mode = "INT8", module.outputs = ["/model.22/dfl/conv/Conv_output_0_Conv_f32", "/model.22/Sigmoid_output_0_Sigmoid_f32"], module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "yolov8n_tpu_addressed_cv181x_int8_sym_weight.npz"} {
  module @yolov8n attributes {module.coeff_addr = 1099511627776 : i64, module.coeff_size = 3070208 : i64, module.device_id = 0 : i64, module.neuron_size = 427008 : i64, module.private_size = 0 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x3x224x320xf32> loc(unknown)) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) {
      %0 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [224, 320], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627]} : (tensor<1x3x224x320xf32>) -> tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>, 3298534883328 : i64> loc(#loc1)
      %1:2 = call @subfunc_0(%0) : (tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>, 3298534883328 : i64>) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) loc(#loc)
      return %1#0, %1#1 : tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>, 3298534883328 : i64> loc("images")) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "top.Weight"() : () -> tensor<1x16x1x9xi8, 1099513056272 : i64> loc(#loc2)
      %2 = "top.Weight"() : () -> tensor<1x16x9x4xsi8, 1099513023776 : i64> loc(#loc3)
      %3 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099512746352 : i64> loc(#loc4)
      %4 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099513145184 : i64> loc(#loc5)
      %5 = "top.Weight"() : () -> tensor<1x32x9x16xsi8, 1099514647552 : i64> loc(#loc6)
      %6 = "tpu.Group"(%arg0) ({
        %266 = "tpu.Load"(%arg0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 11200, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0, 29, 61, 93, 125, 157, 189], h_slice = [32, 35, 35, 35, 35, 35, 35], w_idx = [0], w_slice = [320], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 4 : i64} : (tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>, 3298534883328 : i64>) -> tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>> loc(#loc8)
        %267 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 11776, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [4], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x9x4xsi8, 1099513023776 : i64>) -> tensor<1x16x9x4xsi8> loc(#loc9)
        %268 = "tpu.Load"(%1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 11904, out_size = 18, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x1x9xi8, 1099513056272 : i64>) -> tensor<1x16x1x9xi8> loc(#loc10)
        %269 = "tpu.Load"(%3) {do_bcast = true, ginfo = #tpu.lg<out_addr = 31232, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099512746352 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc11)
        %270 = "tpu.Conv2D"(%266, %267, %268) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 5440, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 15, 31, 47, 63, 79, 95], h_slice = [16, 17, 17, 17, 17, 17, 17], w_idx = [0], w_slice = [160], id = 4, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 4 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>>, tensor<1x16x9x4xsi8>, tensor<1x16x1x9xi8>) -> tensor<1x16x112x160x!quant.uniform<i8:f32, 0.30922601732283467>> loc(#loc12)
        %271 = "tpu.Load"(%5) {do_bcast = false, ginfo = #tpu.lg<out_addr = 11200, out_size = 576, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [16], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x9x16xsi8, 1099514647552 : i64>) -> tensor<1x32x9x16xsi8> loc(#loc13)
        %272 = "tpu.Load"(%4) {do_bcast = false, ginfo = #tpu.lg<out_addr = 11856, out_size = 36, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x9xi8, 1099513145184 : i64>) -> tensor<1x32x1x9xi8> loc(#loc14)
        %273 = "tpu.Lut"(%270, %269) {ginfo = #tpu.lg<out_addr = 20480, out_size = 5440, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 15, 31, 47, 63, 79, 95], h_slice = [16, 17, 17, 17, 17, 17, 17], w_idx = [0], w_slice = [160], id = 7, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x16x112x160x!quant.uniform<i8:f32, 0.30922601732283467>>, tensor<1x1x1x256xsi8>) -> tensor<1x16x112x160x!quant.uniform<i8:f32, 0.25628297322834642>> loc(#loc15)
        %274 = "tpu.Conv2D"(%273, %271, %272) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 28672, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 8, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x16x112x160x!quant.uniform<i8:f32, 0.25628297322834642>>, tensor<1x32x9x16xsi8>, tensor<1x32x1x9xi8>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.96238692440944873>> loc(#loc7)
        %275 = "tpu.Store"(%274, %0) {ginfo = #tpu.lg<out_addr = 28672, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 9, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.96238692440944873>>, none) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.96238692440944873>, 0 : i64> loc(#loc7)
        "tpu.Yield"(%275) : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.96238692440944873>, 0 : i64>) -> () loc(#loc7)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 9, -2, 7, 5, 6, -3, 8, 0, 1, 2], group_type = 0 : i64, hsecs = 7 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-2, 1], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>, 3298534883328 : i64>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.96238692440944873>, 0 : i64> loc(#loc7)
      %7 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099514347904 : i64> loc(#loc16)
      %8 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099513031408 : i64> loc(#loc17)
      %9 = "top.Weight"() : () -> tensor<1x32x1x32xsi8, 1099512708464 : i64> loc(#loc18)
      %10 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099512886464 : i64> loc(#loc19)
      %11 = "tpu.Group"(%6) ({
        %266 = "tpu.Load"(%6) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 6080, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.96238692440944873>, 0 : i64>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.96238692440944873>> loc(#loc21)
        %267 = "tpu.Load"(%7) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6336, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099514347904 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc22)
        %268 = "tpu.Load"(%9) {do_bcast = false, ginfo = #tpu.lg<out_addr = 30656, out_size = 128, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [32], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x32xsi8, 1099512708464 : i64>) -> tensor<1x32x1x32xsi8> loc(#loc23)
        %269 = "tpu.Load"(%8) {do_bcast = false, ginfo = #tpu.lg<out_addr = 6592, out_size = 36, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x9xi8, 1099513031408 : i64>) -> tensor<1x32x1x9xi8> loc(#loc24)
        %270 = "tpu.Lut"(%266, %267) {ginfo = #tpu.lg<out_addr = 0, out_size = 6080, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 4, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.96238692440944873>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.87199718267716531>> loc(#loc25)
        %271 = "tpu.Load"(%10) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6080, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099512886464 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc26)
        %272 = "tpu.Conv2D"(%270, %268, %269) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 6080, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 6, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.87199718267716531>>, tensor<1x32x1x32xsi8>, tensor<1x32x1x9xi8>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.43888809921259841>> loc(#loc27)
        %273 = "tpu.Lut"(%272, %271) {ginfo = #tpu.lg<out_addr = 24576, out_size = 6080, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 7, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.43888809921259841>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.25703029606299216>> loc(#loc20)
        %274 = "tpu.Store"(%273, %0) {ginfo = #tpu.lg<out_addr = 24576, out_size = 6080, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 8, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.25703029606299216>>, none) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 143360 : i64> loc(#loc20)
        "tpu.Yield"(%274) : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 143360 : i64>) -> () loc(#loc20)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 2, 3, 8, -2, 6, 5, -3, 7, 0, 1], group_type = 0 : i64, hsecs = 3 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [1], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.96238692440944873>, 0 : i64>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 143360 : i64> loc(#loc20)
      %12 = "tpu.Slice"(%11, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 16, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 143360 : i64>, none, none, none, none) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 143360 : i64> loc(#loc28)
      %13 = "tpu.Slice"(%11, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 32, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 16, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 143360 : i64>, none, none, none, none) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 215040 : i64> loc(#loc29)
      %14 = "top.Weight"() : () -> tensor<1x16x1x9xi8, 1099512831472 : i64> loc(#loc30)
      %15 = "top.Weight"() : () -> tensor<1x16x9x16xsi8, 1099512703664 : i64> loc(#loc31)
      %16 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099512887008 : i64> loc(#loc32)
      %17 = "top.Weight"() : () -> tensor<1x16x1x9xi8, 1099513024352 : i64> loc(#loc33)
      %18 = "top.Weight"() : () -> tensor<1x16x9x16xsi8, 1099513024496 : i64> loc(#loc34)
      %19 = "tpu.Group"(%13) ({
        %266 = "tpu.Load"(%13) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4800, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 26], h_slice = [30, 30], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 215040 : i64>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>> loc(#loc36)
        %267 = "tpu.Load"(%15) {do_bcast = false, ginfo = #tpu.lg<out_addr = 5088, out_size = 288, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [16], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x9x16xsi8, 1099512703664 : i64>) -> tensor<1x16x9x16xsi8> loc(#loc37)
        %268 = "tpu.Load"(%14) {do_bcast = false, ginfo = #tpu.lg<out_addr = 5408, out_size = 18, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x1x9xi8, 1099512831472 : i64>) -> tensor<1x16x1x9xi8> loc(#loc38)
        %269 = "tpu.Load"(%16) {do_bcast = true, ginfo = #tpu.lg<out_addr = 29056, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099512887008 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc39)
        %270 = "tpu.Conv2D"(%266, %267, %268) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 4640, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 27], h_slice = [29, 29], w_idx = [0], w_slice = [80], id = 4, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>>, tensor<1x16x9x16xsi8>, tensor<1x16x1x9xi8>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25260705354330709>> loc(#loc40)
        %271 = "tpu.Load"(%18) {do_bcast = false, ginfo = #tpu.lg<out_addr = 4800, out_size = 288, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [16], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x9x16xsi8, 1099513024496 : i64>) -> tensor<1x16x9x16xsi8> loc(#loc41)
        %272 = "tpu.Load"(%17) {do_bcast = false, ginfo = #tpu.lg<out_addr = 5376, out_size = 18, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x1x9xi8, 1099513024352 : i64>) -> tensor<1x16x1x9xi8> loc(#loc42)
        %273 = "tpu.Lut"(%270, %269) {ginfo = #tpu.lg<out_addr = 16384, out_size = 4640, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 27], h_slice = [29, 29], w_idx = [0], w_slice = [80], id = 7, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25260705354330709>>, tensor<1x1x1x256xsi8>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.21204552283464567>> loc(#loc43)
        %274 = "tpu.Conv2D"(%273, %271, %272) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 28], h_slice = [28, 28], w_idx = [0], w_slice = [80], id = 8, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.21204552283464567>>, tensor<1x16x9x16xsi8>, tensor<1x16x1x9xi8>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.17999419842519684>> loc(#loc35)
        %275 = "tpu.Store"(%274, %0) {ginfo = #tpu.lg<out_addr = 24576, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 28], h_slice = [28, 28], w_idx = [0], w_slice = [80], id = 9, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.17999419842519684>>, none) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.17999419842519684>, 286720 : i64> loc(#loc35)
        "tpu.Yield"(%275) : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.17999419842519684>, 286720 : i64>) -> () loc(#loc35)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 9, -2, 7, 5, 6, -3, 8, 0, 1, 2], group_type = 0 : i64, hsecs = 2 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 215040 : i64>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.17999419842519684>, 286720 : i64> loc(#loc35)
      %20 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099513026800 : i64> loc(#loc44)
      %21 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099512886720 : i64> loc(#loc45)
      %22 = "top.Weight"() : () -> tensor<1x32x1x48xsi8, 1099514606912 : i64> loc(#loc46)
      %23 = "tpu.Group"(%19, %13, %12) ({
        %266 = "tpu.Load"(%19) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 3040, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.17999419842519684>, 286720 : i64>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.17999419842519684>> loc(#loc48)
        %267 = "tpu.Load"(%20) {do_bcast = true, ginfo = #tpu.lg<out_addr = 28672, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099513026800 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc49)
        %268 = "tpu.Load"(%13) {do_bcast = false, ginfo = #tpu.lg<out_addr = 20480, out_size = 3040, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 215040 : i64>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>> loc(#loc36)
        %269 = "tpu.Lut"(%266, %267) {ginfo = #tpu.lg<out_addr = 0, out_size = 3040, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 3, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.17999419842519684>>, tensor<1x1x1x256xsi8>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.19860304173228346>> loc(#loc50)
        %270 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 3040, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 143360 : i64>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>> loc(#loc51)
        %271 = "tpu.Add"(%268, %269) {do_relu = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 3040, buffer_addr = 4096, buffer_size = 3040, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>, multipliers = [70, 54], relu_limit = -1.000000e+00 : f64, rshifts = [6]} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>>, tensor<1x16x56x80x!quant.uniform<i8:f32, 0.19860304173228346>>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.23443995984251967>> loc(#loc52)
        %272 = "tpu.Load"(%22) {do_bcast = false, ginfo = #tpu.lg<out_addr = 9120, out_size = 192, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [48], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x48xsi8, 1099514606912 : i64>) -> tensor<1x32x1x48xsi8> loc(#loc53)
        %273 = "tpu.Load"(%21) {do_bcast = false, ginfo = #tpu.lg<out_addr = 9312, out_size = 36, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 7, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x9xi8, 1099512886720 : i64>) -> tensor<1x32x1x9xi8> loc(#loc54)
        %274 = "tpu.Concat"(%270, %268, %271) {axis = 1 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 0, out_size = 9120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [48], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 8, stage = 1, slice_idx = 0, group_type = 0>, multipliers = [72, 72, 65], only_merge = false, relu_limit = -1.000000e+00 : f64, rshifts = [6, 6, 6]} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>>, tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>>, tensor<1x16x56x80x!quant.uniform<i8:f32, 0.23443995984251967>>) -> tensor<1x48x56x80x!quant.uniform<i8:f32, 0.22740728267716537>> loc(#loc55)
        %275 = "tpu.Conv2D"(%274, %272, %273) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 6080, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 9, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x48x56x80x!quant.uniform<i8:f32, 0.22740728267716537>>, tensor<1x32x1x48xsi8>, tensor<1x32x1x9xi8>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14162470629921259>> loc(#loc47)
        %276 = "tpu.Store"(%275, %0) {ginfo = #tpu.lg<out_addr = 12288, out_size = 6080, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 19, 38], h_slice = [19, 19, 18], w_idx = [0], w_slice = [80], id = 10, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14162470629921259>>, none) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14162470629921259>, 0 : i64> loc(#loc47)
        "tpu.Yield"(%276) : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14162470629921259>, 0 : i64>) -> () loc(#loc47)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 2, 10, -2, 5, 4, -3, 8, 6, 7, -4, 9, 0, 1], group_type = 0 : i64, hsecs = 3 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-1, 1], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.17999419842519684>, 286720 : i64>, tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 215040 : i64>, tensor<1x16x56x80x!quant.uniform<i8:f32, 0.25703029606299216>, 143360 : i64>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14162470629921259>, 0 : i64> loc(#loc47)
      %24 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099513105824 : i64> loc(#loc56)
      %25 = "top.Weight"() : () -> tensor<1x64x1x9xi8, 1099513107232 : i64> loc(#loc57)
      %26 = "top.Weight"() : () -> tensor<1x64x9x32xsi8, 1099513223344 : i64> loc(#loc58)
      %27 = "tpu.Group"(%23) ({
        %266 = "tpu.Load"(%23) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 9280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 27], h_slice = [28, 29], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14162470629921259>, 0 : i64>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14162470629921259>> loc(#loc60)
        %267 = "tpu.Load"(%24) {do_bcast = true, ginfo = #tpu.lg<out_addr = 11584, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099513105824 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc61)
        %268 = "tpu.Load"(%26) {do_bcast = false, ginfo = #tpu.lg<out_addr = 9280, out_size = 2304, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [32], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x9x32xsi8, 1099513223344 : i64>) -> tensor<1x64x9x32xsi8> loc(#loc62)
        %269 = "tpu.Load"(%25) {do_bcast = false, ginfo = #tpu.lg<out_addr = 11840, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x9xi8, 1099513107232 : i64>) -> tensor<1x64x1x9xi8> loc(#loc63)
        %270 = "tpu.Lut"(%266, %267) {ginfo = #tpu.lg<out_addr = 0, out_size = 9280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 27], h_slice = [28, 29], w_idx = [0], w_slice = [80], id = 4, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14162470629921259>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.085063231496062999>> loc(#loc64)
        %271 = "tpu.Conv2D"(%270, %268, %269) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 14], h_slice = [14, 14], w_idx = [0], w_slice = [40], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.085063231496062999>>, tensor<1x64x9x32xsi8>, tensor<1x64x1x9xi8>) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.048336753543307083>> loc(#loc59)
        %272 = "tpu.Store"(%271, %0) {ginfo = #tpu.lg<out_addr = 24576, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 14], h_slice = [14, 14], w_idx = [0], w_slice = [40], id = 6, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.048336753543307083>>, none) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.048336753543307083>, 143360 : i64> loc(#loc59)
        "tpu.Yield"(%272) : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.048336753543307083>, 143360 : i64>) -> () loc(#loc59)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 2, 3, 6, -2, 5, 0, 1], group_type = 0 : i64, hsecs = 2 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [1], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14162470629921259>, 0 : i64>) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.048336753543307083>, 143360 : i64> loc(#loc59)
      %28 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099512848256 : i64> loc(#loc65)
      %29 = "top.Weight"() : () -> tensor<1x64x1x9xi8, 1099513291952 : i64> loc(#loc66)
      %30 = "top.Weight"() : () -> tensor<1x64x1x64xsi8, 1099513027312 : i64> loc(#loc67)
      %31 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099513302032 : i64> loc(#loc68)
      %32 = "tpu.Group"(%27) ({
        %266 = "tpu.Load"(%27) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 14], h_slice = [14, 14], w_idx = [0], w_slice = [40], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.048336753543307083>, 143360 : i64>) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.048336753543307083>> loc(#loc70)
        %267 = "tpu.Load"(%28) {do_bcast = true, ginfo = #tpu.lg<out_addr = 4736, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099512848256 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc71)
        %268 = "tpu.Load"(%30) {do_bcast = false, ginfo = #tpu.lg<out_addr = 29056, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x64xsi8, 1099513027312 : i64>) -> tensor<1x64x1x64xsi8> loc(#loc72)
        %269 = "tpu.Load"(%29) {do_bcast = false, ginfo = #tpu.lg<out_addr = 4992, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x9xi8, 1099513291952 : i64>) -> tensor<1x64x1x9xi8> loc(#loc73)
        %270 = "tpu.Lut"(%266, %267) {ginfo = #tpu.lg<out_addr = 0, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 14], h_slice = [14, 14], w_idx = [0], w_slice = [40], id = 4, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.048336753543307083>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.056522050393700791>> loc(#loc74)
        %271 = "tpu.Load"(%31) {do_bcast = true, ginfo = #tpu.lg<out_addr = 4480, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099513302032 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc75)
        %272 = "tpu.Conv2D"(%270, %268, %269) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 14], h_slice = [14, 14], w_idx = [0], w_slice = [40], id = 6, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.056522050393700791>>, tensor<1x64x1x64xsi8>, tensor<1x64x1x9xi8>) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.059017308661417321>> loc(#loc76)
        %273 = "tpu.Lut"(%272, %271) {ginfo = #tpu.lg<out_addr = 24576, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 14], h_slice = [14, 14], w_idx = [0], w_slice = [40], id = 7, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.059017308661417321>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.053309097637795275>> loc(#loc69)
        %274 = "tpu.Store"(%273, %0) {ginfo = #tpu.lg<out_addr = 24576, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 14], h_slice = [14, 14], w_idx = [0], w_slice = [40], id = 8, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.053309097637795275>>, none) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.053309097637795275>, 71680 : i64> loc(#loc69)
        "tpu.Yield"(%274) : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.053309097637795275>, 71680 : i64>) -> () loc(#loc69)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 2, 3, 8, -2, 6, 5, -3, 7, 0, 1], group_type = 0 : i64, hsecs = 2 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.048336753543307083>, 143360 : i64>) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.053309097637795275>, 71680 : i64> loc(#loc69)
      %33 = "tpu.Slice"(%32, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 32, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.053309097637795275>, 71680 : i64>, none, none, none, none) -> tensor<1x32x28x40x!quant.uniform<i8:f32, 0.053309097637795275>, 71680 : i64> loc(#loc77)
      %34 = "tpu.Slice"(%32, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.053309097637795275>, 71680 : i64>, none, none, none, none) -> tensor<1x32x28x40x!quant.uniform<i8:f32, 0.053309097637795275>, 107520 : i64> loc(#loc78)
      %35 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099514022800 : i64> loc(#loc79)
      %36 = "top.Weight"() : () -> tensor<1x32x9x32xsi8, 1099513302544 : i64> loc(#loc80)
      %37 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099513311760 : i64> loc(#loc81)
      %38 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099513301744 : i64> loc(#loc82)
      %39 = "top.Weight"() : () -> tensor<1x32x9x32xsi8, 1099513282736 : i64> loc(#loc83)
      %40 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099512848000 : i64> loc(#loc84)
      %41 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099512707120 : i64> loc(#loc85)
      %42 = "top.Weight"() : () -> tensor<1x32x9x32xsi8, 1099512820336 : i64> loc(#loc86)
      %43 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099513023520 : i64> loc(#loc87)
      %44 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099512707664 : i64> loc(#loc88)
      %45 = "top.Weight"() : () -> tensor<1x32x9x32xsi8, 1099513056416 : i64> loc(#loc89)
      %46:2 = "tpu.Group"(%34) ({
        %266 = "tpu.Load"(%34) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [28], w_idx = [0], w_slice = [40], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x28x40x!quant.uniform<i8:f32, 0.053309097637795275>, 107520 : i64>) -> tensor<1x32x28x40x!quant.uniform<i8:f32, 0.053309097637795275>> loc(#loc92)
        %267 = "tpu.Load"(%36) {do_bcast = false, ginfo = #tpu.lg<out_addr = 28672, out_size = 1152, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [32], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x9x32xsi8, 1099513302544 : i64>) -> tensor<1x32x9x32xsi8> loc(#loc93)
        %268 = "tpu.Load"(%35) {do_bcast = false, ginfo = #tpu.lg<out_addr = 4528, out_size = 36, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x9xi8, 1099514022800 : i64>) -> tensor<1x32x1x9xi8> loc(#loc94)
        %269 = "tpu.Load"(%37) {do_bcast = true, ginfo = #tpu.lg<out_addr = 8960, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099513311760 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc95)
