#loc = loc(unknown)
#loc1 = loc("images")
module @yolov8n attributes {module.FLOPs = 1440546520 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "cv181x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.inputs = ["images"], module.mode = "BF16", module.outputs = ["/model.22/dfl/conv/Conv_output_0_Conv_f32", "/model.22/Sigmoid_output_0_Sigmoid_f32"], module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "yolov8n_tpu_addressed_cv181x_bf16_weight.npz"} {
  module @yolov8n attributes {module.coeff_addr = 1099511627776 : i64, module.coeff_size = 6030832 : i64, module.device_id = 0 : i64, module.neuron_size = 1003520 : i64, module.private_size = 0 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x3x224x320xf32> loc(unknown)) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) {
      %0 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [224, 320], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627]} : (tensor<1x3x224x320xf32>) -> tensor<1x3x224x320xf32, 3298534883328 : i64> loc(#loc1)
      %1:2 = call @subfunc_0(%0) : (tensor<1x3x224x320xf32, 3298534883328 : i64>) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) loc(#loc)
      return %1#0, %1#1 : tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x3x224x320xf32, 3298534883328 : i64> loc("images")) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "tpu.Cast"(%arg0) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x3x224x320xf32, 3298534883328 : i64>) -> tensor<1x3x224x320xbf16, 0 : i64> loc(#loc2)
      %2 = "top.Weight"() : () -> tensor<1x16x9x3xbf16, 1099513062512 : i64> loc(#loc3)
      %3 = "top.Weight"() : () -> tensor<2x16x1x1xui16, 1099512804656 : i64> loc(#loc4)
      %4 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099512803632 : i64> loc(#loc5)
      %5 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099516281440 : i64> loc(#loc6)
      %6 = "top.Weight"() : () -> tensor<1x32x9x16xbf16, 1099512682800 : i64> loc(#loc7)
      %7 = "top.Weight"() : () -> tensor<2x32x1x1xui16, 1099512803440 : i64> loc(#loc8)
      %8 = "tpu.Group"(%1) ({
        %371 = "tpu.Load"(%1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 12160, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0, 13, 29, 45, 61, 77, 93, 109, 125, 141, 157, 173, 189, 205], h_slice = [16, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19, 19], w_idx = [0], w_slice = [320], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x3x224x320xbf16, 0 : i64>) -> tensor<1x3x224x320xbf16> loc(#loc10)
        %372 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12160, out_size = 108, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [3], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x9x3xbf16, 1099513062512 : i64>) -> tensor<1x16x9x3xbf16> loc(#loc11)
        %373 = "tpu.Load"(%3) {do_bcast = false, ginfo = #tpu.lg<out_addr = 19200, out_size = 8, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x16x1x1xui16, 1099512804656 : i64>) -> tensor<2x16x1x1xui16> loc(#loc12)
        %374 = "tpu.Load"(%4) {do_bcast = true, ginfo = #tpu.lg<out_addr = 31232, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099512803632 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc13)
        %375 = "tpu.Load"(%5) {do_bcast = true, ginfo = #tpu.lg<out_addr = 19216, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099516281440 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc14)
        %376 = "tpu.Conv2D"(%371, %372, %373) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 5760, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 7, 15, 23, 31, 39, 47, 55, 63, 71, 79, 87, 95, 103], h_slice = [8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9], w_idx = [0], w_slice = [160], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x224x320xbf16>, tensor<1x16x9x3xbf16>, tensor<2x16x1x1xui16>) -> tensor<1x16x112x160xbf16> loc(#loc15)
        %377 = "tpu.Load"(%6) {do_bcast = false, ginfo = #tpu.lg<out_addr = 18048, out_size = 1152, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [16], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x9x16xbf16, 1099512682800 : i64>) -> tensor<1x32x9x16xbf16> loc(#loc16)
        %378 = "tpu.Load"(%7) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12272, out_size = 16, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 7, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x32x1x1xui16, 1099512803440 : i64>) -> tensor<2x32x1x1xui16> loc(#loc17)
        %379 = "tpu.LutBF16"(%376, %374, %375) {ginfo = #tpu.lg<out_addr = 20480, out_size = 5760, buffer_addr = 0, buffer_size = 11520, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 7, 15, 23, 31, 39, 47, 55, 63, 71, 79, 87, 95, 103], h_slice = [8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9], w_idx = [0], w_slice = [160], id = 8, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x16x112x160xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x16x112x160xbf16> loc(#loc18)
        %380 = "tpu.Conv2D"(%379, %377, %378) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 28672, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [80], id = 9, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x16x112x160xbf16>, tensor<1x32x9x16xbf16>, tensor<2x32x1x1xui16>) -> tensor<1x32x56x80xbf16> loc(#loc9)
        %381 = "tpu.Store"(%380, %0) {ginfo = #tpu.lg<out_addr = 28672, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [80], id = 10, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x32x56x80xbf16>, none) -> tensor<1x32x56x80xbf16, 430080 : i64> loc(#loc9)
        "tpu.Yield"(%381) : (tensor<1x32x56x80xbf16, 430080 : i64>) -> () loc(#loc9)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 10, -2, 8, 6, 7, -3, 9, 0, 1, 2], group_type = 0 : i64, hsecs = 14 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-1, 2, -3, 1], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x3x224x320xbf16, 0 : i64>) -> tensor<1x32x56x80xbf16, 430080 : i64> loc(#loc9)
      %9 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099512803632 : i64> loc(#loc19)
      %10 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099516281440 : i64> loc(#loc20)
      %11 = "top.Weight"() : () -> tensor<1x32x1x32xbf16, 1099514728784 : i64> loc(#loc21)
      %12 = "top.Weight"() : () -> tensor<2x32x1x1xui16, 1099513043184 : i64> loc(#loc22)
      %13 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099512803632 : i64> loc(#loc23)
      %14 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099516281440 : i64> loc(#loc24)
      %15 = "tpu.Group"(%8) ({
        %371 = "tpu.Load"(%8) {do_bcast = false, ginfo = #tpu.lg<out_addr = 20480, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x56x80xbf16, 430080 : i64>) -> tensor<1x32x56x80xbf16> loc(#loc26)
        %372 = "tpu.Load"(%9) {do_bcast = true, ginfo = #tpu.lg<out_addr = 19456, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099512803632 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc27)
        %373 = "tpu.Load"(%10) {do_bcast = true, ginfo = #tpu.lg<out_addr = 19968, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099516281440 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc28)
        %374 = "tpu.Load"(%11) {do_bcast = false, ginfo = #tpu.lg<out_addr = 30720, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [32], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x32xbf16, 1099514728784 : i64>) -> tensor<1x32x1x32xbf16> loc(#loc29)
        %375 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 30976, out_size = 16, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x32x1x1xui16, 1099513043184 : i64>) -> tensor<2x32x1x1xui16> loc(#loc30)
        %376 = "tpu.LutBF16"(%371, %372, %373) {ginfo = #tpu.lg<out_addr = 0, out_size = 5120, buffer_addr = 8192, buffer_size = 10240, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x32x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x32x56x80xbf16> loc(#loc31)
        %377 = "tpu.Load"(%13) {do_bcast = true, ginfo = #tpu.lg<out_addr = 18432, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099512803632 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc32)
        %378 = "tpu.Load"(%14) {do_bcast = true, ginfo = #tpu.lg<out_addr = 18944, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 7, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099516281440 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc33)
        %379 = "tpu.Conv2D"(%376, %374, %375) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 8, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x56x80xbf16>, tensor<1x32x1x32xbf16>, tensor<2x32x1x1xui16>) -> tensor<1x32x56x80xbf16> loc(#loc34)
        %380 = "tpu.LutBF16"(%379, %377, %378) {ginfo = #tpu.lg<out_addr = 25600, out_size = 5120, buffer_addr = 0, buffer_size = 10240, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 9, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x32x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x32x56x80xbf16> loc(#loc25)
        %381 = "tpu.Store"(%380, %0) {ginfo = #tpu.lg<out_addr = 25600, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 10, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x32x56x80xbf16>, none) -> tensor<1x32x56x80xbf16, 0 : i64> loc(#loc25)
        "tpu.Yield"(%381) : (tensor<1x32x56x80xbf16, 0 : i64>) -> () loc(#loc25)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 10, -2, 8, 6, 7, -3, 9, 0, 1, 2], group_type = 0 : i64, hsecs = 7 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [1, 2], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x56x80xbf16, 430080 : i64>) -> tensor<1x32x56x80xbf16, 0 : i64> loc(#loc25)
      %16 = "tpu.Slice"(%15, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 16, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x32x56x80xbf16, 0 : i64>, none, none, none, none) -> tensor<1x16x56x80xbf16, 0 : i64> loc(#loc35)
      %17 = "tpu.Slice"(%15, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 32, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 16, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x32x56x80xbf16, 0 : i64>, none, none, none, none) -> tensor<1x16x56x80xbf16, 143360 : i64> loc(#loc36)
      %18 = "top.Weight"() : () -> tensor<1x16x9x16xbf16, 1099512878448 : i64> loc(#loc37)
      %19 = "top.Weight"() : () -> tensor<2x16x1x1xui16, 1099512803568 : i64> loc(#loc38)
      %20 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099512803632 : i64> loc(#loc39)
      %21 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099516281440 : i64> loc(#loc40)
      %22 = "tpu.Group"(%17) ({
        %371 = "tpu.Load"(%17) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 13, 27, 41], h_slice = [15, 16, 16, 15], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80xbf16, 143360 : i64>) -> tensor<1x16x56x80xbf16> loc(#loc42)
        %372 = "tpu.Load"(%18) {do_bcast = false, ginfo = #tpu.lg<out_addr = 5120, out_size = 576, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [16], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x9x16xbf16, 1099512878448 : i64>) -> tensor<1x16x9x16xbf16> loc(#loc43)
        %373 = "tpu.Load"(%19) {do_bcast = false, ginfo = #tpu.lg<out_addr = 6720, out_size = 8, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x16x1x1xui16, 1099512803568 : i64>) -> tensor<2x16x1x1xui16> loc(#loc44)
        %374 = "tpu.Load"(%20) {do_bcast = true, ginfo = #tpu.lg<out_addr = 5696, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099512803632 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc45)
        %375 = "tpu.Load"(%21) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6208, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099516281440 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc46)
        %376 = "tpu.Conv2D"(%371, %372, %373) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 14, 28, 42], h_slice = [14, 14, 14, 14], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x16x56x80xbf16>, tensor<1x16x9x16xbf16>, tensor<2x16x1x1xui16>) -> tensor<1x16x56x80xbf16> loc(#loc47)
        %377 = "tpu.LutBF16"(%376, %374, %375) {ginfo = #tpu.lg<out_addr = 16384, out_size = 4480, buffer_addr = 20864, buffer_size = 8960, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 14, 28, 42], h_slice = [14, 14, 14, 14], w_idx = [0], w_slice = [80], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x16x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x16x56x80xbf16> loc(#loc41)
        %378 = "tpu.Store"(%377, %0) {ginfo = #tpu.lg<out_addr = 16384, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 14, 28, 42], h_slice = [14, 14, 14, 14], w_idx = [0], w_slice = [80], id = 7, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x16x56x80xbf16>, none) -> tensor<1x16x56x80xbf16, 286720 : i64> loc(#loc41)
        "tpu.Yield"(%378) : (tensor<1x16x56x80xbf16, 286720 : i64>) -> () loc(#loc41)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 7, -2, 6, 0, 1, 2], group_type = 0 : i64, hsecs = 4 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-2, 0, 1, 2], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x16x56x80xbf16, 143360 : i64>) -> tensor<1x16x56x80xbf16, 286720 : i64> loc(#loc41)
      %23 = "top.Weight"() : () -> tensor<1x16x9x16xbf16, 1099516281952 : i64> loc(#loc48)
      %24 = "top.Weight"() : () -> tensor<2x16x1x1xui16, 1099512692272 : i64> loc(#loc49)
      %25 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099512803632 : i64> loc(#loc50)
      %26 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099516281440 : i64> loc(#loc51)
      %27 = "tpu.Group"(%22) ({
        %371 = "tpu.Load"(%22) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 13, 27, 41], h_slice = [15, 16, 16, 15], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80xbf16, 286720 : i64>) -> tensor<1x16x56x80xbf16> loc(#loc53)
        %372 = "tpu.Load"(%23) {do_bcast = false, ginfo = #tpu.lg<out_addr = 5120, out_size = 576, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [16], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x9x16xbf16, 1099516281952 : i64>) -> tensor<1x16x9x16xbf16> loc(#loc54)
        %373 = "tpu.Load"(%24) {do_bcast = false, ginfo = #tpu.lg<out_addr = 6720, out_size = 8, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x16x1x1xui16, 1099512692272 : i64>) -> tensor<2x16x1x1xui16> loc(#loc55)
        %374 = "tpu.Load"(%25) {do_bcast = true, ginfo = #tpu.lg<out_addr = 5696, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099512803632 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc56)
        %375 = "tpu.Load"(%26) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6208, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099516281440 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc57)
        %376 = "tpu.Conv2D"(%371, %372, %373) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 14, 28, 42], h_slice = [14, 14, 14, 14], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x16x56x80xbf16>, tensor<1x16x9x16xbf16>, tensor<2x16x1x1xui16>) -> tensor<1x16x56x80xbf16> loc(#loc58)
        %377 = "tpu.LutBF16"(%376, %374, %375) {ginfo = #tpu.lg<out_addr = 16384, out_size = 4480, buffer_addr = 20864, buffer_size = 8960, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 14, 28, 42], h_slice = [14, 14, 14, 14], w_idx = [0], w_slice = [80], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x16x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x16x56x80xbf16> loc(#loc52)
        %378 = "tpu.Store"(%377, %0) {ginfo = #tpu.lg<out_addr = 16384, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 14, 28, 42], h_slice = [14, 14, 14, 14], w_idx = [0], w_slice = [80], id = 7, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x16x56x80xbf16>, none) -> tensor<1x16x56x80xbf16, 716800 : i64> loc(#loc52)
        "tpu.Yield"(%378) : (tensor<1x16x56x80xbf16, 716800 : i64>) -> () loc(#loc52)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 7, -2, 6, 0, 1, 2], group_type = 0 : i64, hsecs = 4 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [0, 1, 2], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x16x56x80xbf16, 286720 : i64>) -> tensor<1x16x56x80xbf16, 716800 : i64> loc(#loc52)
      %28 = "tpu.Group"(%17, %27, %16) ({
        %371 = "tpu.Load"(%27) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 12, 23, 34, 45], h_slice = [12, 11, 11, 11, 11], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80xbf16, 716800 : i64>) -> tensor<1x16x56x80xbf16> loc(#loc60)
        %372 = "tpu.Load"(%17) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 12, 23, 34, 45], h_slice = [12, 11, 11, 11, 11], w_idx = [0], w_slice = [80], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80xbf16, 143360 : i64>) -> tensor<1x16x56x80xbf16> loc(#loc42)
        %373 = "tpu.Load"(%16) {do_bcast = false, ginfo = #tpu.lg<out_addr = 20480, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 12, 23, 34, 45], h_slice = [12, 11, 11, 11, 11], w_idx = [0], w_slice = [80], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80xbf16, 0 : i64>) -> tensor<1x16x56x80xbf16> loc(#loc61)
        %374 = "tpu.Add"(%372, %371) {do_relu = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 12, 23, 34, 45], h_slice = [12, 11, 11, 11, 11], w_idx = [0], w_slice = [80], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x16x56x80xbf16>, tensor<1x16x56x80xbf16>) -> tensor<1x16x56x80xbf16> loc(#loc62)
        %375 = "tpu.Concat"(%373, %372, %374) {axis = 1 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 0, out_size = 11520, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [48], d_idx = [0], d_slice = [1], h_idx = [0, 12, 23, 34, 45], h_slice = [12, 11, 11, 11, 11], w_idx = [0], w_slice = [80], id = 4, stage = 1, slice_idx = 0, group_type = 0>, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x16x56x80xbf16>, tensor<1x16x56x80xbf16>, tensor<1x16x56x80xbf16>) -> tensor<1x48x56x80xbf16> loc(#loc59)
        %376 = "tpu.Store"(%375, %0) {ginfo = #tpu.lg<out_addr = 0, out_size = 11520, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [48], d_idx = [0], d_slice = [1], h_idx = [0, 12, 23, 34, 45], h_slice = [12, 11, 11, 11, 11], w_idx = [0], w_slice = [80], id = 5, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x48x56x80xbf16>, none) -> tensor<1x48x56x80xbf16, 286720 : i64> loc(#loc59)
        "tpu.Yield"(%376) : (tensor<1x48x56x80xbf16, 286720 : i64>) -> () loc(#loc59)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 2, 5, -2, 4, 0, -3, 1], group_type = 0 : i64, hsecs = 5 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-1, 2], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x16x56x80xbf16, 143360 : i64>, tensor<1x16x56x80xbf16, 716800 : i64>, tensor<1x16x56x80xbf16, 0 : i64>) -> tensor<1x48x56x80xbf16, 286720 : i64> loc(#loc59)
      %29 = "top.Weight"() : () -> tensor<1x32x1x48xbf16, 1099512725104 : i64> loc(#loc63)
      %30 = "top.Weight"() : () -> tensor<2x32x1x1xui16, 1099512902256 : i64> loc(#loc64)
      %31 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099512803632 : i64> loc(#loc65)
      %32 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099516281440 : i64> loc(#loc66)
      %33 = "top.Weight"() : () -> tensor<1x64x9x32xbf16, 1099515643232 : i64> loc(#loc67)
      %34 = "top.Weight"() : () -> tensor<2x64x1x1xui16, 1099513043312 : i64> loc(#loc68)
      %35 = "tpu.Group"(%28) ({
        %371 = "tpu.Load"(%28) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 8640, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [48], d_idx = [0], d_slice = [1], h_idx = [0, 7, 15, 23, 31, 39, 47], h_slice = [8, 9, 9, 9, 9, 9, 9], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x48x56x80xbf16, 286720 : i64>) -> tensor<1x48x56x80xbf16> loc(#loc70)
        %372 = "tpu.Load"(%29) {do_bcast = false, ginfo = #tpu.lg<out_addr = 17408, out_size = 384, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [48], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x48xbf16, 1099512725104 : i64>) -> tensor<1x32x1x48xbf16> loc(#loc71)
        %373 = "tpu.Load"(%30) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12064, out_size = 16, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x32x1x1xui16, 1099512902256 : i64>) -> tensor<2x32x1x1xui16> loc(#loc72)
        %374 = "tpu.Load"(%31) {do_bcast = true, ginfo = #tpu.lg<out_addr = 11520, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099512803632 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc73)
        %375 = "tpu.Load"(%32) {do_bcast = true, ginfo = #tpu.lg<out_addr = 16896, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099516281440 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc74)
        %376 = "tpu.Conv2D"(%371, %372, %373) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 20480, out_size = 5760, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 7, 15, 23, 31, 39, 47], h_slice = [8, 9, 9, 9, 9, 9, 9], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x48x56x80xbf16>, tensor<1x32x1x48xbf16>, tensor<2x32x1x1xui16>) -> tensor<1x32x56x80xbf16> loc(#loc75)
        %377 = "tpu.Load"(%33) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 4608, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [32], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x9x32xbf16, 1099515643232 : i64>) -> tensor<1x64x9x32xbf16> loc(#loc76)
        %378 = "tpu.Load"(%34) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12032, out_size = 32, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 7, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x64x1x1xui16, 1099513043312 : i64>) -> tensor<2x64x1x1xui16> loc(#loc77)
        %379 = "tpu.LutBF16"(%376, %374, %375) {ginfo = #tpu.lg<out_addr = 26240, out_size = 5760, buffer_addr = 0, buffer_size = 11520, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 7, 15, 23, 31, 39, 47], h_slice = [8, 9, 9, 9, 9, 9, 9], w_idx = [0], w_slice = [80], id = 8, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x32x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x32x56x80xbf16> loc(#loc78)
        %380 = "tpu.Conv2D"(%379, %377, %378) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8640, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24], h_slice = [4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [40], id = 9, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x56x80xbf16>, tensor<1x64x9x32xbf16>, tensor<2x64x1x1xui16>) -> tensor<1x64x28x40xbf16> loc(#loc69)
        %381 = "tpu.Store"(%380, %0) {ginfo = #tpu.lg<out_addr = 8640, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24], h_slice = [4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [40], id = 10, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x64x28x40xbf16>, none) -> tensor<1x64x28x40xbf16, 0 : i64> loc(#loc69)
        "tpu.Yield"(%381) : (tensor<1x64x28x40xbf16, 0 : i64>) -> () loc(#loc69)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 10, -2, 8, 6, 7, -3, 9, 0, 1, 2], group_type = 0 : i64, hsecs = 7 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-1, 1, 2, -3, 0], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [2], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x48x56x80xbf16, 286720 : i64>) -> tensor<1x64x28x40xbf16, 0 : i64> loc(#loc69)
      %36 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099512803632 : i64> loc(#loc79)
      %37 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099516281440 : i64> loc(#loc80)
      %38 = "top.Weight"() : () -> tensor<1x64x1x64xbf16, 1099513724880 : i64> loc(#loc81)
      %39 = "top.Weight"() : () -> tensor<2x64x1x1xui16, 1099515199056 : i64> loc(#loc82)
      %40 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099512803632 : i64> loc(#loc83)
      %41 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099516281440 : i64> loc(#loc84)
      %42 = "tpu.Group"(%35) ({
        %371 = "tpu.Load"(%35) {do_bcast = false, ginfo = #tpu.lg<out_addr = 20480, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 7, 14, 21], h_slice = [7, 7, 7, 7], w_idx = [0], w_slice = [40], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x28x40xbf16, 0 : i64>) -> tensor<1x64x28x40xbf16> loc(#loc86)
        %372 = "tpu.Load"(%36) {do_bcast = true, ginfo = #tpu.lg<out_addr = 18688, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099512803632 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc87)
        %373 = "tpu.Load"(%37) {do_bcast = true, ginfo = #tpu.lg<out_addr = 18176, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099516281440 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc88)
        %374 = "tpu.Load"(%38) {do_bcast = false, ginfo = #tpu.lg<out_addr = 29440, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x64xbf16, 1099513724880 : i64>) -> tensor<1x64x1x64xbf16> loc(#loc89)
        %375 = "tpu.Load"(%39) {do_bcast = false, ginfo = #tpu.lg<out_addr = 19200, out_size = 32, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x64x1x1xui16, 1099515199056 : i64>) -> tensor<2x64x1x1xui16> loc(#loc90)
        %376 = "tpu.LutBF16"(%371, %372, %373) {ginfo = #tpu.lg<out_addr = 0, out_size = 4480, buffer_addr = 8192, buffer_size = 8960, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 7, 14, 21], h_slice = [7, 7, 7, 7], w_idx = [0], w_slice = [40], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x28x40xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x28x40xbf16> loc(#loc91)
        %377 = "tpu.Load"(%40) {do_bcast = true, ginfo = #tpu.lg<out_addr = 17152, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099512803632 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc92)
        %378 = "tpu.Load"(%41) {do_bcast = true, ginfo = #tpu.lg<out_addr = 17664, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 7, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099516281440 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc93)
        %379 = "tpu.Conv2D"(%376, %374, %375) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 7, 14, 21], h_slice = [7, 7, 7, 7], w_idx = [0], w_slice = [40], id = 8, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x28x40xbf16>, tensor<1x64x1x64xbf16>, tensor<2x64x1x1xui16>) -> tensor<1x64x28x40xbf16> loc(#loc94)
        %380 = "tpu.LutBF16"(%379, %377, %378) {ginfo = #tpu.lg<out_addr = 24960, out_size = 4480, buffer_addr = 0, buffer_size = 8960, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 7, 14, 21], h_slice = [7, 7, 7, 7], w_idx = [0], w_slice = [40], id = 9, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x28x40xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x28x40xbf16> loc(#loc85)
        %381 = "tpu.Store"(%380, %0) {ginfo = #tpu.lg<out_addr = 24960, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 7, 14, 21], h_slice = [7, 7, 7, 7], w_idx = [0], w_slice = [40], id = 10, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x64x28x40xbf16>, none) -> tensor<1x64x28x40xbf16, 143360 : i64> loc(#loc85)
        "tpu.Yield"(%381) : (tensor<1x64x28x40xbf16, 143360 : i64>) -> () loc(#loc85)
