#loc = loc(unknown)
module @yolo11s attributes {module.chip = "ALL", module.platform = "ONNX", module.state = "TOP_F32", module.top_run_mode = "STATIC", module.weight_file = "yolo11s_top_f32_all_origin_weight.npz"} {
  func.func @main(%arg0: tensor<1x3x224x320xf32> loc(unknown)) -> (tensor<*xf32>, tensor<*xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [224, 320], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627]} : (tensor<1x3x224x320xf32>) -> tensor<1x3x224x320xf32> loc(#loc1)
    %2 = "top.Weight"() : () -> tensor<32x3x3x3xf32> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<32xf32> loc(#loc3)
    %4 = "top.Conv"(%1, %2, %3) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x3x224x320xf32>, tensor<32x3x3x3xf32>, tensor<32xf32>) -> tensor<*xf32> loc(#loc4)
    %5 = "top.Sigmoid"(%4) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc5)
    %6 = "top.Mul"(%4, %5) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc6)
    %7 = "top.Weight"() : () -> tensor<64x32x3x3xf32> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<64xf32> loc(#loc8)
    %9 = "top.Conv"(%6, %7, %8) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x32x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc9)
    %10 = "top.Sigmoid"(%9) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc10)
    %11 = "top.Mul"(%9, %10) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc11)
    %12 = "top.Weight"() : () -> tensor<64x64x1x1xf32> loc(#loc12)
    %13 = "top.Weight"() : () -> tensor<64xf32> loc(#loc13)
    %14 = "top.Conv"(%11, %12, %13) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x1x1xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc14)
    %15 = "top.Sigmoid"(%14) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc15)
    %16 = "top.Mul"(%14, %15) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc16)
    %17:2 = "top.Split"(%16) {axis = 1 : si32, num = 2 : i64, split_size = [32, 32]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc499)
    %18 = "top.Weight"() : () -> tensor<16x32x3x3xf32> loc(#loc19)
    %19 = "top.Weight"() : () -> tensor<16xf32> loc(#loc20)
    %20 = "top.Conv"(%17#1, %18, %19) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<16x32x3x3xf32>, tensor<16xf32>) -> tensor<*xf32> loc(#loc21)
    %21 = "top.Sigmoid"(%20) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc22)
    %22 = "top.Mul"(%20, %21) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc23)
    %23 = "top.Weight"() : () -> tensor<32x16x3x3xf32> loc(#loc24)
    %24 = "top.Weight"() : () -> tensor<32xf32> loc(#loc25)
    %25 = "top.Conv"(%22, %23, %24) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<32x16x3x3xf32>, tensor<32xf32>) -> tensor<*xf32> loc(#loc26)
    %26 = "top.Sigmoid"(%25) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc27)
    %27 = "top.Mul"(%25, %26) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc28)
    %28 = "top.Add"(%17#1, %27) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc29)
    %29 = "top.Concat"(%17#0, %17#1, %28) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc30)
    %30 = "top.Weight"() : () -> tensor<128x96x1x1xf32> loc(#loc31)
    %31 = "top.Weight"() : () -> tensor<128xf32> loc(#loc32)
    %32 = "top.Conv"(%29, %30, %31) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x96x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc33)
    %33 = "top.Sigmoid"(%32) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc34)
    %34 = "top.Mul"(%32, %33) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc35)
    %35 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc36)
    %36 = "top.Weight"() : () -> tensor<128xf32> loc(#loc37)
    %37 = "top.Conv"(%34, %35, %36) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc38)
    %38 = "top.Sigmoid"(%37) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc39)
    %39 = "top.Mul"(%37, %38) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc40)
    %40 = "top.Weight"() : () -> tensor<128x128x1x1xf32> loc(#loc41)
    %41 = "top.Weight"() : () -> tensor<128xf32> loc(#loc42)
    %42 = "top.Conv"(%39, %40, %41) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc43)
    %43 = "top.Sigmoid"(%42) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc44)
    %44 = "top.Mul"(%42, %43) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc45)
    %45:2 = "top.Split"(%44) {axis = 1 : si32, num = 2 : i64, split_size = [64, 64]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc500)
    %46 = "top.Weight"() : () -> tensor<32x64x3x3xf32> loc(#loc48)
    %47 = "top.Weight"() : () -> tensor<32xf32> loc(#loc49)
    %48 = "top.Conv"(%45#1, %46, %47) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<32x64x3x3xf32>, tensor<32xf32>) -> tensor<*xf32> loc(#loc50)
    %49 = "top.Sigmoid"(%48) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc51)
    %50 = "top.Mul"(%48, %49) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc52)
    %51 = "top.Weight"() : () -> tensor<64x32x3x3xf32> loc(#loc53)
    %52 = "top.Weight"() : () -> tensor<64xf32> loc(#loc54)
    %53 = "top.Conv"(%50, %51, %52) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x32x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc55)
    %54 = "top.Sigmoid"(%53) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc56)
    %55 = "top.Mul"(%53, %54) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc57)
    %56 = "top.Add"(%45#1, %55) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc58)
    %57 = "top.Concat"(%45#0, %45#1, %56) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc59)
    %58 = "top.Weight"() : () -> tensor<256x192x1x1xf32> loc(#loc60)
    %59 = "top.Weight"() : () -> tensor<256xf32> loc(#loc61)
    %60 = "top.Conv"(%57, %58, %59) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x192x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc62)
    %61 = "top.Sigmoid"(%60) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc63)
    %62 = "top.Mul"(%60, %61) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc64)
    %63 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc65)
    %64 = "top.Weight"() : () -> tensor<256xf32> loc(#loc66)
    %65 = "top.Conv"(%62, %63, %64) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc67)
    %66 = "top.Sigmoid"(%65) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc68)
    %67 = "top.Mul"(%65, %66) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc69)
    %68 = "top.Weight"() : () -> tensor<256x256x1x1xf32> loc(#loc70)
    %69 = "top.Weight"() : () -> tensor<256xf32> loc(#loc71)
    %70 = "top.Conv"(%67, %68, %69) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x256x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc72)
    %71 = "top.Sigmoid"(%70) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc73)
    %72 = "top.Mul"(%70, %71) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc74)
    %73:2 = "top.Split"(%72) {axis = 1 : si32, num = 2 : i64, split_size = [128, 128]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc501)
    %74 = "top.Weight"() : () -> tensor<64x128x1x1xf32> loc(#loc77)
    %75 = "top.Weight"() : () -> tensor<64xf32> loc(#loc78)
    %76 = "top.Conv"(%73#1, %74, %75) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x128x1x1xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc79)
    %77 = "top.Weight"() : () -> tensor<64x128x1x1xf32> loc(#loc80)
    %78 = "top.Weight"() : () -> tensor<64xf32> loc(#loc81)
    %79 = "top.Conv"(%73#1, %77, %78) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x128x1x1xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc82)
    %80 = "top.Sigmoid"(%76) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc83)
    %81 = "top.Sigmoid"(%79) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc84)
    %82 = "top.Mul"(%76, %80) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc85)
    %83 = "top.Mul"(%79, %81) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc86)
    %84 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc87)
    %85 = "top.Weight"() : () -> tensor<64xf32> loc(#loc88)
    %86 = "top.Conv"(%82, %84, %85) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc89)
    %87 = "top.Sigmoid"(%86) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc90)
    %88 = "top.Mul"(%86, %87) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc91)
    %89 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc92)
    %90 = "top.Weight"() : () -> tensor<64xf32> loc(#loc93)
    %91 = "top.Conv"(%88, %89, %90) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc94)
    %92 = "top.Sigmoid"(%91) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc95)
    %93 = "top.Mul"(%91, %92) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc96)
    %94 = "top.Add"(%82, %93) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc97)
    %95 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc98)
    %96 = "top.Weight"() : () -> tensor<64xf32> loc(#loc99)
    %97 = "top.Conv"(%94, %95, %96) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc100)
    %98 = "top.Sigmoid"(%97) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc101)
    %99 = "top.Mul"(%97, %98) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc102)
    %100 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc103)
    %101 = "top.Weight"() : () -> tensor<64xf32> loc(#loc104)
    %102 = "top.Conv"(%99, %100, %101) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc105)
    %103 = "top.Sigmoid"(%102) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc106)
    %104 = "top.Mul"(%102, %103) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc107)
    %105 = "top.Add"(%94, %104) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc108)
    %106 = "top.Concat"(%105, %83) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc109)
    %107 = "top.Weight"() : () -> tensor<128x128x1x1xf32> loc(#loc110)
    %108 = "top.Weight"() : () -> tensor<128xf32> loc(#loc111)
    %109 = "top.Conv"(%106, %107, %108) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc112)
    %110 = "top.Sigmoid"(%109) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc113)
    %111 = "top.Mul"(%109, %110) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc114)
    %112 = "top.Concat"(%73#0, %73#1, %111) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc115)
    %113 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc116)
    %114 = "top.Weight"() : () -> tensor<256xf32> loc(#loc117)
    %115 = "top.Conv"(%112, %113, %114) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc118)
    %116 = "top.Sigmoid"(%115) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc119)
    %117 = "top.Mul"(%115, %116) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc120)
    %118 = "top.Weight"() : () -> tensor<512x256x3x3xf32> loc(#loc121)
    %119 = "top.Weight"() : () -> tensor<512xf32> loc(#loc122)
    %120 = "top.Conv"(%117, %118, %119) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x256x3x3xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc123)
    %121 = "top.Sigmoid"(%120) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc124)
    %122 = "top.Mul"(%120, %121) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc125)
    %123 = "top.Weight"() : () -> tensor<512x512x1x1xf32> loc(#loc126)
    %124 = "top.Weight"() : () -> tensor<512xf32> loc(#loc127)
    %125 = "top.Conv"(%122, %123, %124) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x512x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc128)
    %126 = "top.Sigmoid"(%125) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc129)
    %127 = "top.Mul"(%125, %126) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc130)
    %128:2 = "top.Split"(%127) {axis = 1 : si32, num = 2 : i64, split_size = [256, 256]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc502)
    %129 = "top.Weight"() : () -> tensor<128x256x1x1xf32> loc(#loc133)
    %130 = "top.Weight"() : () -> tensor<128xf32> loc(#loc134)
    %131 = "top.Conv"(%128#1, %129, %130) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x256x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc135)
    %132 = "top.Weight"() : () -> tensor<128x256x1x1xf32> loc(#loc136)
    %133 = "top.Weight"() : () -> tensor<128xf32> loc(#loc137)
    %134 = "top.Conv"(%128#1, %132, %133) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x256x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc138)
    %135 = "top.Sigmoid"(%131) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc139)
    %136 = "top.Sigmoid"(%134) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc140)
    %137 = "top.Mul"(%131, %135) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc141)
    %138 = "top.Mul"(%134, %136) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc142)
    %139 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc143)
    %140 = "top.Weight"() : () -> tensor<128xf32> loc(#loc144)
    %141 = "top.Conv"(%137, %139, %140) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc145)
    %142 = "top.Sigmoid"(%141) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc146)
    %143 = "top.Mul"(%141, %142) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc147)
    %144 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc148)
    %145 = "top.Weight"() : () -> tensor<128xf32> loc(#loc149)
    %146 = "top.Conv"(%143, %144, %145) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc150)
    %147 = "top.Sigmoid"(%146) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc151)
    %148 = "top.Mul"(%146, %147) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc152)
    %149 = "top.Add"(%137, %148) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc153)
    %150 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc154)
    %151 = "top.Weight"() : () -> tensor<128xf32> loc(#loc155)
    %152 = "top.Conv"(%149, %150, %151) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc156)
    %153 = "top.Sigmoid"(%152) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc157)
    %154 = "top.Mul"(%152, %153) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc158)
    %155 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc159)
    %156 = "top.Weight"() : () -> tensor<128xf32> loc(#loc160)
    %157 = "top.Conv"(%154, %155, %156) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc161)
    %158 = "top.Sigmoid"(%157) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc162)
    %159 = "top.Mul"(%157, %158) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc163)
    %160 = "top.Add"(%149, %159) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc164)
    %161 = "top.Concat"(%160, %138) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc165)
    %162 = "top.Weight"() : () -> tensor<256x256x1x1xf32> loc(#loc166)
    %163 = "top.Weight"() : () -> tensor<256xf32> loc(#loc167)
    %164 = "top.Conv"(%161, %162, %163) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x256x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc168)
    %165 = "top.Sigmoid"(%164) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc169)
    %166 = "top.Mul"(%164, %165) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc170)
    %167 = "top.Concat"(%128#0, %128#1, %166) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc171)
    %168 = "top.Weight"() : () -> tensor<512x768x1x1xf32> loc(#loc172)
    %169 = "top.Weight"() : () -> tensor<512xf32> loc(#loc173)
    %170 = "top.Conv"(%167, %168, %169) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x768x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc174)
    %171 = "top.Sigmoid"(%170) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc175)
    %172 = "top.Mul"(%170, %171) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc176)
    %173 = "top.Weight"() : () -> tensor<256x512x1x1xf32> loc(#loc177)
    %174 = "top.Weight"() : () -> tensor<256xf32> loc(#loc178)
    %175 = "top.Conv"(%172, %173, %174) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x512x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc179)
    %176 = "top.Sigmoid"(%175) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc180)
    %177 = "top.Mul"(%175, %176) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc181)
    %178 = "top.MaxPool"(%177) {auto_pad = "NOTSET", ceil_mode = false, count_include_pad = false, do_relu = false, first_round_mode = "HalfAwayFromZero", is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero", strides = [1, 1]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc182)
    %179 = "top.MaxPool"(%178) {auto_pad = "NOTSET", ceil_mode = false, count_include_pad = false, do_relu = false, first_round_mode = "HalfAwayFromZero", is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero", strides = [1, 1]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc183)
    %180 = "top.MaxPool"(%179) {auto_pad = "NOTSET", ceil_mode = false, count_include_pad = false, do_relu = false, first_round_mode = "HalfAwayFromZero", is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero", strides = [1, 1]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc184)
    %181 = "top.Concat"(%177, %178, %179, %180) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc185)
    %182 = "top.Weight"() : () -> tensor<512x1024x1x1xf32> loc(#loc186)
    %183 = "top.Weight"() : () -> tensor<512xf32> loc(#loc187)
    %184 = "top.Conv"(%181, %182, %183) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x1024x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc188)
    %185 = "top.Sigmoid"(%184) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc189)
    %186 = "top.Mul"(%184, %185) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc190)
    %187 = "top.Weight"() : () -> tensor<512x512x1x1xf32> loc(#loc191)
    %188 = "top.Weight"() : () -> tensor<512xf32> loc(#loc192)
    %189 = "top.Conv"(%186, %187, %188) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x512x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc193)
    %190 = "top.Sigmoid"(%189) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc194)
    %191 = "top.Mul"(%189, %190) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc195)
    %192:2 = "top.Split"(%191) {axis = 1 : si32, num = 2 : i64, split_size = [256, 256]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc503)
    %193 = "top.Weight"() : () -> tensor<512x256x1x1xf32> loc(#loc198)
    %194 = "top.Weight"() : () -> tensor<512xf32> loc(#loc199)
    %195 = "top.Conv"(%192#1, %193, %194) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x256x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc200)
    %196 = "top.Reshape"(%195) {flatten_start_dim = -1 : i64, shape = [1, 4, 128, 70]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc201)
    %197:3 = "top.Split"(%196) {axis = 2 : si32, num = 3 : i64, split_size = [32, 32, 64]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) loc(#loc504)
    %198 = "top.Permute"(%197#0) {order = [0, 1, 3, 2]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc205)
    %199 = "top.Reshape"(%197#2) {flatten_start_dim = -1 : i64, shape = [1, 256, 7, 10]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc206)
    %200 = "top.MatMul"(%198, %197#1, %0) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<*xf32>, tensor<*xf32>, none) -> tensor<*xf32> loc(#loc207)
    %201 = "top.Weight"() : () -> tensor<256x1x3x3xf32> loc(#loc208)
    %202 = "top.Weight"() : () -> tensor<256xf32> loc(#loc209)
    %203 = "top.Conv"(%199, %201, %202) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 256 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x1x3x3xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc210)
    %204 = "top.Weight"() : () -> tensor<1xf32> loc(#loc211)
    %205 = "top.Mul"(%200, %204) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<1xf32>) -> tensor<*xf32> loc(#loc212)
    %206 = "top.Softmax"(%205) {axis = -1 : si32, beta = 1.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc213)
    %207 = "top.Permute"(%206) {order = [0, 1, 3, 2]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc214)
    %208 = "top.MatMul"(%197#2, %207, %0) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<*xf32>, tensor<*xf32>, none) -> tensor<*xf32> loc(#loc215)
    %209 = "top.Reshape"(%208) {flatten_start_dim = -1 : i64, shape = [1, 256, 7, 10]} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc216)
    %210 = "top.Add"(%209, %203) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc217)
    %211 = "top.Weight"() : () -> tensor<256x256x1x1xf32> loc(#loc218)
    %212 = "top.Weight"() : () -> tensor<256xf32> loc(#loc219)
    %213 = "top.Conv"(%210, %211, %212) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x256x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc220)
    %214 = "top.Add"(%192#1, %213) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc221)
    %215 = "top.Weight"() : () -> tensor<512x256x1x1xf32> loc(#loc222)
    %216 = "top.Weight"() : () -> tensor<512xf32> loc(#loc223)
    %217 = "top.Conv"(%214, %215, %216) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x256x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc224)
    %218 = "top.Sigmoid"(%217) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc225)
    %219 = "top.Mul"(%217, %218) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc226)
    %220 = "top.Weight"() : () -> tensor<256x512x1x1xf32> loc(#loc227)
    %221 = "top.Weight"() : () -> tensor<256xf32> loc(#loc228)
    %222 = "top.Conv"(%219, %220, %221) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x512x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc229)
    %223 = "top.Add"(%214, %222) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc230)
    %224 = "top.Concat"(%192#0, %223) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc231)
    %225 = "top.Weight"() : () -> tensor<512x512x1x1xf32> loc(#loc232)
    %226 = "top.Weight"() : () -> tensor<512xf32> loc(#loc233)
    %227 = "top.Conv"(%224, %225, %226) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<512x512x1x1xf32>, tensor<512xf32>) -> tensor<*xf32> loc(#loc234)
    %228 = "top.Sigmoid"(%227) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc235)
    %229 = "top.Mul"(%227, %228) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc236)
    %230 = "top.Interp"(%229, %0) {coord_mode = "asymmetric", mode = "nearest", scale_h = 2.000000e+00 : f64, scale_w = 2.000000e+00 : f64} : (tensor<*xf32>, none) -> tensor<*xf32> loc(#loc237)
    %231 = "top.Concat"(%230, %117) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc238)
    %232 = "top.Weight"() : () -> tensor<256x768x1x1xf32> loc(#loc239)
    %233 = "top.Weight"() : () -> tensor<256xf32> loc(#loc240)
    %234 = "top.Conv"(%231, %232, %233) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x768x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc241)
    %235 = "top.Sigmoid"(%234) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc242)
    %236 = "top.Mul"(%234, %235) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc243)
    %237:2 = "top.Split"(%236) {axis = 1 : si32, num = 2 : i64, split_size = [128, 128]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc505)
    %238 = "top.Weight"() : () -> tensor<64x128x3x3xf32> loc(#loc246)
    %239 = "top.Weight"() : () -> tensor<64xf32> loc(#loc247)
    %240 = "top.Conv"(%237#1, %238, %239) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x128x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc248)
    %241 = "top.Sigmoid"(%240) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc249)
    %242 = "top.Mul"(%240, %241) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc250)
    %243 = "top.Weight"() : () -> tensor<128x64x3x3xf32> loc(#loc251)
    %244 = "top.Weight"() : () -> tensor<128xf32> loc(#loc252)
    %245 = "top.Conv"(%242, %243, %244) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x64x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc253)
    %246 = "top.Sigmoid"(%245) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc254)
    %247 = "top.Mul"(%245, %246) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc255)
    %248 = "top.Add"(%237#1, %247) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc256)
    %249 = "top.Concat"(%237#0, %237#1, %248) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc257)
    %250 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc258)
    %251 = "top.Weight"() : () -> tensor<256xf32> loc(#loc259)
    %252 = "top.Conv"(%249, %250, %251) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<*xf32> loc(#loc260)
    %253 = "top.Sigmoid"(%252) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc261)
    %254 = "top.Mul"(%252, %253) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc262)
    %255 = "top.Interp"(%254, %0) {coord_mode = "asymmetric", mode = "nearest", scale_h = 2.000000e+00 : f64, scale_w = 2.000000e+00 : f64} : (tensor<*xf32>, none) -> tensor<*xf32> loc(#loc263)
    %256 = "top.Concat"(%255, %62) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc264)
    %257 = "top.Weight"() : () -> tensor<128x512x1x1xf32> loc(#loc265)
    %258 = "top.Weight"() : () -> tensor<128xf32> loc(#loc266)
    %259 = "top.Conv"(%256, %257, %258) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x512x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc267)
    %260 = "top.Sigmoid"(%259) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc268)
    %261 = "top.Mul"(%259, %260) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc269)
    %262:2 = "top.Split"(%261) {axis = 1 : si32, num = 2 : i64, split_size = [64, 64]} : (tensor<*xf32>) -> (tensor<*xf32>, tensor<*xf32>) loc(#loc506)
    %263 = "top.Weight"() : () -> tensor<32x64x3x3xf32> loc(#loc272)
    %264 = "top.Weight"() : () -> tensor<32xf32> loc(#loc273)
    %265 = "top.Conv"(%262#1, %263, %264) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<32x64x3x3xf32>, tensor<32xf32>) -> tensor<*xf32> loc(#loc274)
    %266 = "top.Sigmoid"(%265) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc275)
    %267 = "top.Mul"(%265, %266) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc276)
    %268 = "top.Weight"() : () -> tensor<64x32x3x3xf32> loc(#loc277)
    %269 = "top.Weight"() : () -> tensor<64xf32> loc(#loc278)
    %270 = "top.Conv"(%267, %268, %269) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x32x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc279)
    %271 = "top.Sigmoid"(%270) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc280)
    %272 = "top.Mul"(%270, %271) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc281)
    %273 = "top.Add"(%262#1, %272) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc282)
    %274 = "top.Concat"(%262#0, %262#1, %273) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<*xf32>, tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc283)
    %275 = "top.Weight"() : () -> tensor<128x192x1x1xf32> loc(#loc284)
    %276 = "top.Weight"() : () -> tensor<128xf32> loc(#loc285)
    %277 = "top.Conv"(%274, %275, %276) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x192x1x1xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc286)
    %278 = "top.Sigmoid"(%277) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc287)
    %279 = "top.Mul"(%277, %278) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<*xf32>, tensor<*xf32>) -> tensor<*xf32> loc(#loc288)
    %280 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc289)
    %281 = "top.Weight"() : () -> tensor<128xf32> loc(#loc290)
    %282 = "top.Conv"(%279, %280, %281) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc291)
    %283 = "top.Weight"() : () -> tensor<64x128x3x3xf32> loc(#loc292)
    %284 = "top.Weight"() : () -> tensor<64xf32> loc(#loc293)
    %285 = "top.Conv"(%279, %283, %284) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<64x128x3x3xf32>, tensor<64xf32>) -> tensor<*xf32> loc(#loc294)
    %286 = "top.Weight"() : () -> tensor<128x1x3x3xf32> loc(#loc295)
    %287 = "top.Weight"() : () -> tensor<128xf32> loc(#loc296)
    %288 = "top.Conv"(%279, %286, %287) {auto_pad = "NOTSET", dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 128 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<*xf32>, tensor<128x1x3x3xf32>, tensor<128xf32>) -> tensor<*xf32> loc(#loc297)
    %289 = "top.Sigmoid"(%282) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc298)
    %290 = "top.Sigmoid"(%285) {bias = 0.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero", scale = 1.000000e+00 : f64} : (tensor<*xf32>) -> tensor<*xf32> loc(#loc299)
