ir_version: 9
producer_name: "pytorch"
producer_version: "2.6.0"
graph {
  node {
    input: "images"
    input: "model.0.conv.weight"
    input: "model.0.conv.bias"
    output: "/model.0/conv/Conv_output_0"
    name: "/model.0/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.0/conv/Conv_output_0"
    output: "/model.0/act/Sigmoid_output_0"
    name: "/model.0/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.0/conv/Conv_output_0"
    input: "/model.0/act/Sigmoid_output_0"
    output: "/model.0/act/Mul_output_0"
    name: "/model.0/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.0/act/Mul_output_0"
    input: "model.1.conv.weight"
    input: "model.1.conv.bias"
    output: "/model.1/conv/Conv_output_0"
    name: "/model.1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.1/conv/Conv_output_0"
    output: "/model.1/act/Sigmoid_output_0"
    name: "/model.1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.1/conv/Conv_output_0"
    input: "/model.1/act/Sigmoid_output_0"
    output: "/model.1/act/Mul_output_0"
    name: "/model.1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.1/act/Mul_output_0"
    input: "model.2.cv1.conv.weight"
    input: "model.2.cv1.conv.bias"
    output: "/model.2/cv1/conv/Conv_output_0"
    name: "/model.2/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.2/cv1/conv/Conv_output_0"
    output: "/model.2/cv1/act/Sigmoid_output_0"
    name: "/model.2/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.2/cv1/conv/Conv_output_0"
    input: "/model.2/cv1/act/Sigmoid_output_0"
    output: "/model.2/cv1/act/Mul_output_0"
    name: "/model.2/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/cv1/act/Mul_output_0"
    input: "onnx::Split_185"
    output: "/model.2/Split_output_0"
    output: "/model.2/Split_output_1"
    name: "/model.2/Split"
    op_type: "Split"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.2/Split_output_1"
    input: "model.2.m.0.cv1.conv.weight"
    input: "model.2.m.0.cv1.conv.bias"
    output: "/model.2/m.0/cv1/conv/Conv_output_0"
    name: "/model.2/m.0/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.2/m.0/cv1/conv/Conv_output_0"
    output: "/model.2/m.0/cv1/act/Sigmoid_output_0"
    name: "/model.2/m.0/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.2/m.0/cv1/conv/Conv_output_0"
    input: "/model.2/m.0/cv1/act/Sigmoid_output_0"
    output: "/model.2/m.0/cv1/act/Mul_output_0"
    name: "/model.2/m.0/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/m.0/cv1/act/Mul_output_0"
    input: "model.2.m.0.cv2.conv.weight"
    input: "model.2.m.0.cv2.conv.bias"
    output: "/model.2/m.0/cv2/conv/Conv_output_0"
    name: "/model.2/m.0/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.2/m.0/cv2/conv/Conv_output_0"
    output: "/model.2/m.0/cv2/act/Sigmoid_output_0"
    name: "/model.2/m.0/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.2/m.0/cv2/conv/Conv_output_0"
    input: "/model.2/m.0/cv2/act/Sigmoid_output_0"
    output: "/model.2/m.0/cv2/act/Mul_output_0"
    name: "/model.2/m.0/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/Split_output_1"
    input: "/model.2/m.0/cv2/act/Mul_output_0"
    output: "/model.2/m.0/Add_output_0"
    name: "/model.2/m.0/Add"
    op_type: "Add"
  }
  node {
    input: "/model.2/Split_output_0"
    input: "/model.2/Split_output_1"
    input: "/model.2/m.0/Add_output_0"
    output: "/model.2/Concat_output_0"
    name: "/model.2/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.2/Concat_output_0"
    input: "model.2.cv2.conv.weight"
    input: "model.2.cv2.conv.bias"
    output: "/model.2/cv2/conv/Conv_output_0"
    name: "/model.2/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.2/cv2/conv/Conv_output_0"
    output: "/model.2/cv2/act/Sigmoid_output_0"
    name: "/model.2/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.2/cv2/conv/Conv_output_0"
    input: "/model.2/cv2/act/Sigmoid_output_0"
    output: "/model.2/cv2/act/Mul_output_0"
    name: "/model.2/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.2/cv2/act/Mul_output_0"
    input: "model.3.conv.weight"
    input: "model.3.conv.bias"
    output: "/model.3/conv/Conv_output_0"
    name: "/model.3/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.3/conv/Conv_output_0"
    output: "/model.3/act/Sigmoid_output_0"
    name: "/model.3/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.3/conv/Conv_output_0"
    input: "/model.3/act/Sigmoid_output_0"
    output: "/model.3/act/Mul_output_0"
    name: "/model.3/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.3/act/Mul_output_0"
    input: "model.4.cv1.conv.weight"
    input: "model.4.cv1.conv.bias"
    output: "/model.4/cv1/conv/Conv_output_0"
    name: "/model.4/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.4/cv1/conv/Conv_output_0"
    output: "/model.4/cv1/act/Sigmoid_output_0"
    name: "/model.4/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.4/cv1/conv/Conv_output_0"
    input: "/model.4/cv1/act/Sigmoid_output_0"
    output: "/model.4/cv1/act/Mul_output_0"
    name: "/model.4/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/cv1/act/Mul_output_0"
    input: "onnx::Split_205"
    output: "/model.4/Split_output_0"
    output: "/model.4/Split_output_1"
    name: "/model.4/Split"
    op_type: "Split"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.4/Split_output_1"
    input: "model.4.m.0.cv1.conv.weight"
    input: "model.4.m.0.cv1.conv.bias"
    output: "/model.4/m.0/cv1/conv/Conv_output_0"
    name: "/model.4/m.0/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.4/m.0/cv1/conv/Conv_output_0"
    output: "/model.4/m.0/cv1/act/Sigmoid_output_0"
    name: "/model.4/m.0/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.4/m.0/cv1/conv/Conv_output_0"
    input: "/model.4/m.0/cv1/act/Sigmoid_output_0"
    output: "/model.4/m.0/cv1/act/Mul_output_0"
    name: "/model.4/m.0/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/m.0/cv1/act/Mul_output_0"
    input: "model.4.m.0.cv2.conv.weight"
    input: "model.4.m.0.cv2.conv.bias"
    output: "/model.4/m.0/cv2/conv/Conv_output_0"
    name: "/model.4/m.0/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.4/m.0/cv2/conv/Conv_output_0"
    output: "/model.4/m.0/cv2/act/Sigmoid_output_0"
    name: "/model.4/m.0/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.4/m.0/cv2/conv/Conv_output_0"
    input: "/model.4/m.0/cv2/act/Sigmoid_output_0"
    output: "/model.4/m.0/cv2/act/Mul_output_0"
    name: "/model.4/m.0/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/Split_output_1"
    input: "/model.4/m.0/cv2/act/Mul_output_0"
    output: "/model.4/m.0/Add_output_0"
    name: "/model.4/m.0/Add"
    op_type: "Add"
  }
  node {
    input: "/model.4/Split_output_0"
    input: "/model.4/Split_output_1"
    input: "/model.4/m.0/Add_output_0"
    output: "/model.4/Concat_output_0"
    name: "/model.4/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.4/Concat_output_0"
    input: "model.4.cv2.conv.weight"
    input: "model.4.cv2.conv.bias"
    output: "/model.4/cv2/conv/Conv_output_0"
    name: "/model.4/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.4/cv2/conv/Conv_output_0"
    output: "/model.4/cv2/act/Sigmoid_output_0"
    name: "/model.4/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.4/cv2/conv/Conv_output_0"
    input: "/model.4/cv2/act/Sigmoid_output_0"
    output: "/model.4/cv2/act/Mul_output_0"
    name: "/model.4/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.4/cv2/act/Mul_output_0"
    input: "model.5.conv.weight"
    input: "model.5.conv.bias"
    output: "/model.5/conv/Conv_output_0"
    name: "/model.5/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.5/conv/Conv_output_0"
    output: "/model.5/act/Sigmoid_output_0"
    name: "/model.5/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.5/conv/Conv_output_0"
    input: "/model.5/act/Sigmoid_output_0"
    output: "/model.5/act/Mul_output_0"
    name: "/model.5/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.5/act/Mul_output_0"
    input: "model.6.cv1.conv.weight"
    input: "model.6.cv1.conv.bias"
    output: "/model.6/cv1/conv/Conv_output_0"
    name: "/model.6/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.6/cv1/conv/Conv_output_0"
    output: "/model.6/cv1/act/Sigmoid_output_0"
    name: "/model.6/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.6/cv1/conv/Conv_output_0"
    input: "/model.6/cv1/act/Sigmoid_output_0"
    output: "/model.6/cv1/act/Mul_output_0"
    name: "/model.6/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.6/cv1/act/Mul_output_0"
    input: "onnx::Split_225"
    output: "/model.6/Split_output_0"
    output: "/model.6/Split_output_1"
    name: "/model.6/Split"
    op_type: "Split"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.6/Split_output_1"
    input: "model.6.m.0.cv1.conv.weight"
    input: "model.6.m.0.cv1.conv.bias"
    output: "/model.6/m.0/cv1/conv/Conv_output_0"
    name: "/model.6/m.0/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.6/Split_output_1"
    input: "model.6.m.0.cv2.conv.weight"
    input: "model.6.m.0.cv2.conv.bias"
    output: "/model.6/m.0/cv2/conv/Conv_output_0"
    name: "/model.6/m.0/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.6/m.0/cv1/conv/Conv_output_0"
    output: "/model.6/m.0/cv1/act/Sigmoid_output_0"
    name: "/model.6/m.0/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.6/m.0/cv2/conv/Conv_output_0"
    output: "/model.6/m.0/cv2/act/Sigmoid_output_0"
    name: "/model.6/m.0/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.6/m.0/cv1/conv/Conv_output_0"
    input: "/model.6/m.0/cv1/act/Sigmoid_output_0"
    output: "/model.6/m.0/cv1/act/Mul_output_0"
    name: "/model.6/m.0/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.6/m.0/cv2/conv/Conv_output_0"
    input: "/model.6/m.0/cv2/act/Sigmoid_output_0"
    output: "/model.6/m.0/cv2/act/Mul_output_0"
    name: "/model.6/m.0/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.6/m.0/cv1/act/Mul_output_0"
    input: "model.6.m.0.m.0.cv1.conv.weight"
    input: "model.6.m.0.m.0.cv1.conv.bias"
    output: "/model.6/m.0/m/m.0/cv1/conv/Conv_output_0"
    name: "/model.6/m.0/m/m.0/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.6/m.0/m/m.0/cv1/conv/Conv_output_0"
    output: "/model.6/m.0/m/m.0/cv1/act/Sigmoid_output_0"
    name: "/model.6/m.0/m/m.0/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.6/m.0/m/m.0/cv1/conv/Conv_output_0"
    input: "/model.6/m.0/m/m.0/cv1/act/Sigmoid_output_0"
    output: "/model.6/m.0/m/m.0/cv1/act/Mul_output_0"
    name: "/model.6/m.0/m/m.0/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.6/m.0/m/m.0/cv1/act/Mul_output_0"
    input: "model.6.m.0.m.0.cv2.conv.weight"
    input: "model.6.m.0.m.0.cv2.conv.bias"
    output: "/model.6/m.0/m/m.0/cv2/conv/Conv_output_0"
    name: "/model.6/m.0/m/m.0/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.6/m.0/m/m.0/cv2/conv/Conv_output_0"
    output: "/model.6/m.0/m/m.0/cv2/act/Sigmoid_output_0"
    name: "/model.6/m.0/m/m.0/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.6/m.0/m/m.0/cv2/conv/Conv_output_0"
    input: "/model.6/m.0/m/m.0/cv2/act/Sigmoid_output_0"
    output: "/model.6/m.0/m/m.0/cv2/act/Mul_output_0"
    name: "/model.6/m.0/m/m.0/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.6/m.0/cv1/act/Mul_output_0"
    input: "/model.6/m.0/m/m.0/cv2/act/Mul_output_0"
    output: "/model.6/m.0/m/m.0/Add_output_0"
    name: "/model.6/m.0/m/m.0/Add"
    op_type: "Add"
  }
  node {
    input: "/model.6/m.0/m/m.0/Add_output_0"
    input: "model.6.m.0.m.1.cv1.conv.weight"
    input: "model.6.m.0.m.1.cv1.conv.bias"
    output: "/model.6/m.0/m/m.1/cv1/conv/Conv_output_0"
    name: "/model.6/m.0/m/m.1/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.6/m.0/m/m.1/cv1/conv/Conv_output_0"
    output: "/model.6/m.0/m/m.1/cv1/act/Sigmoid_output_0"
    name: "/model.6/m.0/m/m.1/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.6/m.0/m/m.1/cv1/conv/Conv_output_0"
    input: "/model.6/m.0/m/m.1/cv1/act/Sigmoid_output_0"
    output: "/model.6/m.0/m/m.1/cv1/act/Mul_output_0"
    name: "/model.6/m.0/m/m.1/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.6/m.0/m/m.1/cv1/act/Mul_output_0"
    input: "model.6.m.0.m.1.cv2.conv.weight"
    input: "model.6.m.0.m.1.cv2.conv.bias"
    output: "/model.6/m.0/m/m.1/cv2/conv/Conv_output_0"
    name: "/model.6/m.0/m/m.1/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.6/m.0/m/m.1/cv2/conv/Conv_output_0"
    output: "/model.6/m.0/m/m.1/cv2/act/Sigmoid_output_0"
    name: "/model.6/m.0/m/m.1/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.6/m.0/m/m.1/cv2/conv/Conv_output_0"
    input: "/model.6/m.0/m/m.1/cv2/act/Sigmoid_output_0"
    output: "/model.6/m.0/m/m.1/cv2/act/Mul_output_0"
    name: "/model.6/m.0/m/m.1/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.6/m.0/m/m.0/Add_output_0"
    input: "/model.6/m.0/m/m.1/cv2/act/Mul_output_0"
    output: "/model.6/m.0/m/m.1/Add_output_0"
    name: "/model.6/m.0/m/m.1/Add"
    op_type: "Add"
  }
  node {
    input: "/model.6/m.0/m/m.1/Add_output_0"
    input: "/model.6/m.0/cv2/act/Mul_output_0"
    output: "/model.6/m.0/Concat_output_0"
    name: "/model.6/m.0/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.6/m.0/Concat_output_0"
    input: "model.6.m.0.cv3.conv.weight"
    input: "model.6.m.0.cv3.conv.bias"
    output: "/model.6/m.0/cv3/conv/Conv_output_0"
    name: "/model.6/m.0/cv3/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.6/m.0/cv3/conv/Conv_output_0"
    output: "/model.6/m.0/cv3/act/Sigmoid_output_0"
    name: "/model.6/m.0/cv3/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.6/m.0/cv3/conv/Conv_output_0"
    input: "/model.6/m.0/cv3/act/Sigmoid_output_0"
    output: "/model.6/m.0/cv3/act/Mul_output_0"
    name: "/model.6/m.0/cv3/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.6/Split_output_0"
    input: "/model.6/Split_output_1"
    input: "/model.6/m.0/cv3/act/Mul_output_0"
    output: "/model.6/Concat_output_0"
    name: "/model.6/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.6/Concat_output_0"
    input: "model.6.cv2.conv.weight"
    input: "model.6.cv2.conv.bias"
    output: "/model.6/cv2/conv/Conv_output_0"
    name: "/model.6/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.6/cv2/conv/Conv_output_0"
    output: "/model.6/cv2/act/Sigmoid_output_0"
    name: "/model.6/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.6/cv2/conv/Conv_output_0"
    input: "/model.6/cv2/act/Sigmoid_output_0"
    output: "/model.6/cv2/act/Mul_output_0"
    name: "/model.6/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.6/cv2/act/Mul_output_0"
    input: "model.7.conv.weight"
    input: "model.7.conv.bias"
    output: "/model.7/conv/Conv_output_0"
    name: "/model.7/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 2
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.7/conv/Conv_output_0"
    output: "/model.7/act/Sigmoid_output_0"
    name: "/model.7/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.7/conv/Conv_output_0"
    input: "/model.7/act/Sigmoid_output_0"
    output: "/model.7/act/Mul_output_0"
    name: "/model.7/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.7/act/Mul_output_0"
    input: "model.8.cv1.conv.weight"
    input: "model.8.cv1.conv.bias"
    output: "/model.8/cv1/conv/Conv_output_0"
    name: "/model.8/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.8/cv1/conv/Conv_output_0"
    output: "/model.8/cv1/act/Sigmoid_output_0"
    name: "/model.8/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.8/cv1/conv/Conv_output_0"
    input: "/model.8/cv1/act/Sigmoid_output_0"
    output: "/model.8/cv1/act/Mul_output_0"
    name: "/model.8/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.8/cv1/act/Mul_output_0"
    input: "onnx::Split_262"
    output: "/model.8/Split_output_0"
    output: "/model.8/Split_output_1"
    name: "/model.8/Split"
    op_type: "Split"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.8/Split_output_1"
    input: "model.8.m.0.cv1.conv.weight"
    input: "model.8.m.0.cv1.conv.bias"
    output: "/model.8/m.0/cv1/conv/Conv_output_0"
    name: "/model.8/m.0/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.8/Split_output_1"
    input: "model.8.m.0.cv2.conv.weight"
    input: "model.8.m.0.cv2.conv.bias"
    output: "/model.8/m.0/cv2/conv/Conv_output_0"
    name: "/model.8/m.0/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.8/m.0/cv1/conv/Conv_output_0"
    output: "/model.8/m.0/cv1/act/Sigmoid_output_0"
    name: "/model.8/m.0/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.8/m.0/cv2/conv/Conv_output_0"
    output: "/model.8/m.0/cv2/act/Sigmoid_output_0"
    name: "/model.8/m.0/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.8/m.0/cv1/conv/Conv_output_0"
    input: "/model.8/m.0/cv1/act/Sigmoid_output_0"
    output: "/model.8/m.0/cv1/act/Mul_output_0"
    name: "/model.8/m.0/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.8/m.0/cv2/conv/Conv_output_0"
    input: "/model.8/m.0/cv2/act/Sigmoid_output_0"
    output: "/model.8/m.0/cv2/act/Mul_output_0"
    name: "/model.8/m.0/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.8/m.0/cv1/act/Mul_output_0"
    input: "model.8.m.0.m.0.cv1.conv.weight"
    input: "model.8.m.0.m.0.cv1.conv.bias"
    output: "/model.8/m.0/m/m.0/cv1/conv/Conv_output_0"
    name: "/model.8/m.0/m/m.0/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.8/m.0/m/m.0/cv1/conv/Conv_output_0"
    output: "/model.8/m.0/m/m.0/cv1/act/Sigmoid_output_0"
    name: "/model.8/m.0/m/m.0/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.8/m.0/m/m.0/cv1/conv/Conv_output_0"
    input: "/model.8/m.0/m/m.0/cv1/act/Sigmoid_output_0"
    output: "/model.8/m.0/m/m.0/cv1/act/Mul_output_0"
    name: "/model.8/m.0/m/m.0/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.8/m.0/m/m.0/cv1/act/Mul_output_0"
    input: "model.8.m.0.m.0.cv2.conv.weight"
    input: "model.8.m.0.m.0.cv2.conv.bias"
    output: "/model.8/m.0/m/m.0/cv2/conv/Conv_output_0"
    name: "/model.8/m.0/m/m.0/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.8/m.0/m/m.0/cv2/conv/Conv_output_0"
    output: "/model.8/m.0/m/m.0/cv2/act/Sigmoid_output_0"
    name: "/model.8/m.0/m/m.0/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.8/m.0/m/m.0/cv2/conv/Conv_output_0"
    input: "/model.8/m.0/m/m.0/cv2/act/Sigmoid_output_0"
    output: "/model.8/m.0/m/m.0/cv2/act/Mul_output_0"
    name: "/model.8/m.0/m/m.0/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.8/m.0/cv1/act/Mul_output_0"
    input: "/model.8/m.0/m/m.0/cv2/act/Mul_output_0"
    output: "/model.8/m.0/m/m.0/Add_output_0"
    name: "/model.8/m.0/m/m.0/Add"
    op_type: "Add"
  }
  node {
    input: "/model.8/m.0/m/m.0/Add_output_0"
    input: "model.8.m.0.m.1.cv1.conv.weight"
    input: "model.8.m.0.m.1.cv1.conv.bias"
    output: "/model.8/m.0/m/m.1/cv1/conv/Conv_output_0"
    name: "/model.8/m.0/m/m.1/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.8/m.0/m/m.1/cv1/conv/Conv_output_0"
    output: "/model.8/m.0/m/m.1/cv1/act/Sigmoid_output_0"
    name: "/model.8/m.0/m/m.1/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.8/m.0/m/m.1/cv1/conv/Conv_output_0"
    input: "/model.8/m.0/m/m.1/cv1/act/Sigmoid_output_0"
    output: "/model.8/m.0/m/m.1/cv1/act/Mul_output_0"
    name: "/model.8/m.0/m/m.1/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.8/m.0/m/m.1/cv1/act/Mul_output_0"
    input: "model.8.m.0.m.1.cv2.conv.weight"
    input: "model.8.m.0.m.1.cv2.conv.bias"
    output: "/model.8/m.0/m/m.1/cv2/conv/Conv_output_0"
    name: "/model.8/m.0/m/m.1/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.8/m.0/m/m.1/cv2/conv/Conv_output_0"
    output: "/model.8/m.0/m/m.1/cv2/act/Sigmoid_output_0"
    name: "/model.8/m.0/m/m.1/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.8/m.0/m/m.1/cv2/conv/Conv_output_0"
    input: "/model.8/m.0/m/m.1/cv2/act/Sigmoid_output_0"
    output: "/model.8/m.0/m/m.1/cv2/act/Mul_output_0"
    name: "/model.8/m.0/m/m.1/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.8/m.0/m/m.0/Add_output_0"
    input: "/model.8/m.0/m/m.1/cv2/act/Mul_output_0"
    output: "/model.8/m.0/m/m.1/Add_output_0"
    name: "/model.8/m.0/m/m.1/Add"
    op_type: "Add"
  }
  node {
    input: "/model.8/m.0/m/m.1/Add_output_0"
    input: "/model.8/m.0/cv2/act/Mul_output_0"
    output: "/model.8/m.0/Concat_output_0"
    name: "/model.8/m.0/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.8/m.0/Concat_output_0"
    input: "model.8.m.0.cv3.conv.weight"
    input: "model.8.m.0.cv3.conv.bias"
    output: "/model.8/m.0/cv3/conv/Conv_output_0"
    name: "/model.8/m.0/cv3/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.8/m.0/cv3/conv/Conv_output_0"
    output: "/model.8/m.0/cv3/act/Sigmoid_output_0"
    name: "/model.8/m.0/cv3/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.8/m.0/cv3/conv/Conv_output_0"
    input: "/model.8/m.0/cv3/act/Sigmoid_output_0"
    output: "/model.8/m.0/cv3/act/Mul_output_0"
    name: "/model.8/m.0/cv3/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.8/Split_output_0"
    input: "/model.8/Split_output_1"
    input: "/model.8/m.0/cv3/act/Mul_output_0"
    output: "/model.8/Concat_output_0"
    name: "/model.8/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.8/Concat_output_0"
    input: "model.8.cv2.conv.weight"
    input: "model.8.cv2.conv.bias"
    output: "/model.8/cv2/conv/Conv_output_0"
    name: "/model.8/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.8/cv2/conv/Conv_output_0"
    output: "/model.8/cv2/act/Sigmoid_output_0"
    name: "/model.8/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.8/cv2/conv/Conv_output_0"
    input: "/model.8/cv2/act/Sigmoid_output_0"
    output: "/model.8/cv2/act/Mul_output_0"
    name: "/model.8/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.8/cv2/act/Mul_output_0"
    input: "model.9.cv1.conv.weight"
    input: "model.9.cv1.conv.bias"
    output: "/model.9/cv1/conv/Conv_output_0"
    name: "/model.9/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.9/cv1/conv/Conv_output_0"
    output: "/model.9/cv1/act/Sigmoid_output_0"
    name: "/model.9/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.9/cv1/conv/Conv_output_0"
    input: "/model.9/cv1/act/Sigmoid_output_0"
    output: "/model.9/cv1/act/Mul_output_0"
    name: "/model.9/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.9/cv1/act/Mul_output_0"
    output: "/model.9/m/MaxPool_output_0"
    name: "/model.9/m/MaxPool"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.9/m/MaxPool_output_0"
    output: "/model.9/m_1/MaxPool_output_0"
    name: "/model.9/m_1/MaxPool"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.9/m_1/MaxPool_output_0"
    output: "/model.9/m_2/MaxPool_output_0"
    name: "/model.9/m_2/MaxPool"
    op_type: "MaxPool"
    attribute {
      name: "ceil_mode"
      i: 0
      type: INT
    }
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "kernel_shape"
      ints: 5
      ints: 5
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 2
      ints: 2
      ints: 2
      ints: 2
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.9/cv1/act/Mul_output_0"
    input: "/model.9/m/MaxPool_output_0"
    input: "/model.9/m_1/MaxPool_output_0"
    input: "/model.9/m_2/MaxPool_output_0"
    output: "/model.9/Concat_output_0"
    name: "/model.9/Concat"
    op_type: "Concat"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.9/Concat_output_0"
    input: "model.9.cv2.conv.weight"
    input: "model.9.cv2.conv.bias"
    output: "/model.9/cv2/conv/Conv_output_0"
    name: "/model.9/cv2/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.9/cv2/conv/Conv_output_0"
    output: "/model.9/cv2/act/Sigmoid_output_0"
    name: "/model.9/cv2/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.9/cv2/conv/Conv_output_0"
    input: "/model.9/cv2/act/Sigmoid_output_0"
    output: "/model.9/cv2/act/Mul_output_0"
    name: "/model.9/cv2/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.9/cv2/act/Mul_output_0"
    input: "model.10.cv1.conv.weight"
    input: "model.10.cv1.conv.bias"
    output: "/model.10/cv1/conv/Conv_output_0"
    name: "/model.10/cv1/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.10/cv1/conv/Conv_output_0"
    output: "/model.10/cv1/act/Sigmoid_output_0"
    name: "/model.10/cv1/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.10/cv1/conv/Conv_output_0"
    input: "/model.10/cv1/act/Sigmoid_output_0"
    output: "/model.10/cv1/act/Mul_output_0"
    name: "/model.10/cv1/act/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.10/cv1/act/Mul_output_0"
    input: "onnx::Split_262"
    output: "/model.10/Split_output_0"
    output: "/model.10/Split_output_1"
    name: "/model.10/Split"
    op_type: "Split"
    attribute {
      name: "axis"
      i: 1
      type: INT
    }
  }
  node {
    input: "/model.10/Split_output_1"
    input: "model.10.m.0.attn.qkv.conv.weight"
    input: "model.10.m.0.attn.qkv.conv.bias"
    output: "/model.10/m/m.0/attn/qkv/conv/Conv_output_0"
    name: "/model.10/m/m.0/attn/qkv/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.10/m/m.0/attn/qkv/conv/Conv_output_0"
    input: "/model.10/m/m.0/attn/Constant_output_0"
    output: "/model.10/m/m.0/attn/Reshape_output_0"
    name: "/model.10/m/m.0/attn/Reshape"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/model.10/m/m.0/attn/Reshape_output_0"
    input: "onnx::Split_326"
    output: "/model.10/m/m.0/attn/Split_output_0"
    output: "/model.10/m/m.0/attn/Split_output_1"
    output: "/model.10/m/m.0/attn/Split_output_2"
    name: "/model.10/m/m.0/attn/Split"
    op_type: "Split"
    attribute {
      name: "axis"
      i: 2
      type: INT
    }
  }
  node {
    input: "/model.10/m/m.0/attn/Split_output_0"
    output: "/model.10/m/m.0/attn/Transpose_output_0"
    name: "/model.10/m/m.0/attn/Transpose"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 1
      ints: 3
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.10/m/m.0/attn/Split_output_2"
    input: "/model.10/m/m.0/attn/Constant_3_output_0"
    output: "/model.10/m/m.0/attn/Reshape_2_output_0"
    name: "/model.10/m/m.0/attn/Reshape_2"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/model.10/m/m.0/attn/Transpose_output_0"
    input: "/model.10/m/m.0/attn/Split_output_1"
    output: "/model.10/m/m.0/attn/MatMul_output_0"
    name: "/model.10/m/m.0/attn/MatMul"
    op_type: "MatMul"
  }
  node {
    input: "/model.10/m/m.0/attn/Reshape_2_output_0"
    input: "model.10.m.0.attn.pe.conv.weight"
    input: "model.10.m.0.attn.pe.conv.bias"
    output: "/model.10/m/m.0/attn/pe/conv/Conv_output_0"
    name: "/model.10/m/m.0/attn/pe/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 256
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 3
      ints: 3
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 1
      ints: 1
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.10/m/m.0/attn/MatMul_output_0"
    input: "/model.10/m/m.0/attn/Constant_1_output_0"
    output: "/model.10/m/m.0/attn/Mul_output_0"
    name: "/model.10/m/m.0/attn/Mul"
    op_type: "Mul"
  }
  node {
    input: "/model.10/m/m.0/attn/Mul_output_0"
    output: "/model.10/m/m.0/attn/Softmax_output_0"
    name: "/model.10/m/m.0/attn/Softmax"
    op_type: "Softmax"
    attribute {
      name: "axis"
      i: -1
      type: INT
    }
  }
  node {
    input: "/model.10/m/m.0/attn/Softmax_output_0"
    output: "/model.10/m/m.0/attn/Transpose_1_output_0"
    name: "/model.10/m/m.0/attn/Transpose_1"
    op_type: "Transpose"
    attribute {
      name: "perm"
      ints: 0
      ints: 1
      ints: 3
      ints: 2
      type: INTS
    }
  }
  node {
    input: "/model.10/m/m.0/attn/Split_output_2"
    input: "/model.10/m/m.0/attn/Transpose_1_output_0"
    output: "/model.10/m/m.0/attn/MatMul_1_output_0"
    name: "/model.10/m/m.0/attn/MatMul_1"
    op_type: "MatMul"
  }
  node {
    input: "/model.10/m/m.0/attn/MatMul_1_output_0"
    input: "/model.10/m/m.0/attn/Constant_3_output_0"
    output: "/model.10/m/m.0/attn/Reshape_1_output_0"
    name: "/model.10/m/m.0/attn/Reshape_1"
    op_type: "Reshape"
    attribute {
      name: "allowzero"
      i: 0
      type: INT
    }
  }
  node {
    input: "/model.10/m/m.0/attn/Reshape_1_output_0"
    input: "/model.10/m/m.0/attn/pe/conv/Conv_output_0"
    output: "/model.10/m/m.0/attn/Add_output_0"
    name: "/model.10/m/m.0/attn/Add"
    op_type: "Add"
  }
  node {
    input: "/model.10/m/m.0/attn/Add_output_0"
    input: "model.10.m.0.attn.proj.conv.weight"
    input: "model.10.m.0.attn.proj.conv.bias"
    output: "/model.10/m/m.0/attn/proj/conv/Conv_output_0"
    name: "/model.10/m/m.0/attn/proj/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.10/Split_output_1"
    input: "/model.10/m/m.0/attn/proj/conv/Conv_output_0"
    output: "/model.10/m/m.0/Add_output_0"
    name: "/model.10/m/m.0/Add"
    op_type: "Add"
  }
  node {
    input: "/model.10/m/m.0/Add_output_0"
    input: "model.10.m.0.ffn.0.conv.weight"
    input: "model.10.m.0.ffn.0.conv.bias"
    output: "/model.10/m/m.0/ffn/ffn.0/conv/Conv_output_0"
    name: "/model.10/m/m.0/ffn/ffn.0/conv/Conv"
    op_type: "Conv"
    attribute {
      name: "dilations"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "group"
      i: 1
      type: INT
    }
    attribute {
      name: "kernel_shape"
      ints: 1
      ints: 1
      type: INTS
    }
    attribute {
      name: "pads"
      ints: 0
      ints: 0
      ints: 0
      ints: 0
      type: INTS
    }
    attribute {
      name: "strides"
      ints: 1
      ints: 1
      type: INTS
    }
  }
  node {
    input: "/model.10/m/m.0/ffn/ffn.0/conv/Conv_output_0"
    output: "/model.10/m/m.0/ffn/ffn.0/act/Sigmoid_output_0"
    name: "/model.10/m/m.0/ffn/ffn.0/act/Sigmoid"
    op_type: "Sigmoid"
  }
  node {
    input: "/model.10/m/m.0/ffn/ffn.0/conv/Conv_output_0"
    input: "/model.10/m/m.0/ffn/ffn.0/act/Sigmoid_output_0"
    output: "/model.10/m/m.0/ffn/ffn.0/act/Mul_output_0"
