#loc = loc(unknown)
module @yolo11s attributes {module.FLOPs = 3787969080 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "cv181x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.mode = "INT8", module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_LOWERED", module.top_run_mode = "STATIC", module.weight_file = "yolo11s_tpu_lowered_cv181x_int8_sym_weight.npz"} {
  func.func @main(%arg0: tensor<1x3x224x320xf32> loc(unknown)) -> (tensor<1x1x4x1470xf32>, tensor<1x4x1470xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [224, 320], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627]} : (tensor<1x3x224x320xf32>) -> tensor<1x3x224x320x!quant.calibrated<f32<-1.000000e+00:1.000000e+00>>> loc(#loc1)
    %2 = "tpu.GenericCpu"(%1) {cpu_op_name = "quant", param = {from = "FP32", scale = 1.270000e+02 : f32, to = "INT8"}} : (tensor<1x3x224x320x!quant.calibrated<f32<-1.000000e+00:1.000000e+00>>>) -> tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<32x3x3x3xsi8> loc(#loc3)
    %4 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc4)
    %5 = "tpu.Conv2D"(%2, %3, %4) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1210087552, 1460211584, 1519423872, 1701917824, 1925493760, 1471771648, 1857225856, 1530589184, 1355583872, 1294185216, 1104819712, 1437758720, 1074902272, 1881570688, 1233632640, 1881122304, 1418638848, 1806401408, 1116437760, 1802742272, 1294328448, 1764426368, 1639488256, 1484759168, 1478662016, 1350295936, 1255048064, 1790350976, 1845641984, 2112380288, 1705584512, 1710843648], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [7, 8, 8, 8, 7, 8, 7, 8, 7, 8, 8, 8, 7, 11, 10, 9, 8, 8, 6, 9, 7, 7, 9, 8, 8, 11, 8, 8, 7, 8, 9, 7], strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>>, tensor<32x3x3x3xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x112x160x!quant.uniform<i8:f32, 0.49818741417322837>> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc6)
    %7 = "tpu.Lut"(%5, %6) : (tensor<1x32x112x160x!quant.uniform<i8:f32, 0.49818741417322837>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x112x160x!quant.uniform<i8:f32, 0.46105073937007873>> loc(#loc7)
    %8 = "top.Weight"() : () -> tensor<64x32x3x3xsi8> loc(#loc8)
    %9 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc9)
    %10 = "tpu.Conv2D"(%7, %8, %9) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1243588480, 1512509568, 1560436480, 1349897216, 1815426816, 1719839616, 1539503360, 1126744064, 1418434432, 1943511168, 1412607872, 1439608448, 1577883904, 1384331008, 1217906560, 1828072192, 1595585024, 1885547520, 1662237824, 1139826816, 1162352128, 2097095040, 1145029760, 1535756032, 2001693184, 1122700416, 1343494144, 1565543680, 1465709440, 1711256192, 1434859904, 1104709504, 1308935552, 1778456320, 1605009280, 1349727744, 1946133376, 2087135232, 1399405440, 1756260736, 1749671680, 2006181632, 1666011264, 1940705152, 1089735680, 1700216960, 1596452992, 1569467392, 1820171136, 1311370240, 1979555840, 1171255168, 1143205888, 1494890496, 1392073088, 2136367104, 1663388928, 1347364480, 1162317824, 1104095744, 1631282560, 1977298304, 1824763008, 1584242688], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [8, 9, 8, 9, 10, 8, 9, 8, 7, 8, 7, 8, 8, 8, 7, 9, 9, 8, 8, 7, 9, 9, 8, 8, 8, 8, 8, 8, 9, 8, 8, 7, 9, 7, 8, 8, 9, 8, 7, 9, 10, 8, 8, 8, 8, 7, 8, 8, 9, 8, 8, 8, 8, 8, 9, 9, 8, 8, 9, 7, 7, 8, 9, 9], strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x112x160x!quant.uniform<i8:f32, 0.46105073937007873>>, tensor<64x32x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x56x80x!quant.uniform<i8:f32, 0.6094166228346457>> loc(#loc10)
    %11 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc11)
    %12 = "tpu.Lut"(%10, %11) : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.6094166228346457>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x56x80x!quant.uniform<i8:f32, 0.47554662362204719>> loc(#loc12)
    %13 = "top.Weight"() : () -> tensor<64x64x1x1xsi8> loc(#loc13)
    %14 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc14)
    %15 = "tpu.Conv2D"(%12, %13, %14) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1674319872, 1115277568, 1797232000, 1748087936, 1623941504, 1713856768, 1774013440, 2129005824, 1147061376, 1637660672, 1445929216, 2056676096, 1490268288, 1481853952, 1528362752, 1154568320, 1159694592, 2132933504, 1910199424, 1412362496, 1474251136, 1394830080, 2145196288, 1454204928, 1853528832, 1480835200, 1663977600, 1904803456, 1355571072, 1500175616, 1557914752, 1348581504, 2006073728, 2135388800, 2097206912, 1282570240, 2030685056, 1907115520, 1438104192, 1105676672, 1661963136, 1821142528, 1196422144, 1847061248, 2000644608, 1538903936, 1188339584, 1387171968, 1543862528, 1494252672, 1848856320, 1330062080, 1474360960, 1150328960, 1109748224, 1079602304, 1273002240, 2075317888, 1368440064, 1230301568, 1469151616, 1650908800, 1376045440, 1292932736], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [7, 7, 7, 8, 8, 7, 8, 8, 7, 8, 8, 7, 6, 7, 7, 8, 8, 7, 8, 7, 7, 7, 9, 7, 8, 7, 8, 7, 7, 9, 7, 7, 9, 8, 9, 9, 7, 8, 6, 8, 7, 7, 8, 6, 9, 8, 9, 6, 9, 6, 7, 6, 8, 9, 7, 5, 6, 7, 8, 6, 8, 6, 6, 8], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.47554662362204719>>, tensor<64x64x1x1xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x56x80x!quant.uniform<i8:f32, 0.2627664401574803>> loc(#loc15)
    %16 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc16)
    %17 = "tpu.Lut"(%15, %16) : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.2627664401574803>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x56x80x!quant.uniform<i8:f32, 0.14772613385826772>> loc(#loc17)
    %18 = "tpu.Slice"(%17, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 32, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, none, none, none, none) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>> loc(#loc18)
    %19 = "tpu.Slice"(%17, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, none, none, none, none) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>> loc(#loc19)
    %20 = "top.Weight"() : () -> tensor<16x32x3x3xsi8> loc(#loc20)
    %21 = "top.Weight"() : () -> tensor<1x16x1x1xi32> loc(#loc21)
    %22 = "tpu.Conv2D"(%19, %20, %21) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1824145408, 1251503488, 1682123648, 1451949824, 1916222208, 1113516544, 1628823168, 1872235136, 1830173568, 1947321344, 1337295360, 2005245568, 1967038848, 1486297216, 1787761280, 1507357312], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [7, 6, 7, 7, 7, 7, 7, 7, 8, 6, 6, 6, 7, 6, 7, 6], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, tensor<16x32x3x3xsi8>, tensor<1x16x1x1xi32>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.074481342519685037>> loc(#loc22)
    %23 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc23)
    %24 = "tpu.Lut"(%22, %23) : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.074481342519685037>>, tensor<1x1x1x256xsi8>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>> loc(#loc24)
    %25 = "top.Weight"() : () -> tensor<32x16x3x3xsi8> loc(#loc25)
    %26 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc26)
    %27 = "tpu.Conv2D"(%24, %25, %26) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1442386816, 1493658880, 1525668352, 1488353792, 1738167552, 1490488192, 1292064896, 1979238016, 1364344320, 2059579392, 2051364480, 1957107840, 1344929920, 2093342848, 1542156416, 1694102272, 1453549568, 1546681600, 1757885312, 1155479296, 1656809728, 1852228352, 1126170496, 1296483328, 1870270208, 1844274048, 1493225344, 1297448832, 1695301632, 1434126976, 1520930176, 1472485248], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [7, 8, 8, 8, 8, 7, 7, 8, 8, 8, 8, 8, 8, 8, 8, 8, 7, 8, 8, 7, 8, 8, 7, 7, 8, 8, 8, 7, 8, 8, 7, 7], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>>, tensor<32x16x3x3xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.11104472913385827>> loc(#loc27)
    %28 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc28)
    %29 = "tpu.Lut"(%27, %28) : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.11104472913385827>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>> loc(#loc29)
    %30 = "tpu.Add"(%19, %29) {do_relu = false, multipliers = [70, 46], relu_limit = -1.000000e+00 : f64, rshifts = [6]} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.13364397952755905>> loc(#loc30)
    %31 = "tpu.Concat"(%18, %19, %30) {axis = 1 : si32, do_relu = false, multipliers = [1, 1, 115], only_merge = false, relu_limit = -1.000000e+00 : f64, rshifts = [0, 0, 7]} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, tensor<1x32x56x80x!quant.uniform<i8:f32, 0.13364397952755905>>) -> tensor<1x96x56x80x!quant.uniform<i8:f32, 0.14772613385826772>> loc(#loc31)
    %32 = "top.Weight"() : () -> tensor<128x96x1x1xsi8> loc(#loc32)
    %33 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc33)
    %34 = "tpu.Conv2D"(%31, %32, %33) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1289512448, 1909148800, 1971661952, 1624793984, 1678688256, 1240486784, 1897019392, 1551672320, 1182024064, 1323380992, 1215232256, 1184827520, 2113497472, 1658912384, 1084769920, 1779296384, 1786111360, 1384462336, 1989413760, 1259211904, 1111446528, 1952524672, 1875090944, 1502727168, 2048696704, 2117388032, 1642031232, 1429552128, 1415071616, 2012526080, 1512380800, 1080507264, 1422241792, 1238989184, 1286076160, 1764719744, 1812083200, 1952678784, 1983515520, 2114966784, 1660583808, 1968860544, 1583544832, 1196927104, 1959972096, 1481403520, 2053478656, 1133080704, 1535886464, 1087714176, 1604952960, 1892051584, 1635787136, 1749601280, 1405331840, 1704564224, 1562890752, 1374115712, 1821369984, 1136336768, 1590219392, 1911807616, 1921367552, 1154848512, 1970597504, 2022720384, 2145524224, 1624088576, 1325083008, 2001688192, 1960228224, 1165163776, 1349274368, 1438809856, 2126823808, 1839944576, 1308099072, 1650888064, 1474639488, 1700994432, 1805601152, 1928133376, 1813932160, 1415330304, 1625762432, 1677866240, 1859463808, 1168283008, 1619237120, 1972482304, 1520147072, 2097109760, 1959006336, 1520754688, 1615173632, 1393534208, 1231788032, 1173130752, 1355697152, 1204325504, 1944858624, 1213081344, 1626330240, 2027634944, 1826955264, 1238290304, 1204634368, 1514554752, 1891581056, 1589353984, 1842833024, 1543960576, 1573380224, 1355163264, 1832722688, 1444387200, 1078176384, 2083899392, 1612623232, 1598566400, 2091822976, 1236023680, 1303610368, 1267046016, 1747796736, 1988489472, 1260947328, 1190755840], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [7, 8, 8, 8, 8, 7, 8, 7, 6, 7, 7, 7, 8, 8, 7, 8, 8, 7, 9, 8, 7, 8, 8, 7, 8, 7, 9, 7, 7, 8, 8, 7, 8, 7, 7, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 9, 7, 7, 7, 8, 8, 8, 8, 7, 8, 8, 7, 8, 7, 7, 8, 8, 7, 8, 8, 8, 8, 8, 8, 8, 7, 8, 8, 7, 8, 7, 8, 8, 8, 7, 8, 8, 8, 8, 8, 8, 7, 8, 8, 7, 8, 8, 8, 7, 8, 7, 7, 6, 7, 8, 7, 8, 8, 8, 7, 6, 8, 8, 8, 7, 8, 8, 8, 8, 7, 7, 8, 7, 7, 8, 8, 8, 7, 8, 8, 7, 7], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x96x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, tensor<128x96x1x1xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x56x80x!quant.uniform<i8:f32, 0.13573605984251969>> loc(#loc34)
    %35 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc35)
    %36 = "tpu.Lut"(%34, %35) : (tensor<1x128x56x80x!quant.uniform<i8:f32, 0.13573605984251969>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>> loc(#loc36)
    %37 = "top.Weight"() : () -> tensor<128x128x3x3xsi8> loc(#loc37)
    %38 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc38)
    %39 = "tpu.Conv2D"(%36, %37, %38) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1745923456, 1963913984, 1317531520, 1146583936, 1883961600, 1156006272, 1209796352, 1384611712, 1673142400, 1924903552, 1395070080, 1392883456, 1986904704, 1942646656, 1252795264, 1308144640, 1754757760, 1194414080, 1217775360, 1257532544, 1575115776, 1763128832, 1874188160, 1457827712, 1529346304, 1220584704, 1401656704, 1735330304, 2074364160, 1232563584, 1854313088, 1306899712, 1428676352, 1931723904, 1511204736, 1082014464, 1160689024, 2006898688, 1727016832, 2090193792, 1790648576, 1503868160, 1359091456, 1336478720, 1155650304, 1427738880, 1976382976, 1989128448, 1673301504, 1524462336, 1492124928, 1836698368, 1200005888, 1383257856, 2112129152, 1836037888, 1448971392, 2018006656, 1139833856, 2105824256, 2041853824, 1175389440, 1130893184, 1990362624, 1944095744, 1404891264, 1201660416, 1656001792, 1627064832, 1323884032, 1217717248, 2017358592, 1517696256, 1172137216, 1097540352, 1170634752, 1417045248, 1771743616, 1185127424, 1366051840, 1829709056, 2005089408, 2117729536, 1140175232, 2020655104, 1904774656, 1212404480, 2121814272, 1522287488, 1837343872, 1879308928, 2017650176, 1652145792, 1643635584, 1584252160, 1250209536, 1134543104, 1586871936, 1920304640, 2021630848, 1672671232, 1694711168, 1919284480, 1671775744, 1543090816, 1889091968, 1487956480, 1541878528, 1785443968, 1588715776, 1470423808, 1290040320, 1408469376, 2142027008, 1288084352, 1854907904, 1081417088, 1385493504, 1358583168, 1403867136, 1457951744, 1832806144, 1723038848, 2093422976, 1127716096, 1578255744, 1710695680, 1240060544], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [10, 10, 9, 8, 10, 9, 10, 10, 9, 9, 10, 9, 10, 10, 9, 9, 10, 9, 9, 9, 10, 10, 11, 9, 10, 10, 10, 10, 10, 9, 10, 10, 10, 11, 10, 8, 9, 10, 10, 10, 10, 9, 9, 9, 9, 9, 10, 10, 9, 11, 9, 9, 9, 10, 11, 11, 9, 11, 9, 10, 10, 9, 9, 10, 10, 9, 9, 10, 10, 9, 9, 10, 10, 9, 8, 9, 9, 10, 9, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 10, 11, 10, 9, 10, 9, 9, 10, 10, 10, 9, 10, 11, 10, 9, 9, 11, 9, 10, 11, 10, 10, 9, 10, 9, 10, 10, 10, 9, 10, 10, 10, 10, 11, 9, 10, 10, 9], strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>>, tensor<128x128x3x3xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x28x40x!quant.uniform<i8:f32, 0.062709842519685047>> loc(#loc39)
    %40 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc40)
    %41 = "tpu.Lut"(%39, %40) : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.062709842519685047>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054424705511811021>> loc(#loc41)
    %42 = "top.Weight"() : () -> tensor<128x128x1x1xsi8> loc(#loc42)
    %43 = "top.Weight"() : () -> tensor<1x128x1x1xi32> loc(#loc43)
    %44 = "tpu.Conv2D"(%41, %42, %43) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1154898688, 1393834624, 2075951104, 1809333376, 1272930688, 1394639360, 1481180800, 1284164864, 1123169280, 1310580352, 1286983808, 1400792064, 1906460544, 1707010944, 1819664384, 1890865536, 2067810432, 1707000320, 1560570752, 1507985408, 1878805504, 1763146752, 1223681920, 2048629504, 1989051008, 1271053568, 1341910528, 1534413824, 1673238656, 1364674944, 1589403136, 1300567808, 1802168320, 1835560960, 1228575872, 1348415616, 1559432448, 2108236800, 1921389568, 1447737344, 2037799680, 2131079168, 1686132864, 1790304512, 1814935296, 1980042240, 1782007296, 1303309952, 1382329856, 1855860608, 1762550528, 2007851648, 1743246592, 1546823040, 2003508480, 2059414400, 1793532032, 1874300928, 1485548928, 1697281408, 1289330304, 1478305536, 1374759552, 1817715072, 1190794112, 1224004608, 2106224512, 1632884480, 1205539072, 1158542336, 1588268928, 1635254656, 2009982592, 1381951488, 1372361984, 1230602240, 1919228544, 1992996480, 1266159232, 1353102080, 1715063424, 1924131072, 1544589440, 1190700416, 1109231104, 1249288960, 1810496384, 1613326208, 1706336768, 1316036480, 2126660864, 1143753856, 1283740288, 1672521984, 1863369216, 1222738048, 2049609856, 1723213824, 1458922240, 1233593984, 2146566784, 1614278656, 2015880192, 1344386688, 1974323584, 1827985536, 1082559872, 1931741952, 1946658176, 1633371008, 2120970752, 1719921408, 1430010624, 1792680448, 1131178496, 1907603072, 1306354688, 1118070912, 1391399424, 1557123968, 1394713088, 1193066496, 1728578048, 1199564288, 1798994176, 1412609536, 2141504384, 1185982848], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [7, 9, 7, 8, 7, 7, 8, 7, 6, 7, 8, 8, 8, 7, 8, 8, 8, 8, 7, 8, 9, 8, 7, 7, 8, 7, 8, 7, 7, 8, 8, 8, 8, 7, 8, 8, 8, 8, 8, 8, 9, 8, 8, 9, 7, 8, 7, 8, 8, 8, 8, 9, 8, 8, 7, 8, 7, 8, 8, 9, 7, 7, 7, 7, 8, 8, 8, 8, 8, 8, 8, 8, 9, 7, 8, 8, 9, 9, 8, 8, 7, 8, 8, 8, 8, 8, 8, 9, 9, 9, 9, 8, 9, 9, 9, 8, 9, 9, 9, 8, 9, 9, 9, 8, 9, 9, 8, 8, 9, 8, 9, 9, 8, 9, 8, 9, 8, 8, 8, 9, 8, 8, 7, 8, 9, 8, 9, 7], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054424705511811021>>, tensor<128x128x1x1xsi8>, tensor<1x128x1x1xi32>) -> tensor<1x128x28x40x!quant.uniform<i8:f32, 0.062148030708661414>> loc(#loc44)
    %45 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc45)
    %46 = "tpu.Lut"(%44, %45) : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.062148030708661414>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054269591338582682>> loc(#loc46)
    %47 = "tpu.Slice"(%46, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054269591338582682>>, none, none, none, none) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054269591338582682>> loc(#loc47)
    %48 = "tpu.Slice"(%46, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 64, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054269591338582682>>, none, none, none, none) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054269591338582682>> loc(#loc48)
    %49 = "top.Weight"() : () -> tensor<32x64x3x3xsi8> loc(#loc49)
    %50 = "top.Weight"() : () -> tensor<1x32x1x1xi32> loc(#loc50)
    %51 = "tpu.Conv2D"(%48, %49, %50) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1324582272, 1712332288, 1092719488, 1537666048, 1547693696, 1103624960, 1938898816, 1533368192, 1648169344, 1683121280, 1960982912, 1099203456, 1138077696, 1541344384, 1841155712, 2114009344, 1132900992, 1783014144, 1981043072, 1758802944, 1958628352, 2049068032, 1396178048, 1259964032, 1354676096, 1125716864, 1110401024, 1900331776, 2026406528, 1127854848, 1255250432, 1130514176], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [8, 9, 8, 8, 8, 8, 8, 9, 8, 9, 8, 7, 7, 8, 9, 8, 8, 9, 8, 9, 8, 9, 8, 9, 7, 8, 8, 9, 8, 7, 8, 7], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054269591338582682>>, tensor<32x64x3x3xsi8>, tensor<1x32x1x1xi32>) -> tensor<1x32x28x40x!quant.uniform<i8:f32, 0.043688266929133864>> loc(#loc51)
    %52 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc52)
    %53 = "tpu.Lut"(%51, %52) : (tensor<1x32x28x40x!quant.uniform<i8:f32, 0.043688266929133864>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x28x40x!quant.uniform<i8:f32, 0.038853287401574801>> loc(#loc53)
    %54 = "top.Weight"() : () -> tensor<64x32x3x3xsi8> loc(#loc54)
    %55 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc55)
    %56 = "tpu.Conv2D"(%53, %54, %55) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1587546368, 1175800960, 1896516608, 1291346560, 1866390784, 1900775168, 1502347264, 1681900416, 1406688256, 2083147520, 1831620224, 1730692992, 1088571648, 1083286272, 1076214272, 1209368576, 1508768256, 1171223552, 1219905920, 1661152768, 1929737600, 1769890816, 1846269440, 1489873024, 1730856704, 1283540480, 1860228608, 1179175168, 1662375552, 1554674048, 1116340864, 1202239616, 1606939648, 1766550784, 2020054400, 1837905024, 1294470656, 1405497984, 1625625088, 1614098816, 1488968064, 1157692160, 1220035968, 1466476928, 1200945408, 1106668928, 1981623552, 1080729344, 1718896384, 1277283072, 1632442368, 1381241728, 1625122944, 1106684416, 1443065728, 1692432640, 1752291840, 1083965440, 1595433088, 1978159104, 1120595968, 2053326848, 1197313024, 1288160384], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [9, 8, 9, 8, 9, 9, 8, 9, 9, 9, 8, 9, 8, 8, 7, 8, 9, 8, 8, 8, 9, 9, 9, 9, 9, 7, 9, 8, 9, 9, 8, 8, 9, 9, 9, 9, 8, 8, 8, 8, 9, 9, 8, 9, 9, 8, 9, 8, 8, 8, 8, 9, 9, 8, 8, 9, 9, 8, 9, 9, 8, 9, 8, 8], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x28x40x!quant.uniform<i8:f32, 0.038853287401574801>>, tensor<64x32x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.065839774803149606>> loc(#loc56)
    %57 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc57)
    %58 = "tpu.Lut"(%56, %57) : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.065839774803149606>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054567293700787403>> loc(#loc58)
    %59 = "tpu.Add"(%48, %58) {do_relu = false, multipliers = [123, 123], relu_limit = -1.000000e+00 : f64, rshifts = [7]} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054269591338582682>>, tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054567293700787403>>) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.05634539527559055>> loc(#loc59)
    %60 = "tpu.Concat"(%47, %48, %59) {axis = 1 : si32, do_relu = false, multipliers = [126, 126, 65], only_merge = false, relu_limit = -1.000000e+00 : f64, rshifts = [7, 7, 6]} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054269591338582682>>, tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054269591338582682>>, tensor<1x64x28x40x!quant.uniform<i8:f32, 0.05634539527559055>>) -> tensor<1x192x28x40x!quant.uniform<i8:f32, 0.055055193700787403>> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<256x192x1x1xsi8> loc(#loc61)
    %62 = "top.Weight"() : () -> tensor<1x256x1x1xi32> loc(#loc62)
    %63 = "tpu.Conv2D"(%60, %61, %62) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1932439168, 1128316032, 1426090752, 2027846016, 1279503360, 1365406208, 1113694720, 1129714432, 2136019200, 1596846848, 2143155584, 1758311936, 1651212672, 1960658048, 1378979840, 1197300736, 1922106496, 1333494144, 1267160960, 2023443584, 1170096640, 1673606528, 1403669760, 1759123072, 1322084096, 1802969344, 1662623232, 1270499200, 1680560000, 2136214144, 1556049792, 1172323072, 1715306880, 1104264448, 2082560640, 1245937920, 1568255360, 2107139712, 1741921408, 1759245696, 1965261824, 1221494400, 1251886720, 1500539392, 1610719360, 1734781056, 2090513024, 1247342336, 1282953600, 1275620352, 1469153536, 1492107008, 1546589184, 1098934912, 1086549632, 1861096192, 1140892032, 1181075584, 1377107968, 1142036352, 1212454528, 1174091776, 1349564032, 1322921472, 1813991424, 1431131904, 1489290752, 2085541504, 1262102656, 1403485568, 1242717824, 1282346880, 1516855168, 1177394432, 2108459904, 1204271616, 1326624128, 1960759680, 1120880000, 1408257152, 1180497408, 1445799424, 1710889472, 1139697536, 1221667072, 1675424896, 1295112960, 1198282368, 1680733952, 1995308672, 1399241600, 1777288960, 1642305792, 1702882432, 2123595008, 1384028032, 2142338048, 1986190848, 1454136576, 1140509696, 1489208832, 1311516544, 1355313152, 1094708352, 1944536704, 2034624128, 1298244096, 1091519232, 2020535552, 1254291712, 1338817280, 1146904704, 1214658688, 1972550016, 1550654592, 1256564224, 1836534656, 1677653760, 1950531456, 1110526336, 1305187328, 1870727168, 1175176704, 1148533760, 1357748480, 1260638848, 1110074496, 1262043136, 1597258240, 1977701888, 1138508032, 1114424832, 2043144576, 1867931392, 2056995200, 1593205760, 1277222912, 1714927744, 1994847232, 1964354048, 2022754944, 1994942336, 1245714688, 1981435136, 1734439680, 2048341248, 1202624896, 1671228416, 1472182144, 1360281856, 1630028160, 1548494848, 1883753984, 1249020672, 1161792768, 1320731904, 1454686976, 1722679552, 1143038464, 1183839744, 1536603136, 1506312704, 1949943680, 1383762816, 1202478592, 1479509376, 1075516032, 2051719296, 1655534080, 2098895872, 2131163392, 1158985344, 1947766784, 2049737856, 1470932096, 1904699904, 1175427712, 1744611456, 2083818496, 1713272960, 1437663360, 2072539008, 1360982656, 1378772480, 2115661696, 1449991552, 1094637056, 2016172672, 1123121920, 1930137216, 1347260288, 1910243968, 1184981120, 1597783424, 1866222208, 1940453632, 1144508544, 1474397184, 1256647296, 1648085632, 1171466112, 2075905792, 1842305536, 1509003520, 1684732672, 2097910912, 1866520576, 1651717120, 1358067328, 1909966208, 1279626624, 1560188416, 1272237056, 1481072384, 1148708480, 1499842304, 1139716608, 1856072448, 1216831360, 1367148288, 1108127488, 1092525696, 1164373888, 2034034176, 1198149248, 1162053504, 1224793472, 1384073728, 1701440640, 1285117952, 1319947776, 1795200512, 1514277632, 1762091264, 1840259840, 1783863168, 1314530560, 1788878720, 2037452544, 1420850304, 1516725376, 1647888640, 1447859584, 1251500288, 1293816320, 1269061888, 1177782272, 1493026688, 1451388544, 2025554944, 1869994496, 2145464960, 1713025152, 1903293056, 1563940736, 1416244608], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [9, 8, 8, 9, 8, 8, 8, 8, 9, 9, 9, 9, 8, 9, 9, 8, 9, 9, 8, 9, 8, 9, 7, 9, 8, 9, 8, 8, 9, 9, 9, 8, 9, 8, 9, 8, 8, 9, 8, 8, 9, 8, 8, 8, 9, 9, 9, 8, 8, 8, 9, 8, 9, 8, 8, 9, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 9, 8, 8, 8, 8, 8, 8, 9, 8, 8, 9, 9, 8, 8, 8, 9, 8, 8, 9, 8, 8, 10, 8, 8, 8, 8, 9, 10, 9, 9, 9, 8, 7, 9, 8, 8, 8, 9, 9, 8, 8, 9, 8, 9, 8, 8, 9, 8, 8, 9, 8, 8, 8, 8, 8, 8, 8, 8, 9, 8, 8, 9, 8, 8, 7, 9, 8, 9, 8, 8, 8, 9, 9, 9, 8, 8, 9, 9, 9, 8, 9, 9, 8, 9, 8, 10, 8, 8, 8, 8, 9, 8, 7, 9, 8, 9, 8, 8, 9, 8, 8, 9, 9, 9, 7, 9, 9, 8, 9, 8, 8, 9, 9, 9, 9, 8, 9, 9, 9, 8, 9, 8, 8, 8, 8, 8, 8, 8, 8, 8, 9, 9, 9, 8, 9, 8, 8, 9, 9, 9, 9, 8, 9, 8, 9, 8, 8, 8, 8, 8, 9, 8, 9, 8, 8, 9, 9, 8, 8, 8, 8, 8, 8, 8, 9, 8, 8, 9, 9, 8, 9, 9, 8, 9, 9, 8, 7, 9, 8, 8, 8, 8, 8, 8, 9, 8, 9, 9, 9], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x192x28x40x!quant.uniform<i8:f32, 0.055055193700787403>>, tensor<256x192x1x1xsi8>, tensor<1x256x1x1xi32>) -> tensor<1x256x28x40x!quant.uniform<i8:f32, 0.066453821259842533>> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc64)
    %65 = "tpu.Lut"(%63, %64) : (tensor<1x256x28x40x!quant.uniform<i8:f32, 0.066453821259842533>>, tensor<1x1x1x256xsi8>) -> tensor<1x256x28x40x!quant.uniform<i8:f32, 0.045217366141732281>> loc(#loc65)
    %66 = "top.Weight"() : () -> tensor<256x256x3x3xsi8> loc(#loc66)
    %67 = "top.Weight"() : () -> tensor<1x256x1x1xi32> loc(#loc67)
    %68 = "tpu.Conv2D"(%65, %66, %67) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1406677888, 1277662592, 1395353984, 1906658048, 2006265856, 1547020160, 2063915392, 1988626688, 2071100416, 1886939136, 1705194112, 1585921152, 2061133568, 1347740288, 1829864192, 1679056896, 1219393024, 1892352640, 1389865088, 1814630144, 1157346048, 1073899008, 1224961280, 1573779328, 1783426816, 1425079552, 1147414272, 1301219456, 2103092352, 1284439680, 1393189632, 1273472384, 1633222016, 1696339712, 1260520320, 1760278912, 1179120256, 1109496448, 1402250112, 1501642368, 1636113280, 1481252992, 1296528256, 1784206208, 1294925568, 1262483328, 1902089600, 1125464192, 1577636992, 1322269056, 2143831552, 1391995392, 2092341120, 1105929856, 1413419520, 2102340992, 1197385600, 2095366272, 1746514304, 1875887488, 1686941184, 1171585536, 1251463936, 1634681600, 1598158592, 2011692288, 2067789952, 2125718656, 1580502656, 1123813120, 1271608960, 1778199936, 1535035520, 1980711936, 1457546368, 1971458048, 1690012032, 1149026176, 1981363456, 1098209024, 1477264384, 1214590336, 1743621888, 1334564224, 1664314624, 1486680320, 1989605376, 1624096384, 1373953536, 1953214848, 1900065024, 1211480960, 1413258624, 1267724032, 1530255616, 1441789312, 2054219392, 1732765696, 1926786688, 2085831808, 1152243712, 1849825664, 1658443776, 1440836992, 1165188992, 1768805888, 1728273024, 1338685184, 1509249920, 1409993984, 1304646400, 1105990016, 1920173824, 1994147456, 1075714432, 1919290880, 1183228032, 1770155648, 1162584448, 1220597504, 1459959680, 1894097280, 2080535296, 1953334144, 1448376064, 2020617472, 1333470208, 2012587648, 1996669824, 1212706048, 1268196480, 1911059456, 1445308416, 1406014592, 1542516096, 1162368640, 1336407168, 1666467456, 1576551424, 1745601152, 1984724864, 1950320640, 1633787520, 2105147776, 1133421568, 1086588032, 1703495936, 1660800640, 1350462464, 2076286592, 1454687872, 1368785920, 1649652096, 2034866560, 1984150272, 1132950400, 2053823616, 1274009600, 1615122944, 1267653632, 1509885824, 1896375040, 1519831296, 1711122176, 1523096064, 1129042176, 1698532480, 1152241152, 1548893312, 1470829952, 1379292160, 1492638848, 1189586560, 1768192000, 1876007808, 1185590272, 1316706560, 1196574080, 1458993664, 1810262912, 1468795264, 1803536768, 1250332800, 1130462976, 1860332544, 1633042048, 1786128384, 1752804224, 1771027584, 1179693056, 1390145920, 1595396736, 1134006912, 1623854976, 1251040640, 1448357376, 1485623680, 2018653824, 1120734976, 1093116800, 1224060544, 1990046464, 1537602048, 1348450176, 1080727296, 1451883776, 1853013376, 1857325696, 1773116416, 1335330816, 1628019328, 1804617856, 1179548928, 1352032896, 1901217536, 1148677120, 1828850688, 1781596416, 1213956480, 1198127872, 1881573376, 1512797696, 1975638272, 1416009344, 1928757120, 1810145792, 1253687936, 1403873792, 1929250432, 1399414784, 1170368256, 1830256384, 2097244672, 1846223616, 1831536384, 1337354112, 2065543552, 1111070336, 1205872512, 1317894528, 1465297152, 1317202560, 1969442816, 1186305280, 1093413248, 1911291392, 1277105152, 1667396352, 1185056384, 1517839488, 1258876672, 1227808896, 1958422400, 1151266432, 1347856512, 1510351232], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [10, 11, 11, 12, 11, 10, 11, 11, 11, 11, 11, 11, 11, 10, 11, 11, 10, 10, 10, 10, 10, 10, 10, 11, 11, 10, 10, 10, 11, 10, 10, 10, 11, 11, 10, 11, 10, 10, 10, 11, 11, 11, 10, 10, 10, 10, 11, 10, 10, 11, 11, 10, 11, 10, 11, 11, 9, 11, 11, 11, 10, 11, 10, 11, 11, 11, 10, 10, 11, 9, 10, 11, 10, 11, 10, 11, 9, 10, 11, 10, 10, 10, 10, 10, 11, 10, 11, 10, 10, 11, 11, 10, 10, 10, 11, 10, 10, 11, 11, 11, 10, 12, 11, 10, 10, 11, 10, 11, 11, 11, 10, 10, 10, 12, 10, 11, 10, 11, 10, 10, 10, 11, 11, 11, 10, 11, 10, 12, 11, 10, 10, 11, 10, 10, 10, 10, 10, 11, 11, 10, 11, 11, 11, 10, 10, 9, 10, 10, 11, 11, 10, 11, 11, 11, 11, 10, 11, 10, 11, 10, 11, 12, 11, 10, 10, 10, 11, 10, 11, 10, 11, 11, 10, 11, 10, 10, 10, 10, 10, 11, 11, 11, 10, 10, 11, 10, 11, 11, 11, 10, 11, 11, 10, 11, 11, 10, 10, 11, 10, 10, 10, 11, 10, 10, 10, 10, 11, 11, 11, 10, 10, 11, 9, 10, 11, 9, 10, 11, 10, 11, 11, 10, 11, 10, 11, 11, 9, 10, 11, 11, 9, 11, 11, 10, 11, 11, 11, 10, 10, 11, 10, 10, 10, 10, 9, 11, 10, 11, 10, 11, 10, 9, 10, 10, 10, 10], strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x28x40x!quant.uniform<i8:f32, 0.045217366141732281>>, tensor<256x256x3x3xsi8>, tensor<1x256x1x1xi32>) -> tensor<1x256x14x20x!quant.uniform<i8:f32, 0.08080925511811024>> loc(#loc68)
    %69 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc69)
    %70 = "tpu.Lut"(%68, %69) : (tensor<1x256x14x20x!quant.uniform<i8:f32, 0.08080925511811024>>, tensor<1x1x1x256xsi8>) -> tensor<1x256x14x20x!quant.uniform<i8:f32, 0.054117548818897639>> loc(#loc70)
    %71 = "top.Weight"() : () -> tensor<256x256x1x1xsi8> loc(#loc71)
    %72 = "top.Weight"() : () -> tensor<1x256x1x1xi32> loc(#loc72)
    %73 = "tpu.Conv2D"(%70, %71, %72) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1465491072, 1130114560, 1135192320, 1911944064, 1994834304, 1564880000, 1921245184, 1977483136, 2129441280, 1323834624, 1788467072, 1074653568, 1219472128, 1457138560, 2135435392, 1509450624, 2049149184, 1732811904, 1727157504, 1692746624, 1858968320, 1783705344, 1759512704, 1408007680, 1272918144, 1545982976, 1994396928, 1173322752, 1459740288, 1091794688, 1584215808, 1693593728, 1621852160, 1894890624, 1839558144, 1327756288, 1655955328, 1460614144, 1301499008, 2035288320, 1414823552, 1456622080, 1098062336, 2010062720, 1684521984, 1968888704, 1385872896, 1446436992, 1580882176, 2053678336, 2022670848, 1731610624, 1998263808, 1194840064, 1379100800, 1422927360, 1080076416, 1326806016, 1269275008, 1903034240, 1878882176, 1738580224, 1544008704, 1497571840, 1298468096, 1935810560, 1375966208, 1674951680, 1326448000, 1086197760, 2036619008, 1692208000, 2013003904, 1497905920, 1138193536, 1256809088, 1466675968, 1100598272, 1413305216, 1883104384, 1095560448, 1134582656, 2107271552, 1611790592, 1368838912, 1090347136, 1736266880, 1508961280, 1580845312, 1341804288, 1901266816, 1169457536, 1967867648, 1221633280, 1737214336, 2046590080, 1486400640, 1257689728, 2103212288, 2122045824, 1931180288, 1610867328, 1424073856, 1362467584, 1333569408, 1535864832, 1106993024, 1400229888, 1102813440, 1440091520, 1486692224, 2090306816, 1250867968, 1860248320, 1768530688, 1878675328, 1090234880, 1100840960, 1429949952, 1182101120, 1884863744, 1286737152, 1762649344, 1391436032, 1843300864, 1757860480, 1371247232, 1397042560, 1170635904, 1582700544, 1571820288, 1184161792, 1512840192, 2127229056, 1124933632, 1305343232, 1114682752, 1379316992, 1278595456, 1258454016, 1288943104, 1623838464, 1460251648, 1589154432, 1391952384, 1324350336, 1140243712, 1613038208, 1778023168, 1106940288, 1164558848, 1153497984, 1669428096, 1083358848, 1744716032, 1590056192, 2092927616, 2040337792, 1523031424, 1447349888, 1668638848, 1580021888, 2140724736, 1695173632, 1957939968, 1814562432, 1213806976, 1104428800, 1333245056, 1987529088, 1916931968, 1957280640, 1542160768, 1449319424, 1123723136, 1211826048, 2048265856, 1348683520, 1648459136, 1860840576, 1256593408, 1363996160, 1858690688, 1479057664, 1415456256, 1086131840, 1761647488, 2135694080, 1457808384, 1388708224, 1358663936, 2061971968, 1230531072, 1860448896, 2045531776, 1125279744, 1823073024, 1123335936, 1451174656, 1280969344, 1333704320, 1290635264, 1456371200, 1655114368, 1519959168, 1920426624, 1180309376, 1498988800, 1708972032, 1189277312, 1781042304, 1224115328, 1161079552, 1356825088, 1419304576, 1244645504, 1498915584, 1377097344, 1278025472, 2117832448, 1119917696, 1377296512, 1279214976, 2119256576, 1916931584, 1661963264, 1139316608, 1968152832, 2036532864, 1474690944, 1863115648, 2038884608, 1588095616, 1618950912, 1178031232, 2002818944, 1485164544, 1189642880, 2042309120, 1936651392, 1724296320, 1450815872, 1089681024, 1100799744, 1113863808, 1411520384, 1303646720, 1119488768, 1128735232, 1970038272, 1136927104, 1976956928, 1982911488, 1642360832, 2060712320, 1082013184], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [8, 8, 8, 9, 9, 9, 9, 9, 9, 8, 9, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 8, 8, 8, 8, 8, 9, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 8, 9, 9, 8, 8, 9, 9, 9, 8, 8, 8, 9, 9, 9, 9, 8, 8, 9, 8, 7, 8, 9, 9, 9, 7, 9, 9, 9, 8, 9, 8, 9, 9, 9, 9, 8, 8, 8, 7, 8, 8, 9, 8, 9, 9, 9, 8, 8, 9, 9, 9, 9, 9, 8, 9, 8, 9, 9, 9, 8, 9, 9, 9, 9, 9, 8, 8, 9, 8, 9, 8, 8, 8, 9, 8, 9, 8, 9, 8, 8, 8, 8, 9, 9, 8, 8, 9, 9, 9, 9, 8, 8, 9, 8, 9, 9, 8, 8, 8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 8, 9, 9, 8, 8, 8, 9, 8, 8, 9, 9, 8, 9, 8, 9, 9, 9, 9, 9, 9, 9, 8, 9, 9, 9, 8, 8, 8, 9, 8, 9, 8, 9, 9, 9, 9, 9, 8, 8, 8, 9, 9, 9, 9, 8, 9, 8, 9, 9, 8, 9, 8, 9, 9, 9, 9, 9, 9, 9, 10, 8, 9, 9, 9, 9, 8, 9, 9, 8, 8, 9, 9, 9, 10, 8, 9, 9, 10, 9, 9, 9, 9, 9, 9, 9, 9, 9, 8, 9, 9, 9, 7, 9, 9, 9, 9, 8, 8, 9, 8, 8, 8, 8, 9, 6, 8, 9, 9, 9, 8], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x14x20x!quant.uniform<i8:f32, 0.054117548818897639>>, tensor<256x256x1x1xsi8>, tensor<1x256x1x1xi32>) -> tensor<1x256x14x20x!quant.uniform<i8:f32, 0.093799103149606308>> loc(#loc73)
    %74 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc74)
    %75 = "tpu.Lut"(%73, %74) : (tensor<1x256x14x20x!quant.uniform<i8:f32, 0.093799103149606308>>, tensor<1x1x1x256xsi8>) -> tensor<1x256x14x20x!quant.uniform<i8:f32, 0.088632026771653549>> loc(#loc75)
    %76 = "tpu.Slice"(%75, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x14x20x!quant.uniform<i8:f32, 0.088632026771653549>>, none, none, none, none) -> tensor<1x128x14x20x!quant.uniform<i8:f32, 0.088632026771653549>> loc(#loc76)
    %77 = "tpu.Slice"(%75, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 256, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 128, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x14x20x!quant.uniform<i8:f32, 0.088632026771653549>>, none, none, none, none) -> tensor<1x128x14x20x!quant.uniform<i8:f32, 0.088632026771653549>> loc(#loc77)
    %78 = "top.Weight"() : () -> tensor<64x128x1x1xsi8> loc(#loc78)
    %79 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc79)
    %80 = "tpu.Conv2D"(%77, %78, %79) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1459434112, 1807101696, 1596255104, 1289938432, 1298320384, 1137325696, 1219592448, 1598117760, 1431058176, 1320755456, 1376271872, 1820793472, 1301995520, 1252686080, 1864412288, 1204702848, 1759977088, 1640333184, 1649598208, 2098362112, 1321053696, 1533270400, 1238816128, 1102366592, 1828148352, 1142329856, 1955828480, 1875145856, 1350071680, 1612291584, 1369232512, 1254002944, 1564789760, 1884302208, 1321088384, 1268191744, 2131074176, 1883107840, 1458278528, 1698615552, 1227660928, 1732262016, 2020079488, 1468762624, 1347581952, 1862125952, 1983969280, 1815177472, 1931091840, 2119576832, 1972579968, 2047746432, 1665085440, 2043080704, 1298258048, 2128374400, 1521037568, 2010465792, 1358556032, 1578576384, 1104449408, 1412335104, 1431582592, 1994429824], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [8, 8, 8, 8, 8, 8, 7, 8, 7, 8, 8, 8, 8, 8, 8, 7, 8, 9, 9, 8, 8, 8, 8, 6, 8, 7, 8, 8, 6, 8, 8, 7, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 7, 8, 9, 8, 8, 8, 8, 8, 8, 8, 8, 9, 8, 8, 8, 8, 7, 8, 8, 9], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x14x20x!quant.uniform<i8:f32, 0.088632026771653549>>, tensor<64x128x1x1xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x14x20x!quant.uniform<i8:f32, 0.054024407086614171>> loc(#loc80)
    %81 = "top.Weight"() : () -> tensor<64x128x1x1xsi8> loc(#loc81)
    %82 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc82)
    %83 = "tpu.Conv2D"(%77, %81, %82) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, multiplier = [1772140416, 2094690432, 1725369984, 1193811456, 1333629056, 1458611712, 1092708608, 1257541120, 1716910208, 1932891136, 1356369920, 1932993152, 1193694080, 1248738816, 1161729536, 1243357952, 1924008960, 1164760192, 1983827712, 1885557504, 1330209024, 1446149632, 1954010624, 2121230848, 1233119360, 1488796544, 1103245824, 1077813376, 1372251136, 1620424192, 1956444800, 1871623296, 1195806720, 2012204544, 1635399168, 2024737792, 1332088704, 1551083392, 2099473280, 1484230400, 1267510912, 1270174464, 1340936576, 1278129024, 1449179520, 1479647872, 1186307712, 1356727936, 1669850240, 1836047616, 1675723008, 1449883008, 1826196608, 1611811456, 1193887616, 1107629568, 1261782656, 1644310912, 1565086336, 2115503232, 1754434432, 1103025280, 1949476224, 1233878144], pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [8, 8, 8, 8, 7, 8, 8, 8, 8, 8, 8, 9, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 9, 8, 8, 8, 7, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 9, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 8, 9, 8, 8, 7, 8, 8, 8, 8, 8, 7, 8, 8], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x14x20x!quant.uniform<i8:f32, 0.088632026771653549>>, tensor<64x128x1x1xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x14x20x!quant.uniform<i8:f32, 0.11307370157480315>> loc(#loc83)
    %84 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc84)
    %85 = "tpu.Lut"(%80, %84) : (tensor<1x64x14x20x!quant.uniform<i8:f32, 0.054024407086614171>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x14x20x!quant.uniform<i8:f32, 0.045667181102362203>> loc(#loc85)
    %86 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc86)
    %87 = "tpu.Lut"(%83, %86) : (tensor<1x64x14x20x!quant.uniform<i8:f32, 0.11307370157480315>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x14x20x!quant.uniform<i8:f32, 0.10927710787401575>> loc(#loc87)
    %88 = "top.Weight"() : () -> tensor<64x64x3x3xsi8> loc(#loc88)
    %89 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc89)
    %90 = "tpu.Conv2D"(%85, %88, %89) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1744264448, 1270278144, 1257335680, 1461555200, 1247452672, 1169419136, 1126859264, 1785146368, 1124736512, 1204158848, 1112266496, 1818732288, 1391009536, 1716280960, 1503759616, 1638732160, 1480832384, 1740206464, 1085039104, 1131355136, 1810332416, 1095633280, 1107626240, 1396319488, 1577520640, 1520354816, 1487502720, 1956408576, 1894234112, 1111595520, 1404531968, 1492254592, 1170329856, 2113982592, 1755108608, 1462328064, 1410561152, 1294800256, 1133750144, 2093404032, 1666183424, 1184771712, 1335330944, 1710361600, 1186339840, 1167145728, 2032035584, 1714179712, 1973241472, 1363435520, 1114859136, 1110624896, 1511358464, 1358899968, 2062050304, 1674358784, 1336242944, 1114908160, 1553479808, 1185696000, 1306018432, 1423205632, 1419102080, 1649687552], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [10, 9, 9, 10, 10, 9, 9, 10, 9, 10, 10, 10, 10, 10, 10, 10, 9, 9, 9, 9, 10, 9, 9, 11, 10, 10, 9, 10, 10, 9, 10, 9, 9, 11, 10, 9, 9, 10, 10, 11, 10, 9, 10, 10, 9, 9, 10, 9, 10, 9, 9, 9, 9, 9, 10, 9, 10, 8, 9, 10, 9, 9, 9, 10], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x14x20x!quant.uniform<i8:f32, 0.045667181102362203>>, tensor<64x64x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x14x20x!quant.uniform<i8:f32, 0.087325163779527551>> loc(#loc90)
    %91 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc91)
    %92 = "tpu.Lut"(%90, %91) : (tensor<1x64x14x20x!quant.uniform<i8:f32, 0.087325163779527551>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x14x20x!quant.uniform<i8:f32, 0.053206806299212601>> loc(#loc92)
    %93 = "top.Weight"() : () -> tensor<64x64x3x3xsi8> loc(#loc93)
    %94 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc94)
    %95 = "tpu.Conv2D"(%92, %93, %94) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, multiplier = [1785133568, 1949205248, 1946028800, 1743018752, 1856551168, 1588716672, 1735436800, 1587900032, 1625485440, 1465594240, 1686235008, 1809559680, 1384060416, 1947387776, 1562559360, 1246581504, 1510581248, 1307098368, 1306279680, 1595155072, 1090860672, 1476942080, 2107032320, 1631377152, 1686076160, 1878451200, 2090674688, 1731822336, 1103881216, 1219740928, 1414624256, 1235139456, 1673960704, 1227092096, 1252570624, 2089497344, 1971645696, 1299728128, 2001211264, 1362284928, 1744532096, 1365897856, 2050153216, 1107102592, 1131947264, 1697412736, 1266696704, 1432817536, 1975622912, 2031074432, 1102498944, 1260755840, 2137745664, 1970022400, 1335411840, 1446102784, 1975792768, 1090475648, 1665614848, 1266646144, 1346804608, 2014725504, 1257817856, 1873986688], pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, rshift = [10, 10, 11, 10, 10, 10, 10, 9, 10, 10, 10, 10, 9, 10, 9, 9, 10, 10, 9, 9, 9, 9, 10, 10, 9, 10, 10, 10, 9, 9, 9, 9, 10, 9, 10, 10, 10, 9, 9, 9, 10, 9, 10, 9, 9, 9, 10, 10, 10, 9, 9, 9, 10, 10, 10, 9, 10, 9, 10, 9, 10, 10, 9, 10], strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x14x20x!quant.uniform<i8:f32, 0.053206806299212601>>, tensor<64x64x3x3xsi8>, tensor<1x64x1x1xi32>) -> tensor<1x64x14x20x!quant.uniform<i8:f32, 0.079110603937007862>> loc(#loc95)
    %96 = "top.Weight"() : () -> tensor<1x1x1x256xsi8> loc(#loc96)
    %97 = "tpu.Lut"(%95, %96) : (tensor<1x64x14x20x!quant.uniform<i8:f32, 0.079110603937007862>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x14x20x!quant.uniform<i8:f32, 0.054553804724409447>> loc(#loc97)
    %98 = "tpu.Add"(%85, %97) {do_relu = false, multipliers = [66, 79], relu_limit = -1.000000e+00 : f64, rshifts = [7]} : (tensor<1x64x14x20x!quant.uniform<i8:f32, 0.045667181102362203>>, tensor<1x64x14x20x!quant.uniform<i8:f32, 0.054553804724409447>>) -> tensor<1x64x14x20x!quant.uniform<i8:f32, 0.087464529921259845>> loc(#loc98)
    %99 = "top.Weight"() : () -> tensor<64x64x3x3xsi8> loc(#loc99)
    %100 = "top.Weight"() : () -> tensor<1x64x1x1xi32> loc(#loc100)
