#loc = loc(unknown)
#loc1 = loc("images")
module @yolo11s attributes {module.FLOPs = 3787969080 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "cv181x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.inputs = ["images"], module.mode = "INT8", module.outputs = ["/model.23/dfl/conv/Conv_output_0_Conv_f32", "/model.23/Sigmoid_output_0_Sigmoid_f32"], module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "yolo11s_tpu_addressed_cv181x_int8_sym_weight.npz"} {
  module @yolo11s attributes {module.coeff_addr = 1099511627776 : i64, module.coeff_size = 9565440 : i64, module.device_id = 0 : i64, module.neuron_size = 1003520 : i64, module.private_size = 0 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x3x224x320xf32> loc(unknown)) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) {
      %0 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [224, 320], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627]} : (tensor<1x3x224x320xf32>) -> tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>, 3298534883328 : i64> loc(#loc1)
      %1:2 = call @subfunc_0(%0) : (tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>, 3298534883328 : i64>) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) loc(#loc)
      return %1#0, %1#1 : tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>, 3298534883328 : i64> loc("images")) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099513340768 : i64> loc(#loc2)
      %2 = "top.Weight"() : () -> tensor<1x32x9x4xsi8, 1099514023600 : i64> loc(#loc3)
      %3 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099514495792 : i64> loc(#loc4)
      %4 = "top.Weight"() : () -> tensor<1x64x1x9xi8, 1099514339696 : i64> loc(#loc5)
      %5 = "top.Weight"() : () -> tensor<1x64x9x32xsi8, 1099515664368 : i64> loc(#loc6)
      %6 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099516211568 : i64> loc(#loc7)
      %7 = "top.Weight"() : () -> tensor<1x64x1x9xi8, 1099515088688 : i64> loc(#loc8)
      %8 = "top.Weight"() : () -> tensor<1x64x1x64xsi8, 1099515743024 : i64> loc(#loc9)
      %9 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099513228304 : i64> loc(#loc10)
      %10 = "tpu.Group"(%arg0) ({
        %395 = "tpu.Load"(%arg0) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 11200, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0, 29, 61, 93, 125, 157, 189], h_slice = [32, 35, 35, 35, 35, 35, 35], w_idx = [0], w_slice = [320], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 4 : i64} : (tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>, 3298534883328 : i64>) -> tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>> loc(#loc12)
        %396 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 11712, out_size = 144, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [4], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x9x4xsi8, 1099514023600 : i64>) -> tensor<1x32x9x4xsi8> loc(#loc13)
        %397 = "tpu.Load"(%1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 11856, out_size = 36, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x9xi8, 1099513340768 : i64>) -> tensor<1x32x1x9xi8> loc(#loc14)
        %398 = "tpu.Load"(%3) {do_bcast = true, ginfo = #tpu.lg<out_addr = 32000, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099514495792 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc15)
        %399 = "tpu.Conv2D"(%395, %396, %397) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 10880, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 15, 31, 47, 63, 79, 95], h_slice = [16, 17, 17, 17, 17, 17, 17], w_idx = [0], w_slice = [160], id = 4, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 4 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>>, tensor<1x32x9x4xsi8>, tensor<1x32x1x9xi8>) -> tensor<1x32x112x160x!quant.uniform<i8:f32, 0.49818741417322837>> loc(#loc16)
        %400 = "tpu.Load"(%5) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 2304, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [32], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x9x32xsi8, 1099515664368 : i64>) -> tensor<1x64x9x32xsi8> loc(#loc17)
        %401 = "tpu.Load"(%4) {do_bcast = false, ginfo = #tpu.lg<out_addr = 11904, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x9xi8, 1099514339696 : i64>) -> tensor<1x64x1x9xi8> loc(#loc18)
        %402 = "tpu.Lut"(%399, %398) {ginfo = #tpu.lg<out_addr = 0, out_size = 10880, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 15, 31, 47, 63, 79, 95], h_slice = [16, 17, 17, 17, 17, 17, 17], w_idx = [0], w_slice = [160], id = 7, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x112x160x!quant.uniform<i8:f32, 0.49818741417322837>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x112x160x!quant.uniform<i8:f32, 0.46105073937007873>> loc(#loc19)
        %403 = "tpu.Load"(%6) {do_bcast = true, ginfo = #tpu.lg<out_addr = 23168, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 8, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099516211568 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc20)
        %404 = "tpu.Conv2D"(%402, %400, %401) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 9, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x112x160x!quant.uniform<i8:f32, 0.46105073937007873>>, tensor<1x64x9x32xsi8>, tensor<1x64x1x9xi8>) -> tensor<1x64x56x80x!quant.uniform<i8:f32, 0.6094166228346457>> loc(#loc21)
        %405 = "tpu.Load"(%8) {do_bcast = false, ginfo = #tpu.lg<out_addr = 11200, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 10, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x64xsi8, 1099515743024 : i64>) -> tensor<1x64x1x64xsi8> loc(#loc22)
        %406 = "tpu.Load"(%7) {do_bcast = false, ginfo = #tpu.lg<out_addr = 32256, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 11, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x9xi8, 1099515088688 : i64>) -> tensor<1x64x1x9xi8> loc(#loc23)
        %407 = "tpu.Lut"(%404, %403) {ginfo = #tpu.lg<out_addr = 0, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 12, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.6094166228346457>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x56x80x!quant.uniform<i8:f32, 0.47554662362204719>> loc(#loc24)
        %408 = "tpu.Load"(%9) {do_bcast = true, ginfo = #tpu.lg<out_addr = 23424, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 13, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099513228304 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc25)
        %409 = "tpu.Conv2D"(%407, %405, %406) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 14, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.47554662362204719>>, tensor<1x64x1x64xsi8>, tensor<1x64x1x9xi8>) -> tensor<1x64x56x80x!quant.uniform<i8:f32, 0.2627664401574803>> loc(#loc26)
        %410 = "tpu.Lut"(%409, %408) {ginfo = #tpu.lg<out_addr = 26880, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 15, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.2627664401574803>>, tensor<1x1x1x256xsi8>) -> tensor<1x64x56x80x!quant.uniform<i8:f32, 0.14772613385826772>> loc(#loc11)
        %411 = "tpu.Store"(%410, %0) {ginfo = #tpu.lg<out_addr = 26880, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 16, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, none) -> tensor<1x64x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 0 : i64> loc(#loc11)
        "tpu.Yield"(%411) : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 0 : i64>) -> () loc(#loc11)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 16, -2, 7, 5, 6, -3, 9, 8, -4, 12, 10, 11, -5, 14, 13, -6, 15, 0, 1, 2], group_type = 0 : i64, hsecs = 7 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x3x224x320x!quant.uniform<i8:f32, 0.0078740157480314959>, 3298534883328 : i64>) -> tensor<1x64x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 0 : i64> loc(#loc11)
      %11 = "tpu.Slice"(%10, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 32, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 0 : i64>, none, none, none, none) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 0 : i64> loc(#loc27)
      %12 = "tpu.Slice"(%10, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 0 : i64>, none, none, none, none) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 143360 : i64> loc(#loc28)
      %13 = "top.Weight"() : () -> tensor<1x16x1x9xi8, 1099514017504 : i64> loc(#loc29)
      %14 = "top.Weight"() : () -> tensor<1x16x9x32xsi8, 1099512504592 : i64> loc(#loc30)
      %15 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099515123184 : i64> loc(#loc31)
      %16 = "tpu.Group"(%12) ({
        %395 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 9280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 27], h_slice = [29, 29], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 143360 : i64>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>> loc(#loc33)
        %396 = "tpu.Load"(%14) {do_bcast = false, ginfo = #tpu.lg<out_addr = 28672, out_size = 576, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [32], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x9x32xsi8, 1099512504592 : i64>) -> tensor<1x16x9x32xsi8> loc(#loc34)
        %397 = "tpu.Load"(%13) {do_bcast = false, ginfo = #tpu.lg<out_addr = 9536, out_size = 18, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x1x9xi8, 1099514017504 : i64>) -> tensor<1x16x1x9xi8> loc(#loc35)
        %398 = "tpu.Load"(%15) {do_bcast = true, ginfo = #tpu.lg<out_addr = 9280, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099515123184 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc36)
        %399 = "tpu.Conv2D"(%395, %396, %397) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 28], h_slice = [28, 28], w_idx = [0], w_slice = [80], id = 4, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, tensor<1x16x9x32xsi8>, tensor<1x16x1x9xi8>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.074481342519685037>> loc(#loc37)
        %400 = "tpu.Lut"(%399, %398) {ginfo = #tpu.lg<out_addr = 20480, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 28], h_slice = [28, 28], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.074481342519685037>>, tensor<1x1x1x256xsi8>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>> loc(#loc32)
        %401 = "tpu.Store"(%400, %0) {ginfo = #tpu.lg<out_addr = 20480, out_size = 4480, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 28], h_slice = [28, 28], w_idx = [0], w_slice = [80], id = 6, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>>, none) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>, 286720 : i64> loc(#loc32)
        "tpu.Yield"(%401) : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>, 286720 : i64>) -> () loc(#loc32)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 6, -2, 5, 0, 1, 2], group_type = 0 : i64, hsecs = 2 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 143360 : i64>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>, 286720 : i64> loc(#loc32)
      %17 = "top.Weight"() : () -> tensor<1x32x1x9xi8, 1099514014336 : i64> loc(#loc38)
      %18 = "top.Weight"() : () -> tensor<1x32x9x16xsi8, 1099513852160 : i64> loc(#loc39)
      %19 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099514020208 : i64> loc(#loc40)
      %20 = "tpu.Group"(%16) ({
        %395 = "tpu.Load"(%16) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 4640, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 27], h_slice = [29, 29], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>, 286720 : i64>) -> tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>> loc(#loc42)
        %396 = "tpu.Load"(%18) {do_bcast = false, ginfo = #tpu.lg<out_addr = 8960, out_size = 576, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [16], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x9x16xsi8, 1099513852160 : i64>) -> tensor<1x32x9x16xsi8> loc(#loc43)
        %397 = "tpu.Load"(%17) {do_bcast = false, ginfo = #tpu.lg<out_addr = 9792, out_size = 36, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x1x9xi8, 1099514014336 : i64>) -> tensor<1x32x1x9xi8> loc(#loc44)
        %398 = "tpu.Load"(%19) {do_bcast = true, ginfo = #tpu.lg<out_addr = 9536, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099514020208 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc45)
        %399 = "tpu.Conv2D"(%395, %396, %397) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 0, out_size = 8960, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 28], h_slice = [28, 28], w_idx = [0], w_slice = [80], id = 4, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>>, tensor<1x32x9x16xsi8>, tensor<1x32x1x9xi8>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.11104472913385827>> loc(#loc46)
        %400 = "tpu.Lut"(%399, %398) {ginfo = #tpu.lg<out_addr = 12288, out_size = 8960, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 28], h_slice = [28, 28], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.11104472913385827>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>> loc(#loc41)
        %401 = "tpu.Store"(%400, %0) {ginfo = #tpu.lg<out_addr = 12288, out_size = 8960, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 28], h_slice = [28, 28], w_idx = [0], w_slice = [80], id = 6, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>>, none) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>, 860160 : i64> loc(#loc41)
        "tpu.Yield"(%401) : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>, 860160 : i64>) -> () loc(#loc41)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 6, -2, 5, 0, 1, 2], group_type = 0 : i64, hsecs = 2 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x16x56x80x!quant.uniform<i8:f32, 0.069902049606299213>, 286720 : i64>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>, 860160 : i64> loc(#loc41)
      %21 = "top.Weight"() : () -> tensor<1x128x1x9xi8, 1099514034672 : i64> loc(#loc47)
      %22 = "top.Weight"() : () -> tensor<1x128x1x96xsi8, 1099513231152 : i64> loc(#loc48)
      %23 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099514017648 : i64> loc(#loc49)
      %24 = "tpu.Group"(%12, %20, %11) ({
        %395 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 143360 : i64>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>> loc(#loc33)
        %396 = "tpu.Load"(%20) {do_bcast = false, ginfo = #tpu.lg<out_addr = 28672, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>, 860160 : i64>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>> loc(#loc51)
        %397 = "tpu.Load"(%11) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 0 : i64>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>> loc(#loc52)
        %398 = "tpu.Add"(%395, %396) {do_relu = false, ginfo = #tpu.lg<out_addr = 4096, out_size = 2560, buffer_addr = 8192, buffer_size = 2560, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 3, stage = 1, slice_idx = 0, group_type = 0>, multipliers = [70, 46], relu_limit = -1.000000e+00 : f64, rshifts = [6]} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>>) -> tensor<1x32x56x80x!quant.uniform<i8:f32, 0.13364397952755905>> loc(#loc53)
        %399 = "tpu.Load"(%22) {do_bcast = false, ginfo = #tpu.lg<out_addr = 22528, out_size = 1536, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [96], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x96xsi8, 1099513231152 : i64>) -> tensor<1x128x1x96xsi8> loc(#loc54)
        %400 = "tpu.Load"(%21) {do_bcast = false, ginfo = #tpu.lg<out_addr = 31232, out_size = 144, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x9xi8, 1099514034672 : i64>) -> tensor<1x128x1x9xi8> loc(#loc55)
        %401 = "tpu.Concat"(%397, %395, %398) {axis = 1 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 7680, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [96], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 6, stage = 1, slice_idx = 0, group_type = 0>, multipliers = [1, 1, 115], only_merge = false, relu_limit = -1.000000e+00 : f64, rshifts = [0, 0, 7]} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, tensor<1x32x56x80x!quant.uniform<i8:f32, 0.13364397952755905>>) -> tensor<1x96x56x80x!quant.uniform<i8:f32, 0.14772613385826772>> loc(#loc56)
        %402 = "tpu.Load"(%23) {do_bcast = true, ginfo = #tpu.lg<out_addr = 10752, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 7, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099514017648 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc57)
        %403 = "tpu.Conv2D"(%401, %399, %400) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 0, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 8, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x96x56x80x!quant.uniform<i8:f32, 0.14772613385826772>>, tensor<1x128x1x96xsi8>, tensor<1x128x1x9xi8>) -> tensor<1x128x56x80x!quant.uniform<i8:f32, 0.13573605984251969>> loc(#loc58)
        %404 = "tpu.Lut"(%403, %402) {ginfo = #tpu.lg<out_addr = 12288, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 9, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x128x56x80x!quant.uniform<i8:f32, 0.13573605984251969>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>> loc(#loc50)
        %405 = "tpu.Store"(%404, %0) {ginfo = #tpu.lg<out_addr = 12288, out_size = 10240, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 10, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>>, none) -> tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>, 286720 : i64> loc(#loc50)
        "tpu.Yield"(%405) : (tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>, 286720 : i64>) -> () loc(#loc50)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 2, 10, -2, 6, 4, 5, -3, 8, 7, -4, 9, 0, 1], group_type = 0 : i64, hsecs = 7 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-2, 2], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 143360 : i64>, tensor<1x32x56x80x!quant.uniform<i8:f32, 0.097719342519685046>, 860160 : i64>, tensor<1x32x56x80x!quant.uniform<i8:f32, 0.14772613385826772>, 0 : i64>) -> tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>, 286720 : i64> loc(#loc50)
      %25 = "top.Weight"() : () -> tensor<1x128x1x9xi8, 1099518104352 : i64> loc(#loc59)
      %26 = "top.Weight"() : () -> tensor<1x128x9x128xsi8, 1099515747376 : i64> loc(#loc60)
      %27 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099517466352 : i64> loc(#loc61)
      %28 = "top.Weight"() : () -> tensor<1x128x1x9xi8, 1099513881600 : i64> loc(#loc62)
      %29 = "top.Weight"() : () -> tensor<1x128x1x128xsi8, 1099512488208 : i64> loc(#loc63)
      %30 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099513340512 : i64> loc(#loc64)
      %31 = "tpu.Group"(%24) ({
        %395 = "tpu.Load"(%26) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 18432, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [128], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x9x128xsi8, 1099515747376 : i64>) -> tensor<1x128x9x128xsi8> loc(#loc66)
        %396 = "tpu.Load"(%24) {do_bcast = false, ginfo = #tpu.lg<out_addr = 20480, out_size = 6400, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 3, 7, 11, 15, 19, 23, 27, 31, 35, 39, 43, 47, 51], h_slice = [4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5], w_idx = [0], w_slice = [80], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>, 286720 : i64>) -> tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>> loc(#loc67)
        %397 = "tpu.Load"(%25) {do_bcast = false, ginfo = #tpu.lg<out_addr = 30208, out_size = 144, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x9xi8, 1099518104352 : i64>) -> tensor<1x128x1x9xi8> loc(#loc68)
        %398 = "tpu.Load"(%27) {do_bcast = true, ginfo = #tpu.lg<out_addr = 19968, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099517466352 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc69)
        %399 = "tpu.Conv2D"(%396, %395, %397) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 18688, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [40], id = 4, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>>, tensor<1x128x9x128xsi8>, tensor<1x128x1x9xi8>) -> tensor<1x128x28x40x!quant.uniform<i8:f32, 0.062709842519685047>> loc(#loc70)
        %400 = "tpu.Load"(%29) {do_bcast = false, ginfo = #tpu.lg<out_addr = 26880, out_size = 2048, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [128], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x128xsi8, 1099512488208 : i64>) -> tensor<1x128x1x128xsi8> loc(#loc71)
        %401 = "tpu.Load"(%28) {do_bcast = false, ginfo = #tpu.lg<out_addr = 20224, out_size = 144, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x9xi8, 1099513881600 : i64>) -> tensor<1x128x1x9xi8> loc(#loc72)
        %402 = "tpu.Lut"(%399, %398) {ginfo = #tpu.lg<out_addr = 20480, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [40], id = 7, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.062709842519685047>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054424705511811021>> loc(#loc73)
        %403 = "tpu.Load"(%30) {do_bcast = true, ginfo = #tpu.lg<out_addr = 18432, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 8, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099513340512 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc74)
        %404 = "tpu.Conv2D"(%402, %400, %401) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 18688, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [40], id = 9, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054424705511811021>>, tensor<1x128x1x128xsi8>, tensor<1x128x1x9xi8>) -> tensor<1x128x28x40x!quant.uniform<i8:f32, 0.062148030708661414>> loc(#loc75)
        %405 = "tpu.Lut"(%404, %403) {ginfo = #tpu.lg<out_addr = 28928, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [40], id = 10, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.062148030708661414>>, tensor<1x1x1x256xsi8>) -> tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054269591338582682>> loc(#loc65)
        %406 = "tpu.Store"(%405, %0) {ginfo = #tpu.lg<out_addr = 28928, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [40], id = 11, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054269591338582682>>, none) -> tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054269591338582682>, 0 : i64> loc(#loc65)
        "tpu.Yield"(%406) : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054269591338582682>, 0 : i64>) -> () loc(#loc65)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 4, 3, 11, -2, 7, 5, 6, -3, 9, 8, 0, -4, 10, 1, 2], group_type = 0 : i64, hsecs = 14 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [2], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x128x56x80x!quant.uniform<i8:f32, 0.090521100787401581>, 286720 : i64>) -> tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054269591338582682>, 0 : i64> loc(#loc65)
      %32 = "tpu.Slice"(%31, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054269591338582682>, 0 : i64>, none, none, none, none) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054269591338582682>, 0 : i64> loc(#loc76)
      %33 = "tpu.Slice"(%31, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 64, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40x!quant.uniform<i8:f32, 0.054269591338582682>, 0 : i64>, none, none, none, none) -> tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054269591338582682>, 71680 : i64> loc(#loc77)
      %34 = "top.Weight"() {do_compress = true} : () -> tensor<1x32x1x9xi8, 1099513228560 : i64> loc(#loc78)
      %35 = "top.Weight"() {do_compress = true} : () -> tensor<1x32x9x64xsi8, 1099512809488 : i64> loc(#loc79)
      %36 = "tpu.Conv2D"(%33, %35, %34) {coeff_merged = false, dilations = [1, 1], do_relu = false, do_winograd = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode QDM>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x28x40x!quant.uniform<i8:f32, 0.054269591338582682>, 71680 : i64>, tensor<1x32x9x64xsi8, 1099512809488 : i64>, tensor<1x32x1x9xi8, 1099513228560 : i64>) -> tensor<1x32x28x40x!quant.uniform<i8:f32, 0.043688266929133864>, 143360 : i64> loc(#loc80)
      %37 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099512829328 : i64> loc(#loc81)
      %38 = "top.Weight"() : () -> tensor<1x64x1x9xi8, 1099514024752 : i64> loc(#loc82)
      %39 = "top.Weight"() : () -> tensor<1x64x9x32xsi8, 1099513321824 : i64> loc(#loc83)
      %40 = "top.Weight"() : () -> tensor<1x1x1x256xsi8, 1099514013824 : i64> loc(#loc84)
      %41 = "tpu.Group"(%36, %33) ({
        %395 = "tpu.Load"(%36) {do_bcast = false, ginfo = #tpu.lg<out_addr = 24576, out_size = 2432, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 13], h_slice = [15, 15], w_idx = [0], w_slice = [40], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x28x40x!quant.uniform<i8:f32, 0.043688266929133864>, 143360 : i64>) -> tensor<1x32x28x40x!quant.uniform<i8:f32, 0.043688266929133864>> loc(#loc86)
        %396 = "tpu.Load"(%37) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6784, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099512829328 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc87)
        %397 = "tpu.Load"(%39) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 2304, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [32], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x9x32xsi8, 1099513321824 : i64>) -> tensor<1x64x9x32xsi8> loc(#loc88)
        %398 = "tpu.Load"(%38) {do_bcast = false, ginfo = #tpu.lg<out_addr = 20864, out_size = 72, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [9], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x9xi8, 1099514024752 : i64>) -> tensor<1x64x1x9xi8> loc(#loc89)
        %399 = "tpu.Lut"(%395, %396) {ginfo = #tpu.lg<out_addr = 4096, out_size = 2432, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 13], h_slice = [15, 15], w_idx = [0], w_slice = [40], id = 4, stage = 1, slice_idx = 0, group_type = 0>} : (tensor<1x32x28x40x!quant.uniform<i8:f32, 0.043688266929133864>>, tensor<1x1x1x256xsi8>) -> tensor<1x32x28x40x!quant.uniform<i8:f32, 0.038853287401574801>> loc(#loc90)
        %400 = "tpu.Load"(%40) {do_bcast = true, ginfo = #tpu.lg<out_addr = 31488, out_size = 256, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [256], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x1x256xsi8, 1099514013824 : i64>) -> tensor<1x1x1x256xsi8> loc(#loc91)
