#loc = loc(unknown)
module @yolo11s attributes {module.FLOPs = 3787969080 : i64, module.chip = "ALL", module.platform = "ONNX", module.state = "TOP_F32", module.top_run_mode = "STATIC", module.weight_file = "yolo11s_top_f32_all_weight.npz"} {
  func.func @main(%arg0: tensor<1x3x224x320xf32> loc(unknown)) -> (tensor<1x1x4x1470xf32>, tensor<1x4x1470xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [224, 320], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627]} : (tensor<1x3x224x320xf32>) -> tensor<1x3x224x320xf32> loc(#loc1)
    %2 = "top.Weight"() : () -> tensor<32x3x3x3xf32> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<32xf32> loc(#loc3)
    %4 = "top.Conv"(%1, %2, %3) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x3x224x320xf32>, tensor<32x3x3x3xf32>, tensor<32xf32>) -> tensor<1x32x112x160xf32> loc(#loc4)
    %5 = "top.SiLU"(%4) : (tensor<1x32x112x160xf32>) -> tensor<1x32x112x160xf32> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<64x32x3x3xf32> loc(#loc6)
    %7 = "top.Weight"() : () -> tensor<64xf32> loc(#loc7)
    %8 = "top.Conv"(%5, %6, %7) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x32x112x160xf32>, tensor<64x32x3x3xf32>, tensor<64xf32>) -> tensor<1x64x56x80xf32> loc(#loc8)
    %9 = "top.SiLU"(%8) : (tensor<1x64x56x80xf32>) -> tensor<1x64x56x80xf32> loc(#loc9)
    %10 = "top.Weight"() : () -> tensor<64x64x1x1xf32> loc(#loc10)
    %11 = "top.Weight"() : () -> tensor<64xf32> loc(#loc11)
    %12 = "top.Conv"(%9, %10, %11) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x56x80xf32>, tensor<64x64x1x1xf32>, tensor<64xf32>) -> tensor<1x64x56x80xf32> loc(#loc12)
    %13 = "top.SiLU"(%12) : (tensor<1x64x56x80xf32>) -> tensor<1x64x56x80xf32> loc(#loc13)
    %14 = "top.Slice"(%13, %0, %0, %0) {axes = [], ends = [9223372036854775807, 32, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x56x80xf32>, none, none, none) -> tensor<1x32x56x80xf32> loc(#loc14)
    %15 = "top.Slice"(%13, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x56x80xf32>, none, none, none) -> tensor<1x32x56x80xf32> loc(#loc15)
    %16 = "top.Weight"() : () -> tensor<16x32x3x3xf32> loc(#loc16)
    %17 = "top.Weight"() : () -> tensor<16xf32> loc(#loc17)
    %18 = "top.Conv"(%15, %16, %17) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x32x56x80xf32>, tensor<16x32x3x3xf32>, tensor<16xf32>) -> tensor<1x16x56x80xf32> loc(#loc18)
    %19 = "top.SiLU"(%18) : (tensor<1x16x56x80xf32>) -> tensor<1x16x56x80xf32> loc(#loc19)
    %20 = "top.Weight"() : () -> tensor<32x16x3x3xf32> loc(#loc20)
    %21 = "top.Weight"() : () -> tensor<32xf32> loc(#loc21)
    %22 = "top.Conv"(%19, %20, %21) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x16x56x80xf32>, tensor<32x16x3x3xf32>, tensor<32xf32>) -> tensor<1x32x56x80xf32> loc(#loc22)
    %23 = "top.SiLU"(%22) : (tensor<1x32x56x80xf32>) -> tensor<1x32x56x80xf32> loc(#loc23)
    %24 = "top.Add"(%15, %23) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x56x80xf32>, tensor<1x32x56x80xf32>) -> tensor<1x32x56x80xf32> loc(#loc24)
    %25 = "top.Concat"(%14, %15, %24) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x32x56x80xf32>, tensor<1x32x56x80xf32>, tensor<1x32x56x80xf32>) -> tensor<1x96x56x80xf32> loc(#loc25)
    %26 = "top.Weight"() : () -> tensor<128x96x1x1xf32> loc(#loc26)
    %27 = "top.Weight"() : () -> tensor<128xf32> loc(#loc27)
    %28 = "top.Conv"(%25, %26, %27) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x96x56x80xf32>, tensor<128x96x1x1xf32>, tensor<128xf32>) -> tensor<1x128x56x80xf32> loc(#loc28)
    %29 = "top.SiLU"(%28) : (tensor<1x128x56x80xf32>) -> tensor<1x128x56x80xf32> loc(#loc29)
    %30 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc30)
    %31 = "top.Weight"() : () -> tensor<128xf32> loc(#loc31)
    %32 = "top.Conv"(%29, %30, %31) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x128x56x80xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x28x40xf32> loc(#loc32)
    %33 = "top.SiLU"(%32) : (tensor<1x128x28x40xf32>) -> tensor<1x128x28x40xf32> loc(#loc33)
    %34 = "top.Weight"() : () -> tensor<128x128x1x1xf32> loc(#loc34)
    %35 = "top.Weight"() : () -> tensor<128xf32> loc(#loc35)
    %36 = "top.Conv"(%33, %34, %35) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x28x40xf32>, tensor<128x128x1x1xf32>, tensor<128xf32>) -> tensor<1x128x28x40xf32> loc(#loc36)
    %37 = "top.SiLU"(%36) : (tensor<1x128x28x40xf32>) -> tensor<1x128x28x40xf32> loc(#loc37)
    %38 = "top.Slice"(%37, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40xf32>, none, none, none) -> tensor<1x64x28x40xf32> loc(#loc38)
    %39 = "top.Slice"(%37, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 64, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40xf32>, none, none, none) -> tensor<1x64x28x40xf32> loc(#loc39)
    %40 = "top.Weight"() : () -> tensor<32x64x3x3xf32> loc(#loc40)
    %41 = "top.Weight"() : () -> tensor<32xf32> loc(#loc41)
    %42 = "top.Conv"(%39, %40, %41) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x28x40xf32>, tensor<32x64x3x3xf32>, tensor<32xf32>) -> tensor<1x32x28x40xf32> loc(#loc42)
    %43 = "top.SiLU"(%42) : (tensor<1x32x28x40xf32>) -> tensor<1x32x28x40xf32> loc(#loc43)
    %44 = "top.Weight"() : () -> tensor<64x32x3x3xf32> loc(#loc44)
    %45 = "top.Weight"() : () -> tensor<64xf32> loc(#loc45)
    %46 = "top.Conv"(%43, %44, %45) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x32x28x40xf32>, tensor<64x32x3x3xf32>, tensor<64xf32>) -> tensor<1x64x28x40xf32> loc(#loc46)
    %47 = "top.SiLU"(%46) : (tensor<1x64x28x40xf32>) -> tensor<1x64x28x40xf32> loc(#loc47)
    %48 = "top.Add"(%39, %47) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x28x40xf32>, tensor<1x64x28x40xf32>) -> tensor<1x64x28x40xf32> loc(#loc48)
    %49 = "top.Concat"(%38, %39, %48) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x64x28x40xf32>, tensor<1x64x28x40xf32>, tensor<1x64x28x40xf32>) -> tensor<1x192x28x40xf32> loc(#loc49)
    %50 = "top.Weight"() : () -> tensor<256x192x1x1xf32> loc(#loc50)
    %51 = "top.Weight"() : () -> tensor<256xf32> loc(#loc51)
    %52 = "top.Conv"(%49, %50, %51) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x192x28x40xf32>, tensor<256x192x1x1xf32>, tensor<256xf32>) -> tensor<1x256x28x40xf32> loc(#loc52)
    %53 = "top.SiLU"(%52) : (tensor<1x256x28x40xf32>) -> tensor<1x256x28x40xf32> loc(#loc53)
    %54 = "top.Weight"() : () -> tensor<256x256x3x3xf32> loc(#loc54)
    %55 = "top.Weight"() : () -> tensor<256xf32> loc(#loc55)
    %56 = "top.Conv"(%53, %54, %55) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x256x28x40xf32>, tensor<256x256x3x3xf32>, tensor<256xf32>) -> tensor<1x256x14x20xf32> loc(#loc56)
    %57 = "top.SiLU"(%56) : (tensor<1x256x14x20xf32>) -> tensor<1x256x14x20xf32> loc(#loc57)
    %58 = "top.Weight"() : () -> tensor<256x256x1x1xf32> loc(#loc58)
    %59 = "top.Weight"() : () -> tensor<256xf32> loc(#loc59)
    %60 = "top.Conv"(%57, %58, %59) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x14x20xf32>, tensor<256x256x1x1xf32>, tensor<256xf32>) -> tensor<1x256x14x20xf32> loc(#loc60)
    %61 = "top.SiLU"(%60) : (tensor<1x256x14x20xf32>) -> tensor<1x256x14x20xf32> loc(#loc61)
    %62 = "top.Slice"(%61, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x14x20xf32>, none, none, none) -> tensor<1x128x14x20xf32> loc(#loc62)
    %63 = "top.Slice"(%61, %0, %0, %0) {axes = [], ends = [9223372036854775807, 256, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 128, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x14x20xf32>, none, none, none) -> tensor<1x128x14x20xf32> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<64x128x1x1xf32> loc(#loc64)
    %65 = "top.Weight"() : () -> tensor<64xf32> loc(#loc65)
    %66 = "top.Conv"(%63, %64, %65) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x14x20xf32>, tensor<64x128x1x1xf32>, tensor<64xf32>) -> tensor<1x64x14x20xf32> loc(#loc66)
    %67 = "top.Weight"() : () -> tensor<64x128x1x1xf32> loc(#loc67)
    %68 = "top.Weight"() : () -> tensor<64xf32> loc(#loc68)
    %69 = "top.Conv"(%63, %67, %68) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x14x20xf32>, tensor<64x128x1x1xf32>, tensor<64xf32>) -> tensor<1x64x14x20xf32> loc(#loc69)
    %70 = "top.SiLU"(%66) : (tensor<1x64x14x20xf32>) -> tensor<1x64x14x20xf32> loc(#loc70)
    %71 = "top.SiLU"(%69) : (tensor<1x64x14x20xf32>) -> tensor<1x64x14x20xf32> loc(#loc71)
    %72 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc72)
    %73 = "top.Weight"() : () -> tensor<64xf32> loc(#loc73)
    %74 = "top.Conv"(%70, %72, %73) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x14x20xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x14x20xf32> loc(#loc74)
    %75 = "top.SiLU"(%74) : (tensor<1x64x14x20xf32>) -> tensor<1x64x14x20xf32> loc(#loc75)
    %76 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc76)
    %77 = "top.Weight"() : () -> tensor<64xf32> loc(#loc77)
    %78 = "top.Conv"(%75, %76, %77) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x14x20xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x14x20xf32> loc(#loc78)
    %79 = "top.SiLU"(%78) : (tensor<1x64x14x20xf32>) -> tensor<1x64x14x20xf32> loc(#loc79)
    %80 = "top.Add"(%70, %79) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x14x20xf32>, tensor<1x64x14x20xf32>) -> tensor<1x64x14x20xf32> loc(#loc80)
    %81 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc81)
    %82 = "top.Weight"() : () -> tensor<64xf32> loc(#loc82)
    %83 = "top.Conv"(%80, %81, %82) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x14x20xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x14x20xf32> loc(#loc83)
    %84 = "top.SiLU"(%83) : (tensor<1x64x14x20xf32>) -> tensor<1x64x14x20xf32> loc(#loc84)
    %85 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc85)
    %86 = "top.Weight"() : () -> tensor<64xf32> loc(#loc86)
    %87 = "top.Conv"(%84, %85, %86) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x14x20xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x14x20xf32> loc(#loc87)
    %88 = "top.SiLU"(%87) : (tensor<1x64x14x20xf32>) -> tensor<1x64x14x20xf32> loc(#loc88)
    %89 = "top.Add"(%80, %88) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x14x20xf32>, tensor<1x64x14x20xf32>) -> tensor<1x64x14x20xf32> loc(#loc89)
    %90 = "top.Concat"(%89, %71) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x64x14x20xf32>, tensor<1x64x14x20xf32>) -> tensor<1x128x14x20xf32> loc(#loc90)
    %91 = "top.Weight"() : () -> tensor<128x128x1x1xf32> loc(#loc91)
    %92 = "top.Weight"() : () -> tensor<128xf32> loc(#loc92)
    %93 = "top.Conv"(%90, %91, %92) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x14x20xf32>, tensor<128x128x1x1xf32>, tensor<128xf32>) -> tensor<1x128x14x20xf32> loc(#loc93)
    %94 = "top.SiLU"(%93) : (tensor<1x128x14x20xf32>) -> tensor<1x128x14x20xf32> loc(#loc94)
    %95 = "top.Concat"(%62, %63, %94) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x128x14x20xf32>, tensor<1x128x14x20xf32>, tensor<1x128x14x20xf32>) -> tensor<1x384x14x20xf32> loc(#loc95)
    %96 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc96)
    %97 = "top.Weight"() : () -> tensor<256xf32> loc(#loc97)
    %98 = "top.Conv"(%95, %96, %97) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x384x14x20xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<1x256x14x20xf32> loc(#loc98)
    %99 = "top.SiLU"(%98) : (tensor<1x256x14x20xf32>) -> tensor<1x256x14x20xf32> loc(#loc99)
    %100 = "top.Weight"() : () -> tensor<512x256x3x3xf32> loc(#loc100)
    %101 = "top.Weight"() : () -> tensor<512xf32> loc(#loc101)
    %102 = "top.Conv"(%99, %100, %101) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x256x14x20xf32>, tensor<512x256x3x3xf32>, tensor<512xf32>) -> tensor<1x512x7x10xf32> loc(#loc102)
    %103 = "top.SiLU"(%102) : (tensor<1x512x7x10xf32>) -> tensor<1x512x7x10xf32> loc(#loc103)
    %104 = "top.Weight"() : () -> tensor<512x512x1x1xf32> loc(#loc104)
    %105 = "top.Weight"() : () -> tensor<512xf32> loc(#loc105)
    %106 = "top.Conv"(%103, %104, %105) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x7x10xf32>, tensor<512x512x1x1xf32>, tensor<512xf32>) -> tensor<1x512x7x10xf32> loc(#loc106)
    %107 = "top.SiLU"(%106) : (tensor<1x512x7x10xf32>) -> tensor<1x512x7x10xf32> loc(#loc107)
    %108 = "top.Slice"(%107, %0, %0, %0) {axes = [], ends = [9223372036854775807, 256, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x7x10xf32>, none, none, none) -> tensor<1x256x7x10xf32> loc(#loc108)
    %109 = "top.Slice"(%107, %0, %0, %0) {axes = [], ends = [9223372036854775807, 512, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 256, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x7x10xf32>, none, none, none) -> tensor<1x256x7x10xf32> loc(#loc109)
    %110 = "top.Weight"() : () -> tensor<128x256x1x1xf32> loc(#loc110)
    %111 = "top.Weight"() : () -> tensor<128xf32> loc(#loc111)
    %112 = "top.Conv"(%109, %110, %111) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x7x10xf32>, tensor<128x256x1x1xf32>, tensor<128xf32>) -> tensor<1x128x7x10xf32> loc(#loc112)
    %113 = "top.Weight"() : () -> tensor<128x256x1x1xf32> loc(#loc113)
    %114 = "top.Weight"() : () -> tensor<128xf32> loc(#loc114)
    %115 = "top.Conv"(%109, %113, %114) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x7x10xf32>, tensor<128x256x1x1xf32>, tensor<128xf32>) -> tensor<1x128x7x10xf32> loc(#loc115)
    %116 = "top.SiLU"(%112) : (tensor<1x128x7x10xf32>) -> tensor<1x128x7x10xf32> loc(#loc116)
    %117 = "top.SiLU"(%115) : (tensor<1x128x7x10xf32>) -> tensor<1x128x7x10xf32> loc(#loc117)
    %118 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc118)
    %119 = "top.Weight"() : () -> tensor<128xf32> loc(#loc119)
    %120 = "top.Conv"(%116, %118, %119) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x7x10xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x7x10xf32> loc(#loc120)
    %121 = "top.SiLU"(%120) : (tensor<1x128x7x10xf32>) -> tensor<1x128x7x10xf32> loc(#loc121)
    %122 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc122)
    %123 = "top.Weight"() : () -> tensor<128xf32> loc(#loc123)
    %124 = "top.Conv"(%121, %122, %123) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x7x10xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x7x10xf32> loc(#loc124)
    %125 = "top.SiLU"(%124) : (tensor<1x128x7x10xf32>) -> tensor<1x128x7x10xf32> loc(#loc125)
    %126 = "top.Add"(%116, %125) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x7x10xf32>, tensor<1x128x7x10xf32>) -> tensor<1x128x7x10xf32> loc(#loc126)
    %127 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc127)
    %128 = "top.Weight"() : () -> tensor<128xf32> loc(#loc128)
    %129 = "top.Conv"(%126, %127, %128) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x7x10xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x7x10xf32> loc(#loc129)
    %130 = "top.SiLU"(%129) : (tensor<1x128x7x10xf32>) -> tensor<1x128x7x10xf32> loc(#loc130)
    %131 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc131)
    %132 = "top.Weight"() : () -> tensor<128xf32> loc(#loc132)
    %133 = "top.Conv"(%130, %131, %132) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x7x10xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x7x10xf32> loc(#loc133)
    %134 = "top.SiLU"(%133) : (tensor<1x128x7x10xf32>) -> tensor<1x128x7x10xf32> loc(#loc134)
    %135 = "top.Add"(%126, %134) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x7x10xf32>, tensor<1x128x7x10xf32>) -> tensor<1x128x7x10xf32> loc(#loc135)
    %136 = "top.Concat"(%135, %117) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x128x7x10xf32>, tensor<1x128x7x10xf32>) -> tensor<1x256x7x10xf32> loc(#loc136)
    %137 = "top.Weight"() : () -> tensor<256x256x1x1xf32> loc(#loc137)
    %138 = "top.Weight"() : () -> tensor<256xf32> loc(#loc138)
    %139 = "top.Conv"(%136, %137, %138) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x7x10xf32>, tensor<256x256x1x1xf32>, tensor<256xf32>) -> tensor<1x256x7x10xf32> loc(#loc139)
    %140 = "top.SiLU"(%139) : (tensor<1x256x7x10xf32>) -> tensor<1x256x7x10xf32> loc(#loc140)
    %141 = "top.Concat"(%108, %109, %140) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x256x7x10xf32>, tensor<1x256x7x10xf32>, tensor<1x256x7x10xf32>) -> tensor<1x768x7x10xf32> loc(#loc141)
    %142 = "top.Weight"() : () -> tensor<512x768x1x1xf32> loc(#loc142)
    %143 = "top.Weight"() : () -> tensor<512xf32> loc(#loc143)
    %144 = "top.Conv"(%141, %142, %143) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x768x7x10xf32>, tensor<512x768x1x1xf32>, tensor<512xf32>) -> tensor<1x512x7x10xf32> loc(#loc144)
    %145 = "top.SiLU"(%144) : (tensor<1x512x7x10xf32>) -> tensor<1x512x7x10xf32> loc(#loc145)
    %146 = "top.Weight"() : () -> tensor<256x512x1x1xf32> loc(#loc146)
    %147 = "top.Weight"() : () -> tensor<256xf32> loc(#loc147)
    %148 = "top.Conv"(%145, %146, %147) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x7x10xf32>, tensor<256x512x1x1xf32>, tensor<256xf32>) -> tensor<1x256x7x10xf32> loc(#loc148)
    %149 = "top.SiLU"(%148) : (tensor<1x256x7x10xf32>) -> tensor<1x256x7x10xf32> loc(#loc149)
    %150 = "top.MaxPool"(%149) {count_include_pad = false, do_relu = false, first_round_mode = "HalfAwayFromZero", is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero", strides = [1, 1]} : (tensor<1x256x7x10xf32>) -> tensor<1x256x7x10xf32> loc(#loc150)
    %151 = "top.MaxPool"(%150) {count_include_pad = false, do_relu = false, first_round_mode = "HalfAwayFromZero", is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero", strides = [1, 1]} : (tensor<1x256x7x10xf32>) -> tensor<1x256x7x10xf32> loc(#loc151)
    %152 = "top.MaxPool"(%151) {count_include_pad = false, do_relu = false, first_round_mode = "HalfAwayFromZero", is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero", strides = [1, 1]} : (tensor<1x256x7x10xf32>) -> tensor<1x256x7x10xf32> loc(#loc152)
    %153 = "top.Concat"(%149, %150, %151, %152) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x256x7x10xf32>, tensor<1x256x7x10xf32>, tensor<1x256x7x10xf32>, tensor<1x256x7x10xf32>) -> tensor<1x1024x7x10xf32> loc(#loc153)
    %154 = "top.Weight"() : () -> tensor<512x1024x1x1xf32> loc(#loc154)
    %155 = "top.Weight"() : () -> tensor<512xf32> loc(#loc155)
    %156 = "top.Conv"(%153, %154, %155) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x1024x7x10xf32>, tensor<512x1024x1x1xf32>, tensor<512xf32>) -> tensor<1x512x7x10xf32> loc(#loc156)
    %157 = "top.SiLU"(%156) : (tensor<1x512x7x10xf32>) -> tensor<1x512x7x10xf32> loc(#loc157)
    %158 = "top.Weight"() : () -> tensor<512x512x1x1xf32> loc(#loc158)
    %159 = "top.Weight"() : () -> tensor<512xf32> loc(#loc159)
    %160 = "top.Conv"(%157, %158, %159) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x7x10xf32>, tensor<512x512x1x1xf32>, tensor<512xf32>) -> tensor<1x512x7x10xf32> loc(#loc160)
    %161 = "top.SiLU"(%160) : (tensor<1x512x7x10xf32>) -> tensor<1x512x7x10xf32> loc(#loc161)
    %162 = "top.Slice"(%161, %0, %0, %0) {axes = [], ends = [9223372036854775807, 256, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x7x10xf32>, none, none, none) -> tensor<1x256x7x10xf32> loc(#loc162)
    %163 = "top.Slice"(%161, %0, %0, %0) {axes = [], ends = [9223372036854775807, 512, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 256, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x7x10xf32>, none, none, none) -> tensor<1x256x7x10xf32> loc(#loc163)
    %164 = "top.Weight"() : () -> tensor<512x256x1x1xf32> loc(#loc164)
    %165 = "top.Weight"() : () -> tensor<512xf32> loc(#loc165)
    %166 = "top.Conv"(%163, %164, %165) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x7x10xf32>, tensor<512x256x1x1xf32>, tensor<512xf32>) -> tensor<1x512x7x10xf32> loc(#loc166)
    %167 = "top.Reshape"(%166) {flatten_start_dim = -1 : i64, shape = [1, 4, 128, 70]} : (tensor<1x512x7x10xf32>) -> tensor<1x4x128x70xf32> loc(#loc167)
    %168 = "top.Slice"(%167, %0, %0, %0) {axes = [], ends = [9223372036854775807, 9223372036854775807, 32, 9223372036854775807], hasparamConvert_axes = [2], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x4x128x70xf32>, none, none, none) -> tensor<1x4x32x70xf32> loc(#loc168)
    %169 = "top.Slice"(%167, %0, %0, %0) {axes = [], ends = [9223372036854775807, 9223372036854775807, 64, 9223372036854775807], hasparamConvert_axes = [2], offset = [0, 0, 32, 0], steps = [1, 1, 1, 1]} : (tensor<1x4x128x70xf32>, none, none, none) -> tensor<1x4x32x70xf32> loc(#loc169)
    %170 = "top.Slice"(%167, %0, %0, %0) {axes = [], ends = [9223372036854775807, 9223372036854775807, 128, 9223372036854775807], hasparamConvert_axes = [2], offset = [0, 0, 64, 0], steps = [1, 1, 1, 1]} : (tensor<1x4x128x70xf32>, none, none, none) -> tensor<1x4x64x70xf32> loc(#loc170)
    %171 = "top.Permute"(%168) {order = [0, 1, 3, 2]} : (tensor<1x4x32x70xf32>) -> tensor<1x4x70x32xf32> loc(#loc171)
    %172 = "top.Reshape"(%170) {flatten_start_dim = -1 : i64, shape = [1, 256, 7, 10]} : (tensor<1x4x64x70xf32>) -> tensor<1x256x7x10xf32> loc(#loc172)
    %173 = "top.MatMul"(%171, %169, %0) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x4x70x32xf32>, tensor<1x4x32x70xf32>, none) -> tensor<1x4x70x70xf32> loc(#loc173)
    %174 = "top.Weight"() : () -> tensor<256x1x3x3xf32> loc(#loc174)
    %175 = "top.Weight"() : () -> tensor<256xf32> loc(#loc175)
    %176 = "top.Conv"(%172, %174, %175) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 256 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x7x10xf32>, tensor<256x1x3x3xf32>, tensor<256xf32>) -> tensor<1x256x7x10xf32> loc(#loc176)
    %177 = "top.MulConst"(%173) {const_val = 0.1767766922712326 : f64, do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x4x70x70xf32>) -> tensor<1x4x70x70xf32> loc(#loc177)
    %178 = "top.Softmax"(%177) {axis = 3 : si32, beta = 1.000000e+00 : f64, log = false, round_mode = "HalfAwayFromZero"} : (tensor<1x4x70x70xf32>) -> tensor<1x4x70x70xf32> loc(#loc178)
    %179 = "top.Permute"(%178) {order = [0, 1, 3, 2]} : (tensor<1x4x70x70xf32>) -> tensor<1x4x70x70xf32> loc(#loc179)
    %180 = "top.MatMul"(%170, %179, %0) {do_relu = false, hdim_is_batch = false, keep_dims = true, left_transpose = false, output_transpose = false, relu_limit = -1.000000e+00 : f64, right_transpose = false} : (tensor<1x4x64x70xf32>, tensor<1x4x70x70xf32>, none) -> tensor<1x4x64x70xf32> loc(#loc180)
    %181 = "top.Reshape"(%180) {flatten_start_dim = -1 : i64, shape = [1, 256, 7, 10]} : (tensor<1x4x64x70xf32>) -> tensor<1x256x7x10xf32> loc(#loc181)
    %182 = "top.Add"(%181, %176) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x7x10xf32>, tensor<1x256x7x10xf32>) -> tensor<1x256x7x10xf32> loc(#loc182)
    %183 = "top.Weight"() : () -> tensor<256x256x1x1xf32> loc(#loc183)
    %184 = "top.Weight"() : () -> tensor<256xf32> loc(#loc184)
    %185 = "top.Conv"(%182, %183, %184) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x7x10xf32>, tensor<256x256x1x1xf32>, tensor<256xf32>) -> tensor<1x256x7x10xf32> loc(#loc185)
    %186 = "top.Add"(%163, %185) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x7x10xf32>, tensor<1x256x7x10xf32>) -> tensor<1x256x7x10xf32> loc(#loc186)
    %187 = "top.Weight"() : () -> tensor<512x256x1x1xf32> loc(#loc187)
    %188 = "top.Weight"() : () -> tensor<512xf32> loc(#loc188)
    %189 = "top.Conv"(%186, %187, %188) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x256x7x10xf32>, tensor<512x256x1x1xf32>, tensor<512xf32>) -> tensor<1x512x7x10xf32> loc(#loc189)
    %190 = "top.SiLU"(%189) : (tensor<1x512x7x10xf32>) -> tensor<1x512x7x10xf32> loc(#loc190)
    %191 = "top.Weight"() : () -> tensor<256x512x1x1xf32> loc(#loc191)
    %192 = "top.Weight"() : () -> tensor<256xf32> loc(#loc192)
    %193 = "top.Conv"(%190, %191, %192) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x7x10xf32>, tensor<256x512x1x1xf32>, tensor<256xf32>) -> tensor<1x256x7x10xf32> loc(#loc193)
    %194 = "top.Add"(%186, %193) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x7x10xf32>, tensor<1x256x7x10xf32>) -> tensor<1x256x7x10xf32> loc(#loc194)
    %195 = "top.Concat"(%162, %194) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x256x7x10xf32>, tensor<1x256x7x10xf32>) -> tensor<1x512x7x10xf32> loc(#loc195)
    %196 = "top.Weight"() : () -> tensor<512x512x1x1xf32> loc(#loc196)
    %197 = "top.Weight"() : () -> tensor<512xf32> loc(#loc197)
    %198 = "top.Conv"(%195, %196, %197) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x7x10xf32>, tensor<512x512x1x1xf32>, tensor<512xf32>) -> tensor<1x512x7x10xf32> loc(#loc198)
    %199 = "top.SiLU"(%198) : (tensor<1x512x7x10xf32>) -> tensor<1x512x7x10xf32> loc(#loc199)
    %200 = "top.Upsample"(%199) {do_relu = false, relu_limit = -1.000000e+00 : f64, scale_h = 2 : i64, scale_w = 2 : i64} : (tensor<1x512x7x10xf32>) -> tensor<1x512x14x20xf32> loc(#loc200)
    %201 = "top.Concat"(%200, %99) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x512x14x20xf32>, tensor<1x256x14x20xf32>) -> tensor<1x768x14x20xf32> loc(#loc201)
    %202 = "top.Weight"() : () -> tensor<256x768x1x1xf32> loc(#loc202)
    %203 = "top.Weight"() : () -> tensor<256xf32> loc(#loc203)
    %204 = "top.Conv"(%201, %202, %203) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x768x14x20xf32>, tensor<256x768x1x1xf32>, tensor<256xf32>) -> tensor<1x256x14x20xf32> loc(#loc204)
    %205 = "top.SiLU"(%204) : (tensor<1x256x14x20xf32>) -> tensor<1x256x14x20xf32> loc(#loc205)
    %206 = "top.Slice"(%205, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x14x20xf32>, none, none, none) -> tensor<1x128x14x20xf32> loc(#loc206)
    %207 = "top.Slice"(%205, %0, %0, %0) {axes = [], ends = [9223372036854775807, 256, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 128, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x14x20xf32>, none, none, none) -> tensor<1x128x14x20xf32> loc(#loc207)
    %208 = "top.Weight"() : () -> tensor<64x128x3x3xf32> loc(#loc208)
    %209 = "top.Weight"() : () -> tensor<64xf32> loc(#loc209)
    %210 = "top.Conv"(%207, %208, %209) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x14x20xf32>, tensor<64x128x3x3xf32>, tensor<64xf32>) -> tensor<1x64x14x20xf32> loc(#loc210)
    %211 = "top.SiLU"(%210) : (tensor<1x64x14x20xf32>) -> tensor<1x64x14x20xf32> loc(#loc211)
    %212 = "top.Weight"() : () -> tensor<128x64x3x3xf32> loc(#loc212)
    %213 = "top.Weight"() : () -> tensor<128xf32> loc(#loc213)
    %214 = "top.Conv"(%211, %212, %213) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x14x20xf32>, tensor<128x64x3x3xf32>, tensor<128xf32>) -> tensor<1x128x14x20xf32> loc(#loc214)
    %215 = "top.SiLU"(%214) : (tensor<1x128x14x20xf32>) -> tensor<1x128x14x20xf32> loc(#loc215)
    %216 = "top.Add"(%207, %215) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x14x20xf32>, tensor<1x128x14x20xf32>) -> tensor<1x128x14x20xf32> loc(#loc216)
    %217 = "top.Concat"(%206, %207, %216) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x128x14x20xf32>, tensor<1x128x14x20xf32>, tensor<1x128x14x20xf32>) -> tensor<1x384x14x20xf32> loc(#loc217)
    %218 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc218)
    %219 = "top.Weight"() : () -> tensor<256xf32> loc(#loc219)
    %220 = "top.Conv"(%217, %218, %219) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x384x14x20xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<1x256x14x20xf32> loc(#loc220)
    %221 = "top.SiLU"(%220) : (tensor<1x256x14x20xf32>) -> tensor<1x256x14x20xf32> loc(#loc221)
    %222 = "top.Upsample"(%221) {do_relu = false, relu_limit = -1.000000e+00 : f64, scale_h = 2 : i64, scale_w = 2 : i64} : (tensor<1x256x14x20xf32>) -> tensor<1x256x28x40xf32> loc(#loc222)
    %223 = "top.Concat"(%222, %53) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x256x28x40xf32>, tensor<1x256x28x40xf32>) -> tensor<1x512x28x40xf32> loc(#loc223)
    %224 = "top.Weight"() : () -> tensor<128x512x1x1xf32> loc(#loc224)
    %225 = "top.Weight"() : () -> tensor<128xf32> loc(#loc225)
    %226 = "top.Conv"(%223, %224, %225) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x512x28x40xf32>, tensor<128x512x1x1xf32>, tensor<128xf32>) -> tensor<1x128x28x40xf32> loc(#loc226)
    %227 = "top.SiLU"(%226) : (tensor<1x128x28x40xf32>) -> tensor<1x128x28x40xf32> loc(#loc227)
    %228 = "top.Slice"(%227, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40xf32>, none, none, none) -> tensor<1x64x28x40xf32> loc(#loc228)
    %229 = "top.Slice"(%227, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 64, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40xf32>, none, none, none) -> tensor<1x64x28x40xf32> loc(#loc229)
    %230 = "top.Weight"() : () -> tensor<32x64x3x3xf32> loc(#loc230)
    %231 = "top.Weight"() : () -> tensor<32xf32> loc(#loc231)
    %232 = "top.Conv"(%229, %230, %231) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x28x40xf32>, tensor<32x64x3x3xf32>, tensor<32xf32>) -> tensor<1x32x28x40xf32> loc(#loc232)
    %233 = "top.SiLU"(%232) : (tensor<1x32x28x40xf32>) -> tensor<1x32x28x40xf32> loc(#loc233)
    %234 = "top.Weight"() : () -> tensor<64x32x3x3xf32> loc(#loc234)
    %235 = "top.Weight"() : () -> tensor<64xf32> loc(#loc235)
    %236 = "top.Conv"(%233, %234, %235) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x32x28x40xf32>, tensor<64x32x3x3xf32>, tensor<64xf32>) -> tensor<1x64x28x40xf32> loc(#loc236)
    %237 = "top.SiLU"(%236) : (tensor<1x64x28x40xf32>) -> tensor<1x64x28x40xf32> loc(#loc237)
    %238 = "top.Add"(%229, %237) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x28x40xf32>, tensor<1x64x28x40xf32>) -> tensor<1x64x28x40xf32> loc(#loc238)
    %239 = "top.Concat"(%228, %229, %238) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x64x28x40xf32>, tensor<1x64x28x40xf32>, tensor<1x64x28x40xf32>) -> tensor<1x192x28x40xf32> loc(#loc239)
    %240 = "top.Weight"() : () -> tensor<128x192x1x1xf32> loc(#loc240)
    %241 = "top.Weight"() : () -> tensor<128xf32> loc(#loc241)
    %242 = "top.Conv"(%239, %240, %241) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x192x28x40xf32>, tensor<128x192x1x1xf32>, tensor<128xf32>) -> tensor<1x128x28x40xf32> loc(#loc242)
    %243 = "top.SiLU"(%242) : (tensor<1x128x28x40xf32>) -> tensor<1x128x28x40xf32> loc(#loc243)
    %244 = "top.Weight"() : () -> tensor<128x128x3x3xf32> loc(#loc244)
    %245 = "top.Weight"() : () -> tensor<128xf32> loc(#loc245)
    %246 = "top.Conv"(%243, %244, %245) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [2, 2], weight_is_coeff = 1 : i64} : (tensor<1x128x28x40xf32>, tensor<128x128x3x3xf32>, tensor<128xf32>) -> tensor<1x128x14x20xf32> loc(#loc246)
    %247 = "top.Weight"() : () -> tensor<64x128x3x3xf32> loc(#loc247)
    %248 = "top.Weight"() : () -> tensor<64xf32> loc(#loc248)
    %249 = "top.Conv"(%243, %247, %248) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x28x40xf32>, tensor<64x128x3x3xf32>, tensor<64xf32>) -> tensor<1x64x28x40xf32> loc(#loc249)
    %250 = "top.Weight"() : () -> tensor<128x1x3x3xf32> loc(#loc250)
    %251 = "top.Weight"() : () -> tensor<128xf32> loc(#loc251)
    %252 = "top.Conv"(%243, %250, %251) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 128 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x28x40xf32>, tensor<128x1x3x3xf32>, tensor<128xf32>) -> tensor<1x128x28x40xf32> loc(#loc252)
    %253 = "top.SiLU"(%246) : (tensor<1x128x14x20xf32>) -> tensor<1x128x14x20xf32> loc(#loc253)
    %254 = "top.SiLU"(%249) : (tensor<1x64x28x40xf32>) -> tensor<1x64x28x40xf32> loc(#loc254)
    %255 = "top.SiLU"(%252) : (tensor<1x128x28x40xf32>) -> tensor<1x128x28x40xf32> loc(#loc255)
    %256 = "top.Concat"(%253, %221) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x128x14x20xf32>, tensor<1x256x14x20xf32>) -> tensor<1x384x14x20xf32> loc(#loc256)
    %257 = "top.Weight"() : () -> tensor<64x64x3x3xf32> loc(#loc257)
    %258 = "top.Weight"() : () -> tensor<64xf32> loc(#loc258)
    %259 = "top.Conv"(%254, %257, %258) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x28x40xf32>, tensor<64x64x3x3xf32>, tensor<64xf32>) -> tensor<1x64x28x40xf32> loc(#loc259)
    %260 = "top.Weight"() : () -> tensor<128x128x1x1xf32> loc(#loc260)
    %261 = "top.Weight"() : () -> tensor<128xf32> loc(#loc261)
    %262 = "top.Conv"(%255, %260, %261) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x28x40xf32>, tensor<128x128x1x1xf32>, tensor<128xf32>) -> tensor<1x128x28x40xf32> loc(#loc262)
    %263 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc263)
    %264 = "top.Weight"() : () -> tensor<256xf32> loc(#loc264)
    %265 = "top.Conv"(%256, %263, %264) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x384x14x20xf32>, tensor<256x384x1x1xf32>, tensor<256xf32>) -> tensor<1x256x14x20xf32> loc(#loc265)
    %266 = "top.SiLU"(%259) : (tensor<1x64x28x40xf32>) -> tensor<1x64x28x40xf32> loc(#loc266)
    %267 = "top.SiLU"(%262) : (tensor<1x128x28x40xf32>) -> tensor<1x128x28x40xf32> loc(#loc267)
    %268 = "top.SiLU"(%265) : (tensor<1x256x14x20xf32>) -> tensor<1x256x14x20xf32> loc(#loc268)
    %269 = "top.Weight"() : () -> tensor<64x64x1x1xf32> loc(#loc269)
    %270 = "top.Weight"() : () -> tensor<64xf32> loc(#loc270)
    %271 = "top.Conv"(%266, %269, %270) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x28x40xf32>, tensor<64x64x1x1xf32>, tensor<64xf32>) -> tensor<1x64x28x40xf32> loc(#loc271)
    %272 = "top.Weight"() : () -> tensor<128x1x3x3xf32> loc(#loc272)
    %273 = "top.Weight"() : () -> tensor<128xf32> loc(#loc273)
    %274 = "top.Conv"(%267, %272, %273) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 128 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x28x40xf32>, tensor<128x1x3x3xf32>, tensor<128xf32>) -> tensor<1x128x28x40xf32> loc(#loc274)
    %275 = "top.Slice"(%268, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x14x20xf32>, none, none, none) -> tensor<1x128x14x20xf32> loc(#loc275)
    %276 = "top.Slice"(%268, %0, %0, %0) {axes = [], ends = [9223372036854775807, 256, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 128, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x14x20xf32>, none, none, none) -> tensor<1x128x14x20xf32> loc(#loc276)
    %277 = "top.Weight"() : () -> tensor<64x128x3x3xf32> loc(#loc277)
    %278 = "top.Weight"() : () -> tensor<64xf32> loc(#loc278)
    %279 = "top.Conv"(%276, %277, %278) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x14x20xf32>, tensor<64x128x3x3xf32>, tensor<64xf32>) -> tensor<1x64x14x20xf32> loc(#loc279)
    %280 = "top.SiLU"(%274) : (tensor<1x128x28x40xf32>) -> tensor<1x128x28x40xf32> loc(#loc280)
    %281 = "top.Weight"() : () -> tensor<128x128x1x1xf32> loc(#loc281)
    %282 = "top.Weight"() : () -> tensor<128xf32> loc(#loc282)
    %283 = "top.Conv"(%280, %281, %282) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x28x40xf32>, tensor<128x128x1x1xf32>, tensor<128xf32>) -> tensor<1x128x28x40xf32> loc(#loc283)
    %284 = "top.SiLU"(%279) : (tensor<1x64x14x20xf32>) -> tensor<1x64x14x20xf32> loc(#loc284)
    %285 = "top.Weight"() : () -> tensor<128x64x3x3xf32> loc(#loc285)
    %286 = "top.Weight"() : () -> tensor<128xf32> loc(#loc286)
    %287 = "top.Conv"(%284, %285, %286) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], pads = [1, 1, 1, 1], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x64x14x20xf32>, tensor<128x64x3x3xf32>, tensor<128xf32>) -> tensor<1x128x14x20xf32> loc(#loc287)
    %288 = "top.SiLU"(%283) : (tensor<1x128x28x40xf32>) -> tensor<1x128x28x40xf32> loc(#loc288)
    %289 = "top.Weight"() : () -> tensor<4x128x1x1xf32> loc(#loc289)
    %290 = "top.Weight"() : () -> tensor<4xf32> loc(#loc290)
    %291 = "top.Conv"(%288, %289, %290) {dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], pads = [0, 0, 0, 0], relu_limit = -1.000000e+00 : f64, strides = [1, 1], weight_is_coeff = 1 : i64} : (tensor<1x128x28x40xf32>, tensor<4x128x1x1xf32>, tensor<4xf32>) -> tensor<1x4x28x40xf32> loc(#loc291)
    %292 = "top.SiLU"(%287) : (tensor<1x128x14x20xf32>) -> tensor<1x128x14x20xf32> loc(#loc292)
    %293 = "top.Concat"(%271, %291) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x64x28x40xf32>, tensor<1x4x28x40xf32>) -> tensor<1x68x28x40xf32> loc(#loc293)
    %294 = "top.Add"(%276, %292) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x14x20xf32>, tensor<1x128x14x20xf32>) -> tensor<1x128x14x20xf32> loc(#loc294)
    %295 = "top.Reshape"(%293) {flatten_start_dim = -1 : i64, shape = [1, 68, -1]} : (tensor<1x68x28x40xf32>) -> tensor<1x68x1120xf32> loc(#loc295)
    %296 = "top.Concat"(%275, %276, %294) {axis = 1 : si32, do_relu = false, relu_limit = -1.000000e+00 : f64, round_mode = "HalfAwayFromZero"} : (tensor<1x128x14x20xf32>, tensor<1x128x14x20xf32>, tensor<1x128x14x20xf32>) -> tensor<1x384x14x20xf32> loc(#loc296)
    %297 = "top.Weight"() : () -> tensor<256x384x1x1xf32> loc(#loc297)
    %298 = "top.Weight"() : () -> tensor<256xf32> loc(#loc298)
