#loc = loc(unknown)
module @yolo11s attributes {module.FLOPs = 3787969080 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "cv181x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.mode = "BF16", module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_LOWERED", module.top_run_mode = "STATIC", module.weight_file = "yolo11s_tpu_lowered_cv181x_bf16_weight.npz"} {
  func.func @main(%arg0: tensor<1x3x224x320xf32> loc(unknown)) -> (tensor<1x1x4x1470xf32>, tensor<1x4x1470xf32>) {
    %0 = "top.None"() : () -> none loc(#loc)
    %1 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [224, 320], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627]} : (tensor<1x3x224x320xf32>) -> tensor<1x3x224x320xf32> loc(#loc1)
    %2 = "tpu.Cast"(%1) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x3x224x320xf32>) -> tensor<1x3x224x320xbf16> loc(#loc2)
    %3 = "top.Weight"() : () -> tensor<32xf32> loc(#loc3)
    %4 = "top.Weight"() : () -> tensor<32x3x3x3xbf16> loc(#loc4)
    %5 = "tpu.Conv2D"(%2, %4, %3) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x224x320xbf16>, tensor<32x3x3x3xbf16>, tensor<32xf32>) -> tensor<1x32x112x160xbf16> loc(#loc5)
    %6 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc6)
    %7 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc7)
    %8 = "tpu.LutBF16"(%5, %6, %7) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x32x112x160xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x32x112x160xbf16> loc(#loc8)
    %9 = "top.Weight"() : () -> tensor<64xf32> loc(#loc9)
    %10 = "top.Weight"() : () -> tensor<64x32x3x3xbf16> loc(#loc10)
    %11 = "tpu.Conv2D"(%8, %10, %9) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x112x160xbf16>, tensor<64x32x3x3xbf16>, tensor<64xf32>) -> tensor<1x64x56x80xbf16> loc(#loc11)
    %12 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc12)
    %13 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc13)
    %14 = "tpu.LutBF16"(%11, %12, %13) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x56x80xbf16> loc(#loc14)
    %15 = "top.Weight"() : () -> tensor<64xf32> loc(#loc15)
    %16 = "top.Weight"() : () -> tensor<64x64x1x1xbf16> loc(#loc16)
    %17 = "tpu.Conv2D"(%14, %16, %15) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x56x80xbf16>, tensor<64x64x1x1xbf16>, tensor<64xf32>) -> tensor<1x64x56x80xbf16> loc(#loc17)
    %18 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc18)
    %19 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc19)
    %20 = "tpu.LutBF16"(%17, %18, %19) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x56x80xbf16> loc(#loc20)
    %21 = "tpu.Slice"(%20, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 32, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x56x80xbf16>, none, none, none, none) -> tensor<1x32x56x80xbf16> loc(#loc21)
    %22 = "tpu.Slice"(%20, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x56x80xbf16>, none, none, none, none) -> tensor<1x32x56x80xbf16> loc(#loc22)
    %23 = "top.Weight"() : () -> tensor<16xf32> loc(#loc23)
    %24 = "top.Weight"() : () -> tensor<16x32x3x3xbf16> loc(#loc24)
    %25 = "tpu.Conv2D"(%22, %24, %23) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x56x80xbf16>, tensor<16x32x3x3xbf16>, tensor<16xf32>) -> tensor<1x16x56x80xbf16> loc(#loc25)
    %26 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc26)
    %27 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc27)
    %28 = "tpu.LutBF16"(%25, %26, %27) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x16x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x16x56x80xbf16> loc(#loc28)
    %29 = "top.Weight"() : () -> tensor<32xf32> loc(#loc29)
    %30 = "top.Weight"() : () -> tensor<32x16x3x3xbf16> loc(#loc30)
    %31 = "tpu.Conv2D"(%28, %30, %29) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x16x56x80xbf16>, tensor<32x16x3x3xbf16>, tensor<32xf32>) -> tensor<1x32x56x80xbf16> loc(#loc31)
    %32 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc32)
    %33 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc33)
    %34 = "tpu.LutBF16"(%31, %32, %33) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x32x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x32x56x80xbf16> loc(#loc34)
    %35 = "tpu.Add"(%22, %34) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x56x80xbf16>, tensor<1x32x56x80xbf16>) -> tensor<1x32x56x80xbf16> loc(#loc35)
    %36 = "tpu.Concat"(%21, %22, %35) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x56x80xbf16>, tensor<1x32x56x80xbf16>, tensor<1x32x56x80xbf16>) -> tensor<1x96x56x80xbf16> loc(#loc36)
    %37 = "top.Weight"() : () -> tensor<128xf32> loc(#loc37)
    %38 = "top.Weight"() : () -> tensor<128x96x1x1xbf16> loc(#loc38)
    %39 = "tpu.Conv2D"(%36, %38, %37) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x96x56x80xbf16>, tensor<128x96x1x1xbf16>, tensor<128xf32>) -> tensor<1x128x56x80xbf16> loc(#loc39)
    %40 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc40)
    %41 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc41)
    %42 = "tpu.LutBF16"(%39, %40, %41) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x56x80xbf16> loc(#loc42)
    %43 = "top.Weight"() : () -> tensor<128xf32> loc(#loc43)
    %44 = "top.Weight"() : () -> tensor<128x128x3x3xbf16> loc(#loc44)
    %45 = "tpu.Conv2D"(%42, %44, %43) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x56x80xbf16>, tensor<128x128x3x3xbf16>, tensor<128xf32>) -> tensor<1x128x28x40xbf16> loc(#loc45)
    %46 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc46)
    %47 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc47)
    %48 = "tpu.LutBF16"(%45, %46, %47) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x28x40xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x28x40xbf16> loc(#loc48)
    %49 = "top.Weight"() : () -> tensor<128xf32> loc(#loc49)
    %50 = "top.Weight"() : () -> tensor<128x128x1x1xbf16> loc(#loc50)
    %51 = "tpu.Conv2D"(%48, %50, %49) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x28x40xbf16>, tensor<128x128x1x1xbf16>, tensor<128xf32>) -> tensor<1x128x28x40xbf16> loc(#loc51)
    %52 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc52)
    %53 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc53)
    %54 = "tpu.LutBF16"(%51, %52, %53) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x28x40xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x28x40xbf16> loc(#loc54)
    %55 = "tpu.Slice"(%54, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40xbf16>, none, none, none, none) -> tensor<1x64x28x40xbf16> loc(#loc55)
    %56 = "tpu.Slice"(%54, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 64, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40xbf16>, none, none, none, none) -> tensor<1x64x28x40xbf16> loc(#loc56)
    %57 = "top.Weight"() : () -> tensor<32xf32> loc(#loc57)
    %58 = "top.Weight"() : () -> tensor<32x64x3x3xbf16> loc(#loc58)
    %59 = "tpu.Conv2D"(%56, %58, %57) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x28x40xbf16>, tensor<32x64x3x3xbf16>, tensor<32xf32>) -> tensor<1x32x28x40xbf16> loc(#loc59)
    %60 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc60)
    %61 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc61)
    %62 = "tpu.LutBF16"(%59, %60, %61) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x32x28x40xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x32x28x40xbf16> loc(#loc62)
    %63 = "top.Weight"() : () -> tensor<64xf32> loc(#loc63)
    %64 = "top.Weight"() : () -> tensor<64x32x3x3xbf16> loc(#loc64)
    %65 = "tpu.Conv2D"(%62, %64, %63) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x28x40xbf16>, tensor<64x32x3x3xbf16>, tensor<64xf32>) -> tensor<1x64x28x40xbf16> loc(#loc65)
    %66 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc66)
    %67 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc67)
    %68 = "tpu.LutBF16"(%65, %66, %67) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x28x40xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x28x40xbf16> loc(#loc68)
    %69 = "tpu.Add"(%56, %68) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x28x40xbf16>, tensor<1x64x28x40xbf16>) -> tensor<1x64x28x40xbf16> loc(#loc69)
    %70 = "tpu.Concat"(%55, %56, %69) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x28x40xbf16>, tensor<1x64x28x40xbf16>, tensor<1x64x28x40xbf16>) -> tensor<1x192x28x40xbf16> loc(#loc70)
    %71 = "top.Weight"() : () -> tensor<256xf32> loc(#loc71)
    %72 = "top.Weight"() : () -> tensor<256x192x1x1xbf16> loc(#loc72)
    %73 = "tpu.Conv2D"(%70, %72, %71) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x192x28x40xbf16>, tensor<256x192x1x1xbf16>, tensor<256xf32>) -> tensor<1x256x28x40xbf16> loc(#loc73)
    %74 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc74)
    %75 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc75)
    %76 = "tpu.LutBF16"(%73, %74, %75) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x256x28x40xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x256x28x40xbf16> loc(#loc76)
    %77 = "top.Weight"() : () -> tensor<256xf32> loc(#loc77)
    %78 = "top.Weight"() : () -> tensor<256x256x3x3xbf16> loc(#loc78)
    %79 = "tpu.Conv2D"(%76, %78, %77) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x28x40xbf16>, tensor<256x256x3x3xbf16>, tensor<256xf32>) -> tensor<1x256x14x20xbf16> loc(#loc79)
    %80 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc80)
    %81 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc81)
    %82 = "tpu.LutBF16"(%79, %80, %81) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x256x14x20xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x256x14x20xbf16> loc(#loc82)
    %83 = "top.Weight"() : () -> tensor<256xf32> loc(#loc83)
    %84 = "top.Weight"() : () -> tensor<256x256x1x1xbf16> loc(#loc84)
    %85 = "tpu.Conv2D"(%82, %84, %83) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x14x20xbf16>, tensor<256x256x1x1xbf16>, tensor<256xf32>) -> tensor<1x256x14x20xbf16> loc(#loc85)
    %86 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc86)
    %87 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc87)
    %88 = "tpu.LutBF16"(%85, %86, %87) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x256x14x20xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x256x14x20xbf16> loc(#loc88)
    %89 = "tpu.Slice"(%88, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x14x20xbf16>, none, none, none, none) -> tensor<1x128x14x20xbf16> loc(#loc89)
    %90 = "tpu.Slice"(%88, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 256, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 128, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x256x14x20xbf16>, none, none, none, none) -> tensor<1x128x14x20xbf16> loc(#loc90)
    %91 = "top.Weight"() : () -> tensor<64xf32> loc(#loc91)
    %92 = "top.Weight"() : () -> tensor<64x128x1x1xbf16> loc(#loc92)
    %93 = "tpu.Conv2D"(%90, %92, %91) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x14x20xbf16>, tensor<64x128x1x1xbf16>, tensor<64xf32>) -> tensor<1x64x14x20xbf16> loc(#loc93)
    %94 = "top.Weight"() : () -> tensor<64xf32> loc(#loc94)
    %95 = "top.Weight"() : () -> tensor<64x128x1x1xbf16> loc(#loc95)
    %96 = "tpu.Conv2D"(%90, %95, %94) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x14x20xbf16>, tensor<64x128x1x1xbf16>, tensor<64xf32>) -> tensor<1x64x14x20xbf16> loc(#loc96)
    %97 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc97)
    %98 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc98)
    %99 = "tpu.LutBF16"(%93, %97, %98) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x14x20xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x14x20xbf16> loc(#loc99)
    %100 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc100)
    %101 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc101)
    %102 = "tpu.LutBF16"(%96, %100, %101) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x14x20xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x14x20xbf16> loc(#loc102)
    %103 = "top.Weight"() : () -> tensor<64xf32> loc(#loc103)
    %104 = "top.Weight"() : () -> tensor<64x64x3x3xbf16> loc(#loc104)
    %105 = "tpu.Conv2D"(%99, %104, %103) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x14x20xbf16>, tensor<64x64x3x3xbf16>, tensor<64xf32>) -> tensor<1x64x14x20xbf16> loc(#loc105)
    %106 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc106)
    %107 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc107)
    %108 = "tpu.LutBF16"(%105, %106, %107) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x14x20xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x14x20xbf16> loc(#loc108)
    %109 = "top.Weight"() : () -> tensor<64xf32> loc(#loc109)
    %110 = "top.Weight"() : () -> tensor<64x64x3x3xbf16> loc(#loc110)
    %111 = "tpu.Conv2D"(%108, %110, %109) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x14x20xbf16>, tensor<64x64x3x3xbf16>, tensor<64xf32>) -> tensor<1x64x14x20xbf16> loc(#loc111)
    %112 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc112)
    %113 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc113)
    %114 = "tpu.LutBF16"(%111, %112, %113) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x14x20xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x14x20xbf16> loc(#loc114)
    %115 = "tpu.Add"(%99, %114) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x14x20xbf16>, tensor<1x64x14x20xbf16>) -> tensor<1x64x14x20xbf16> loc(#loc115)
    %116 = "top.Weight"() : () -> tensor<64xf32> loc(#loc116)
    %117 = "top.Weight"() : () -> tensor<64x64x3x3xbf16> loc(#loc117)
    %118 = "tpu.Conv2D"(%115, %117, %116) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x14x20xbf16>, tensor<64x64x3x3xbf16>, tensor<64xf32>) -> tensor<1x64x14x20xbf16> loc(#loc118)
    %119 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc119)
    %120 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc120)
    %121 = "tpu.LutBF16"(%118, %119, %120) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x14x20xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x14x20xbf16> loc(#loc121)
    %122 = "top.Weight"() : () -> tensor<64xf32> loc(#loc122)
    %123 = "top.Weight"() : () -> tensor<64x64x3x3xbf16> loc(#loc123)
    %124 = "tpu.Conv2D"(%121, %123, %122) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x14x20xbf16>, tensor<64x64x3x3xbf16>, tensor<64xf32>) -> tensor<1x64x14x20xbf16> loc(#loc124)
    %125 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc125)
    %126 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc126)
    %127 = "tpu.LutBF16"(%124, %125, %126) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x14x20xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x14x20xbf16> loc(#loc127)
    %128 = "tpu.Add"(%115, %127) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x14x20xbf16>, tensor<1x64x14x20xbf16>) -> tensor<1x64x14x20xbf16> loc(#loc128)
    %129 = "tpu.Concat"(%128, %102) {axis = 1 : si32, do_relu = false, only_merge = true, relu_limit = -1.000000e+00 : f64} : (tensor<1x64x14x20xbf16>, tensor<1x64x14x20xbf16>) -> tensor<1x128x14x20xbf16> loc(#loc129)
    %130 = "top.Weight"() : () -> tensor<128xf32> loc(#loc130)
    %131 = "top.Weight"() : () -> tensor<128x128x1x1xbf16> loc(#loc131)
    %132 = "tpu.Conv2D"(%129, %131, %130) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x14x20xbf16>, tensor<128x128x1x1xbf16>, tensor<128xf32>) -> tensor<1x128x14x20xbf16> loc(#loc132)
    %133 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc133)
    %134 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc134)
    %135 = "tpu.LutBF16"(%132, %133, %134) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x14x20xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x14x20xbf16> loc(#loc135)
    %136 = "tpu.Concat"(%89, %90, %135) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x14x20xbf16>, tensor<1x128x14x20xbf16>, tensor<1x128x14x20xbf16>) -> tensor<1x384x14x20xbf16> loc(#loc136)
    %137 = "top.Weight"() : () -> tensor<256xf32> loc(#loc137)
    %138 = "top.Weight"() : () -> tensor<256x384x1x1xbf16> loc(#loc138)
    %139 = "tpu.Conv2D"(%136, %138, %137) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x384x14x20xbf16>, tensor<256x384x1x1xbf16>, tensor<256xf32>) -> tensor<1x256x14x20xbf16> loc(#loc139)
    %140 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc140)
    %141 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc141)
    %142 = "tpu.LutBF16"(%139, %140, %141) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x256x14x20xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x256x14x20xbf16> loc(#loc142)
    %143 = "top.Weight"() : () -> tensor<512xf32> loc(#loc143)
    %144 = "top.Weight"() : () -> tensor<512x256x3x3xbf16> loc(#loc144)
    %145 = "tpu.Conv2D"(%142, %144, %143) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x14x20xbf16>, tensor<512x256x3x3xbf16>, tensor<512xf32>) -> tensor<1x512x7x10xbf16> loc(#loc145)
    %146 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc146)
    %147 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc147)
    %148 = "tpu.LutBF16"(%145, %146, %147) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x512x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x512x7x10xbf16> loc(#loc148)
    %149 = "top.Weight"() : () -> tensor<512xf32> loc(#loc149)
    %150 = "top.Weight"() : () -> tensor<512x512x1x1xbf16> loc(#loc150)
    %151 = "tpu.Conv2D"(%148, %150, %149) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x512x7x10xbf16>, tensor<512x512x1x1xbf16>, tensor<512xf32>) -> tensor<1x512x7x10xbf16> loc(#loc151)
    %152 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc152)
    %153 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc153)
    %154 = "tpu.LutBF16"(%151, %152, %153) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x512x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x512x7x10xbf16> loc(#loc154)
    %155 = "tpu.Slice"(%154, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 256, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x7x10xbf16>, none, none, none, none) -> tensor<1x256x7x10xbf16> loc(#loc155)
    %156 = "tpu.Slice"(%154, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 512, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 256, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x7x10xbf16>, none, none, none, none) -> tensor<1x256x7x10xbf16> loc(#loc156)
    %157 = "top.Weight"() : () -> tensor<128xf32> loc(#loc157)
    %158 = "top.Weight"() : () -> tensor<128x256x1x1xbf16> loc(#loc158)
    %159 = "tpu.Conv2D"(%156, %158, %157) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x7x10xbf16>, tensor<128x256x1x1xbf16>, tensor<128xf32>) -> tensor<1x128x7x10xbf16> loc(#loc159)
    %160 = "top.Weight"() : () -> tensor<128xf32> loc(#loc160)
    %161 = "top.Weight"() : () -> tensor<128x256x1x1xbf16> loc(#loc161)
    %162 = "tpu.Conv2D"(%156, %161, %160) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x7x10xbf16>, tensor<128x256x1x1xbf16>, tensor<128xf32>) -> tensor<1x128x7x10xbf16> loc(#loc162)
    %163 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc163)
    %164 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc164)
    %165 = "tpu.LutBF16"(%159, %163, %164) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x7x10xbf16> loc(#loc165)
    %166 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc166)
    %167 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc167)
    %168 = "tpu.LutBF16"(%162, %166, %167) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x7x10xbf16> loc(#loc168)
    %169 = "top.Weight"() : () -> tensor<128xf32> loc(#loc169)
    %170 = "top.Weight"() : () -> tensor<128x128x3x3xbf16> loc(#loc170)
    %171 = "tpu.Conv2D"(%165, %170, %169) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x7x10xbf16>, tensor<128x128x3x3xbf16>, tensor<128xf32>) -> tensor<1x128x7x10xbf16> loc(#loc171)
    %172 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc172)
    %173 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc173)
    %174 = "tpu.LutBF16"(%171, %172, %173) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x7x10xbf16> loc(#loc174)
    %175 = "top.Weight"() : () -> tensor<128xf32> loc(#loc175)
    %176 = "top.Weight"() : () -> tensor<128x128x3x3xbf16> loc(#loc176)
    %177 = "tpu.Conv2D"(%174, %176, %175) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x7x10xbf16>, tensor<128x128x3x3xbf16>, tensor<128xf32>) -> tensor<1x128x7x10xbf16> loc(#loc177)
    %178 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc178)
    %179 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc179)
    %180 = "tpu.LutBF16"(%177, %178, %179) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x7x10xbf16> loc(#loc180)
    %181 = "tpu.Add"(%165, %180) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x7x10xbf16>, tensor<1x128x7x10xbf16>) -> tensor<1x128x7x10xbf16> loc(#loc181)
    %182 = "top.Weight"() : () -> tensor<128xf32> loc(#loc182)
    %183 = "top.Weight"() : () -> tensor<128x128x3x3xbf16> loc(#loc183)
    %184 = "tpu.Conv2D"(%181, %183, %182) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x7x10xbf16>, tensor<128x128x3x3xbf16>, tensor<128xf32>) -> tensor<1x128x7x10xbf16> loc(#loc184)
    %185 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc185)
    %186 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc186)
    %187 = "tpu.LutBF16"(%184, %185, %186) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x7x10xbf16> loc(#loc187)
    %188 = "top.Weight"() : () -> tensor<128xf32> loc(#loc188)
    %189 = "top.Weight"() : () -> tensor<128x128x3x3xbf16> loc(#loc189)
    %190 = "tpu.Conv2D"(%187, %189, %188) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x7x10xbf16>, tensor<128x128x3x3xbf16>, tensor<128xf32>) -> tensor<1x128x7x10xbf16> loc(#loc190)
    %191 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc191)
    %192 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc192)
    %193 = "tpu.LutBF16"(%190, %191, %192) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x7x10xbf16> loc(#loc193)
    %194 = "tpu.Add"(%181, %193) {do_relu = false, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x7x10xbf16>, tensor<1x128x7x10xbf16>) -> tensor<1x128x7x10xbf16> loc(#loc194)
    %195 = "tpu.Concat"(%194, %168) {axis = 1 : si32, do_relu = false, only_merge = true, relu_limit = -1.000000e+00 : f64} : (tensor<1x128x7x10xbf16>, tensor<1x128x7x10xbf16>) -> tensor<1x256x7x10xbf16> loc(#loc195)
    %196 = "top.Weight"() : () -> tensor<256xf32> loc(#loc196)
    %197 = "top.Weight"() : () -> tensor<256x256x1x1xbf16> loc(#loc197)
    %198 = "tpu.Conv2D"(%195, %197, %196) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x7x10xbf16>, tensor<256x256x1x1xbf16>, tensor<256xf32>) -> tensor<1x256x7x10xbf16> loc(#loc198)
    %199 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc199)
    %200 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc200)
    %201 = "tpu.LutBF16"(%198, %199, %200) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x256x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x256x7x10xbf16> loc(#loc201)
    %202 = "tpu.Concat"(%155, %156, %201) {axis = 1 : si32, do_relu = false, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x7x10xbf16>, tensor<1x256x7x10xbf16>, tensor<1x256x7x10xbf16>) -> tensor<1x768x7x10xbf16> loc(#loc202)
    %203 = "top.Weight"() : () -> tensor<512xf32> loc(#loc203)
    %204 = "top.Weight"() : () -> tensor<512x768x1x1xbf16> loc(#loc204)
    %205 = "tpu.Conv2D"(%202, %204, %203) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x768x7x10xbf16>, tensor<512x768x1x1xbf16>, tensor<512xf32>) -> tensor<1x512x7x10xbf16> loc(#loc205)
    %206 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc206)
    %207 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc207)
    %208 = "tpu.LutBF16"(%205, %206, %207) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x512x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x512x7x10xbf16> loc(#loc208)
    %209 = "top.Weight"() : () -> tensor<256xf32> loc(#loc209)
    %210 = "top.Weight"() : () -> tensor<256x512x1x1xbf16> loc(#loc210)
    %211 = "tpu.Conv2D"(%208, %210, %209) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x512x7x10xbf16>, tensor<256x512x1x1xbf16>, tensor<256xf32>) -> tensor<1x256x7x10xbf16> loc(#loc211)
    %212 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc212)
    %213 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc213)
    %214 = "tpu.LutBF16"(%211, %212, %213) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x256x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x256x7x10xbf16> loc(#loc214)
    %215 = "tpu.Pool2D"(%214) {count_include_pad = false, do_relu = false, first_round_mode = #tpu<round_mode HalfAwayFromZero>, is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], pool_mode = #tpu<pool_mode Max>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfAwayFromZero>, strides = [1, 1]} : (tensor<1x256x7x10xbf16>) -> tensor<1x256x7x10xbf16> loc(#loc215)
    %216 = "tpu.Pool2D"(%215) {count_include_pad = false, do_relu = false, first_round_mode = #tpu<round_mode HalfAwayFromZero>, is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], pool_mode = #tpu<pool_mode Max>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfAwayFromZero>, strides = [1, 1]} : (tensor<1x256x7x10xbf16>) -> tensor<1x256x7x10xbf16> loc(#loc216)
    %217 = "tpu.Pool2D"(%216) {count_include_pad = false, do_relu = false, first_round_mode = #tpu<round_mode HalfAwayFromZero>, is_adaptive = false, keepdims = true, kernel_shape = [5, 5], pad_value = 0 : i64, pads = [2, 2, 2, 2], pool_mode = #tpu<pool_mode Max>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfAwayFromZero>, strides = [1, 1]} : (tensor<1x256x7x10xbf16>) -> tensor<1x256x7x10xbf16> loc(#loc217)
    %218 = "tpu.Concat"(%214, %215, %216, %217) {axis = 1 : si32, do_relu = false, only_merge = true, relu_limit = -1.000000e+00 : f64} : (tensor<1x256x7x10xbf16>, tensor<1x256x7x10xbf16>, tensor<1x256x7x10xbf16>, tensor<1x256x7x10xbf16>) -> tensor<1x1024x7x10xbf16> loc(#loc218)
    %219 = "top.Weight"() : () -> tensor<512xf32> loc(#loc219)
    %220 = "top.Weight"() : () -> tensor<512x1024x1x1xbf16> loc(#loc220)
    %221 = "tpu.Conv2D"(%218, %220, %219) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x1024x7x10xbf16>, tensor<512x1024x1x1xbf16>, tensor<512xf32>) -> tensor<1x512x7x10xbf16> loc(#loc221)
    %222 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc222)
    %223 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc223)
    %224 = "tpu.LutBF16"(%221, %222, %223) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x512x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x512x7x10xbf16> loc(#loc224)
    %225 = "top.Weight"() : () -> tensor<512xf32> loc(#loc225)
    %226 = "top.Weight"() : () -> tensor<512x512x1x1xbf16> loc(#loc226)
    %227 = "tpu.Conv2D"(%224, %226, %225) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x512x7x10xbf16>, tensor<512x512x1x1xbf16>, tensor<512xf32>) -> tensor<1x512x7x10xbf16> loc(#loc227)
    %228 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc228)
    %229 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc229)
    %230 = "tpu.LutBF16"(%227, %228, %229) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x512x7x10xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x512x7x10xbf16> loc(#loc230)
    %231 = "tpu.Slice"(%230, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 256, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x7x10xbf16>, none, none, none, none) -> tensor<1x256x7x10xbf16> loc(#loc231)
    %232 = "tpu.Slice"(%230, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 512, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 256, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x512x7x10xbf16>, none, none, none, none) -> tensor<1x256x7x10xbf16> loc(#loc232)
    %233 = "top.Weight"() : () -> tensor<512xf32> loc(#loc233)
    %234 = "top.Weight"() : () -> tensor<512x256x1x1xbf16> loc(#loc234)
    %235 = "tpu.Conv2D"(%232, %234, %233) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x7x10xbf16>, tensor<512x256x1x1xbf16>, tensor<512xf32>) -> tensor<1x512x7x10xbf16> loc(#loc235)
    %236 = "tpu.Reshape"(%235) {flatten_start_dim = -1 : i64, shape = [1, 4, 128, 70]} : (tensor<1x512x7x10xbf16>) -> tensor<1x4x128x70xbf16> loc(#loc236)
    %237 = "tpu.Slice"(%236, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 9223372036854775807, 32, 9223372036854775807], hasparamConvert_axes = [2], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x4x128x70xbf16>, none, none, none, none) -> tensor<1x4x32x70xbf16> loc(#loc237)
    %238 = "tpu.Slice"(%236, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 9223372036854775807, 64, 9223372036854775807], hasparamConvert_axes = [2], offset = [0, 0, 32, 0], steps = [1, 1, 1, 1]} : (tensor<1x4x128x70xbf16>, none, none, none, none) -> tensor<1x4x32x70xbf16> loc(#loc238)
    %239 = "tpu.Slice"(%236, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 9223372036854775807, 128, 9223372036854775807], hasparamConvert_axes = [2], offset = [0, 0, 64, 0], steps = [1, 1, 1, 1]} : (tensor<1x4x128x70xbf16>, none, none, none, none) -> tensor<1x4x64x70xbf16> loc(#loc239)
    %240 = "tpu.Permute"(%237, %0) {order = [0, 1, 3, 2]} : (tensor<1x4x32x70xbf16>, none) -> tensor<1x4x70x32xbf16> loc(#loc240)
    %241 = "tpu.Reshape"(%239) {flatten_start_dim = -1 : i64, shape = [1, 256, 7, 10]} : (tensor<1x4x64x70xbf16>) -> tensor<1x256x7x10xbf16> loc(#loc241)
    %242 = "tpu.MatMul"(%240, %238, %0, %0, %0) {do_relu = false, fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x4x70x32xbf16>, tensor<1x4x32x70xbf16>, none, none, none) -> tensor<1x4x70x70xbf16> loc(#loc242)
    %243 = "top.Weight"() : () -> tensor<256xf32> loc(#loc243)
    %244 = "top.Weight"() : () -> tensor<256x1x3x3xbf16> loc(#loc244)
    %245 = "tpu.Conv2D"(%241, %244, %243) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 256 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x256x7x10xbf16>, tensor<256x1x3x3xbf16>, tensor<256xf32>) -> tensor<1x256x7x10xbf16> loc(#loc245)
    %246 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc246)
    %247 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc247)
    %248 = "tpu.LutBF16"(%242, %246, %247) {const_val = 0.1767766922712326 : f64, do_relu = false, is_scalar = false, lut_mode = #tpu<lut_mode Slope>, max_range = 1.500000e+01 : f64, min_range = -1.500000e+01 : f64, relu_limit = -1.000000e+00 : f64} : (tensor<1x4x70x70xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x4x70x70xbf16> loc(#loc248)
    %249 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc249)
    %250 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc250)
    %251 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc251)
    %252 = "top.Weight"() : () -> tensor<1x1x32x8xbf16> loc(#loc252)
    %253 = "tpu.Softmax"(%248, %249, %250, %251, %252, %0) {axis = 3 : si32, beta = 1.000000e+00 : f64, log = false, round_mode = #tpu<round_mode HalfAwayFromZero>} : (tensor<1x4x70x70xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>, none) -> tensor<1x4x70x70xbf16> loc(#loc253)
    %254 = "tpu.Permute"(%253, %0) {order = [0, 1, 3, 2]} : (tensor<1x4x70x70xbf16>, none) -> tensor<1x4x70x70xbf16> loc(#loc254)
    %255 = "tpu.MatMul"(%239, %254, %0, %0, %0) {do_relu = false, fuse_rq = false, hdim_is_batch = false, input_zp = 0 : i64, keep_dims = true, left_reuse = 1 : i64, left_transpose = false, multipliers = [1], output_transpose = false, quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, right_transpose = false, right_zp = 0 : i64, round_mode = #tpu<round_mode HalfAwayFromZero>, rshifts = [0]} : (tensor<1x4x64x70xbf16>, tensor<1x4x70x70xbf16>, none, none, none) -> tensor<1x4x64x70xbf16> loc(#loc255)
