#loc = loc(unknown)
#loc1 = loc("images")
module @yolo11s attributes {module.FLOPs = 3787969080 : i64, module.addr_mode = "basic", module.asymmetric = false, module.chip = "cv181x", module.cores = 1 : i64, module.devices = 1 : i64, module.high_precision = false, module.inputs = ["images"], module.mode = "BF16", module.outputs = ["/model.23/dfl/conv/Conv_output_0_Conv_f32", "/model.23/Sigmoid_output_0_Sigmoid_f32"], module.platform = "ONNX", module.q_group_size = 0 : i64, module.state = "TPU_ADDRESSED", module.top_run_mode = "STATIC", module.weight_file = "yolo11s_tpu_addressed_cv181x_bf16_weight.npz"} {
  module @yolo11s attributes {module.coeff_addr = 1099511627776 : i64, module.coeff_size = 18870352 : i64, module.device_id = 0 : i64, module.neuron_size = 2150400 : i64, module.private_size = 0 : i64, module.step = 0 : i64} {
    func.func @main(%arg0: tensor<1x3x224x320xf32> loc(unknown)) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) {
      %0 = "top.Input"(%arg0) {channel_format = "nchw", do_preprocess = true, keep_aspect_ratio = true, keep_ratio_mode = "letterbox", mean = [0.000000e+00, 0.000000e+00, 0.000000e+00], pad_type = "center", pad_value = 0 : i64, pixel_format = "rgb", resize_dims = [224, 320], scale = [0.0039215688593685627, 0.0039215688593685627, 0.0039215688593685627]} : (tensor<1x3x224x320xf32>) -> tensor<1x3x224x320xf32, 3298534883328 : i64> loc(#loc1)
      %1:2 = call @subfunc_0(%0) : (tensor<1x3x224x320xf32, 3298534883328 : i64>) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) loc(#loc)
      return %1#0, %1#1 : tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64> loc(#loc)
    } loc(#loc)
    func.func @subfunc_0(%arg0: tensor<1x3x224x320xf32, 3298534883328 : i64> loc("images")) -> (tensor<1x1x4x1470xf32, 5497558138880 : i64>, tensor<1x4x1470xf32, 4398046511104 : i64>) attributes {id = 0 : i64, mode = #tpu<run_mode TPU_STATIC>, next_index = array<i32: -1>} {
      %0 = "top.None"() : () -> none loc(#loc)
      %1 = "tpu.Cast"(%arg0) {round_mode = #tpu<round_mode HalfAwayFromZero>, with_scale = true} : (tensor<1x3x224x320xf32, 3298534883328 : i64>) -> tensor<1x3x224x320xbf16, 0 : i64> loc(#loc2)
      %2 = "top.Weight"() : () -> tensor<1x32x9x3xbf16, 1099520998480 : i64> loc(#loc3)
      %3 = "top.Weight"() : () -> tensor<2x32x1x1xui16, 1099522697232 : i64> loc(#loc4)
      %4 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099528345936 : i64> loc(#loc5)
      %5 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099522697360 : i64> loc(#loc6)
      %6 = "tpu.Group"(%1) ({
        %535 = "tpu.Load"(%1) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 5760, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [3], d_idx = [0], d_slice = [1], h_idx = [0, 7, 15, 23, 31, 39, 47, 55, 63, 71, 79, 87, 95, 103, 111, 119, 127, 135, 143, 151, 159, 167, 175, 183, 191, 199, 207, 215], h_slice = [8, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9, 9], w_idx = [0], w_slice = [320], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x3x224x320xbf16, 0 : i64>) -> tensor<1x3x224x320xbf16> loc(#loc8)
        %536 = "tpu.Load"(%2) {do_bcast = false, ginfo = #tpu.lg<out_addr = 6784, out_size = 216, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [3], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x9x3xbf16, 1099520998480 : i64>) -> tensor<1x32x9x3xbf16> loc(#loc9)
        %537 = "tpu.Load"(%3) {do_bcast = false, ginfo = #tpu.lg<out_addr = 7008, out_size = 16, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x32x1x1xui16, 1099522697232 : i64>) -> tensor<2x32x1x1xui16> loc(#loc10)
        %538 = "tpu.Load"(%4) {do_bcast = true, ginfo = #tpu.lg<out_addr = 5760, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099528345936 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc11)
        %539 = "tpu.Load"(%5) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6272, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099522697360 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc12)
        %540 = "tpu.Conv2D"(%535, %536, %537) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96, 100, 104, 108], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [160], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x3x224x320xbf16>, tensor<1x32x9x3xbf16>, tensor<2x32x1x1xui16>) -> tensor<1x32x112x160xbf16> loc(#loc13)
        %541 = "tpu.LutBF16"(%540, %538, %539) {ginfo = #tpu.lg<out_addr = 16384, out_size = 5120, buffer_addr = 21504, buffer_size = 10240, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96, 100, 104, 108], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [160], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x32x112x160xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x32x112x160xbf16> loc(#loc7)
        %542 = "tpu.Store"(%541, %0) {ginfo = #tpu.lg<out_addr = 16384, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52, 56, 60, 64, 68, 72, 76, 80, 84, 88, 92, 96, 100, 104, 108], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [160], id = 7, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x32x112x160xbf16>, none) -> tensor<1x32x112x160xbf16, 573440 : i64> loc(#loc7)
        "tpu.Yield"(%542) : (tensor<1x32x112x160xbf16, 573440 : i64>) -> () loc(#loc7)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 7, -2, 6, 0, 1, 2], group_type = 0 : i64, hsecs = 28 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-2, 2], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x3x224x320xbf16, 0 : i64>) -> tensor<1x32x112x160xbf16, 573440 : i64> loc(#loc7)
      %7 = "top.Weight"() : () -> tensor<1x64x9x32xbf16, 1099521000976 : i64> loc(#loc14)
      %8 = "top.Weight"() : () -> tensor<2x64x1x1xui16, 1099526697552 : i64> loc(#loc15)
      %9 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099528345936 : i64> loc(#loc16)
      %10 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099522697360 : i64> loc(#loc17)
      %11 = "tpu.Group"(%6) ({
        %535 = "tpu.Load"(%6) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 6400, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 3, 7, 11, 15, 19, 23, 27, 31, 35, 39, 43, 47, 51, 55, 59, 63, 67, 71, 75, 79, 83, 87, 91, 95, 99, 103, 107], h_slice = [4, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5, 5], w_idx = [0], w_slice = [160], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x112x160xbf16, 573440 : i64>) -> tensor<1x32x112x160xbf16> loc(#loc19)
        %536 = "tpu.Load"(%7) {do_bcast = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 4608, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [32], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x9x32xbf16, 1099521000976 : i64>) -> tensor<1x64x9x32xbf16> loc(#loc20)
        %537 = "tpu.Load"(%8) {do_bcast = false, ginfo = #tpu.lg<out_addr = 6912, out_size = 32, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x64x1x1xui16, 1099526697552 : i64>) -> tensor<2x64x1x1xui16> loc(#loc21)
        %538 = "tpu.Load"(%9) {do_bcast = true, ginfo = #tpu.lg<out_addr = 24576, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099528345936 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc22)
        %539 = "tpu.Load"(%10) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6400, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099522697360 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc23)
        %540 = "tpu.Conv2D"(%535, %536, %537) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x112x160xbf16>, tensor<1x64x9x32xbf16>, tensor<2x64x1x1xui16>) -> tensor<1x64x56x80xbf16> loc(#loc24)
        %541 = "tpu.LutBF16"(%540, %538, %539) {ginfo = #tpu.lg<out_addr = 20480, out_size = 2560, buffer_addr = 25088, buffer_size = 5120, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x56x80xbf16> loc(#loc18)
        %542 = "tpu.Store"(%541, %0) {ginfo = #tpu.lg<out_addr = 20480, out_size = 2560, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 7, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x64x56x80xbf16>, none) -> tensor<1x64x56x80xbf16, 0 : i64> loc(#loc18)
        "tpu.Yield"(%542) : (tensor<1x64x56x80xbf16, 0 : i64>) -> () loc(#loc18)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 7, -2, 6, 0, 1, 2], group_type = 0 : i64, hsecs = 28 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [-2, 0, 1, 2], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [2], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x112x160xbf16, 573440 : i64>) -> tensor<1x64x56x80xbf16, 0 : i64> loc(#loc18)
      %12 = "top.Weight"() : () -> tensor<1x64x1x64xbf16, 1099530308432 : i64> loc(#loc25)
      %13 = "top.Weight"() : () -> tensor<2x64x1x1xui16, 1099528347984 : i64> loc(#loc26)
      %14 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099528345936 : i64> loc(#loc27)
      %15 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099522697360 : i64> loc(#loc28)
      %16 = "tpu.Group"(%11) ({
        %535 = "tpu.Load"(%11) {do_bcast = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x56x80xbf16, 0 : i64>) -> tensor<1x64x56x80xbf16> loc(#loc30)
        %536 = "tpu.Load"(%12) {do_bcast = false, ginfo = #tpu.lg<out_addr = 5120, out_size = 1024, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [64], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x1x64xbf16, 1099530308432 : i64>) -> tensor<1x64x1x64xbf16> loc(#loc31)
        %537 = "tpu.Load"(%13) {do_bcast = false, ginfo = #tpu.lg<out_addr = 7168, out_size = 32, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x64x1x1xui16, 1099528347984 : i64>) -> tensor<2x64x1x1xui16> loc(#loc32)
        %538 = "tpu.Load"(%14) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6144, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099528345936 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc33)
        %539 = "tpu.Load"(%15) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6656, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099522697360 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc34)
        %540 = "tpu.Conv2D"(%535, %536, %537) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 0, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x56x80xbf16>, tensor<1x64x1x64xbf16>, tensor<2x64x1x1xui16>) -> tensor<1x64x56x80xbf16> loc(#loc35)
        %541 = "tpu.LutBF16"(%540, %538, %539) {ginfo = #tpu.lg<out_addr = 16384, out_size = 5120, buffer_addr = 21504, buffer_size = 10240, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [80], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x64x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x64x56x80xbf16> loc(#loc29)
        %542 = "tpu.Store"(%541, %0) {ginfo = #tpu.lg<out_addr = 16384, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 4, 8, 12, 16, 20, 24, 28, 32, 36, 40, 44, 48, 52], h_slice = [4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4], w_idx = [0], w_slice = [80], id = 7, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x64x56x80xbf16>, none) -> tensor<1x64x56x80xbf16, 1576960 : i64> loc(#loc29)
        "tpu.Yield"(%542) : (tensor<1x64x56x80xbf16, 1576960 : i64>) -> () loc(#loc29)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 7, -2, 6, 0, 1, 2], group_type = 0 : i64, hsecs = 14 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [0, 1, 2], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x64x56x80xbf16, 0 : i64>) -> tensor<1x64x56x80xbf16, 1576960 : i64> loc(#loc29)
      %17 = "tpu.Slice"(%16, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 32, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x56x80xbf16, 1576960 : i64>, none, none, none, none) -> tensor<1x32x56x80xbf16, 1576960 : i64> loc(#loc36)
      %18 = "tpu.Slice"(%16, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 32, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x64x56x80xbf16, 1576960 : i64>, none, none, none, none) -> tensor<1x32x56x80xbf16, 1863680 : i64> loc(#loc37)
      %19 = "top.Weight"() {do_compress = true} : () -> tensor<1x16x9x32xbf16, 1099525860624 : i64> loc(#loc38)
      %20 = "top.Weight"() {do_compress = true} : () -> tensor<2x16x1x1xui16, 1099526215952 : i64> loc(#loc39)
      %21 = "tpu.Conv2D"(%18, %19, %20) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x56x80xbf16, 1863680 : i64>, tensor<1x16x9x32xbf16, 1099525860624 : i64>, tensor<2x16x1x1xui16, 1099526215952 : i64>) -> tensor<1x16x56x80xbf16, 0 : i64> loc(#loc40)
      %22 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099528345936 : i64> loc(#loc41)
      %23 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099522697360 : i64> loc(#loc42)
      %24 = "top.Weight"() : () -> tensor<1x32x9x16xbf16, 1099523596688 : i64> loc(#loc43)
      %25 = "top.Weight"() : () -> tensor<2x32x1x1xui16, 1099527919312 : i64> loc(#loc44)
      %26 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099528345936 : i64> loc(#loc45)
      %27 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099522697360 : i64> loc(#loc46)
      %28 = "tpu.Group"(%21) ({
        %535 = "tpu.Load"(%21) {do_bcast = false, ginfo = #tpu.lg<out_addr = 28672, out_size = 3200, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 7, 15, 23, 31, 39, 47], h_slice = [9, 10, 10, 10, 10, 10, 9], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x16x56x80xbf16, 0 : i64>) -> tensor<1x16x56x80xbf16> loc(#loc48)
        %536 = "tpu.Load"(%22) {do_bcast = true, ginfo = #tpu.lg<out_addr = 7424, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099528345936 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc49)
        %537 = "tpu.Load"(%23) {do_bcast = true, ginfo = #tpu.lg<out_addr = 14464, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099522697360 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc50)
        %538 = "tpu.Load"(%24) {do_bcast = false, ginfo = #tpu.lg<out_addr = 13312, out_size = 1152, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [16], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x9x16xbf16, 1099523596688 : i64>) -> tensor<1x32x9x16xbf16> loc(#loc51)
        %539 = "tpu.Load"(%25) {do_bcast = false, ginfo = #tpu.lg<out_addr = 26624, out_size = 16, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x32x1x1xui16, 1099527919312 : i64>) -> tensor<2x32x1x1xui16> loc(#loc52)
        %540 = "tpu.LutBF16"(%535, %536, %537) {ginfo = #tpu.lg<out_addr = 16384, out_size = 3200, buffer_addr = 0, buffer_size = 6400, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [16], d_idx = [0], d_slice = [1], h_idx = [0, 7, 15, 23, 31, 39, 47], h_slice = [9, 10, 10, 10, 10, 10, 9], w_idx = [0], w_slice = [80], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x16x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x16x56x80xbf16> loc(#loc53)
        %541 = "tpu.Load"(%26) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6400, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099528345936 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc54)
        %542 = "tpu.Load"(%27) {do_bcast = true, ginfo = #tpu.lg<out_addr = 6912, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 7, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099522697360 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc55)
        %543 = "tpu.Conv2D"(%540, %538, %539) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 0, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 8, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x16x56x80xbf16>, tensor<1x32x9x16xbf16>, tensor<2x32x1x1xui16>) -> tensor<1x32x56x80xbf16> loc(#loc56)
        %544 = "tpu.LutBF16"(%543, %541, %542) {ginfo = #tpu.lg<out_addr = 8192, out_size = 5120, buffer_addr = 16384, buffer_size = 10240, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 9, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x32x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x32x56x80xbf16> loc(#loc47)
        %545 = "tpu.Store"(%544, %0) {ginfo = #tpu.lg<out_addr = 8192, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 8, 16, 24, 32, 40, 48], h_slice = [8, 8, 8, 8, 8, 8, 8], w_idx = [0], w_slice = [80], id = 10, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x32x56x80xbf16>, none) -> tensor<1x32x56x80xbf16, 1146880 : i64> loc(#loc47)
        "tpu.Yield"(%545) : (tensor<1x32x56x80xbf16, 1146880 : i64>) -> () loc(#loc47)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 5, 3, 4, 10, -2, 8, 6, 7, -3, 9, 0, 1, 2], group_type = 0 : i64, hsecs = 7 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x16x56x80xbf16, 0 : i64>) -> tensor<1x32x56x80xbf16, 1146880 : i64> loc(#loc47)
      %29 = "top.Weight"() : () -> tensor<1x128x1x96xbf16, 1099522656272 : i64> loc(#loc57)
      %30 = "top.Weight"() : () -> tensor<2x128x1x1xui16, 1099521242640 : i64> loc(#loc58)
      %31 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099528345936 : i64> loc(#loc59)
      %32 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099522697360 : i64> loc(#loc60)
      %33 = "tpu.Group"(%18, %28, %17) ({
        %535 = "tpu.Load"(%18) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16384, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x56x80xbf16, 1863680 : i64>) -> tensor<1x32x56x80xbf16> loc(#loc62)
        %536 = "tpu.Load"(%28) {do_bcast = false, ginfo = #tpu.lg<out_addr = 20480, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x56x80xbf16, 1146880 : i64>) -> tensor<1x32x56x80xbf16> loc(#loc63)
        %537 = "tpu.Load"(%17) {do_bcast = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 2, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x56x80xbf16, 1576960 : i64>) -> tensor<1x32x56x80xbf16> loc(#loc64)
        %538 = "tpu.Add"(%535, %536) {do_relu = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 3, stage = 1, slice_idx = 0, group_type = 0>, is_scalar = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x56x80xbf16>, tensor<1x32x56x80xbf16>) -> tensor<1x32x56x80xbf16> loc(#loc65)
        %539 = "tpu.Load"(%29) {do_bcast = false, ginfo = #tpu.lg<out_addr = 0, out_size = 3072, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [96], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x128x1x96xbf16, 1099522656272 : i64>) -> tensor<1x128x1x96xbf16> loc(#loc66)
        %540 = "tpu.Load"(%30) {do_bcast = false, ginfo = #tpu.lg<out_addr = 21760, out_size = 64, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 5, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x128x1x1xui16, 1099521242640 : i64>) -> tensor<2x128x1x1xui16> loc(#loc67)
        %541 = "tpu.Concat"(%537, %535, %538) {axis = 1 : si32, do_relu = false, ginfo = #tpu.lg<out_addr = 4096, out_size = 3840, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [96], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 6, stage = 1, slice_idx = 0, group_type = 0>, only_merge = false, relu_limit = -1.000000e+00 : f64} : (tensor<1x32x56x80xbf16>, tensor<1x32x56x80xbf16>, tensor<1x32x56x80xbf16>) -> tensor<1x96x56x80xbf16> loc(#loc68)
        %542 = "tpu.Load"(%31) {do_bcast = true, ginfo = #tpu.lg<out_addr = 13568, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 7, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099528345936 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc69)
        %543 = "tpu.Load"(%32) {do_bcast = true, ginfo = #tpu.lg<out_addr = 14080, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 8, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099522697360 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc70)
        %544 = "tpu.Conv2D"(%541, %539, %540) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 8192, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 9, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x96x56x80xbf16>, tensor<1x128x1x96xbf16>, tensor<2x128x1x1xui16>) -> tensor<1x128x56x80xbf16> loc(#loc71)
        %545 = "tpu.LutBF16"(%544, %542, %543) {ginfo = #tpu.lg<out_addr = 3072, out_size = 5120, buffer_addr = 21824, buffer_size = 10240, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 10, stage = 1, slice_idx = 0, group_type = 0>, lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x56x80xbf16>, tensor<1x1x32x8xbf16>, tensor<1x1x32x8xbf16>) -> tensor<1x128x56x80xbf16> loc(#loc61)
        %546 = "tpu.Store"(%545, %0) {ginfo = #tpu.lg<out_addr = 3072, out_size = 5120, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [128], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26, 28, 30, 32, 34, 36, 38, 40, 42, 44, 46, 48, 50, 52, 54], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [80], id = 11, stage = 2, slice_idx = 0, group_type = 0>, support_compress = true} : (tensor<1x128x56x80xbf16>, none) -> tensor<1x128x56x80xbf16, 0 : i64> loc(#loc61)
        "tpu.Yield"(%546) : (tensor<1x128x56x80xbf16, 0 : i64>) -> () loc(#loc61)
      }) {core_slice_ncdhw = [], csecs = 1 : i64, dsecs = 1 : i64, flow = [-1, 3, 2, 11, -2, 6, 4, 5, -3, 9, 7, 8, -4, 10, 0, 1], group_type = 0 : i64, hsecs = 28 : i64, nsecs = 1 : i64, other_down_overlap_op = [], other_up_overlap_op = [], run_core_id = [], self_down_overlap_op = [], self_up_overlap_op = [], support_compress = true, swpipl_stage_num = 3 : i64, wsecs = 1 : i64} : (tensor<1x32x56x80xbf16, 1863680 : i64>, tensor<1x32x56x80xbf16, 1146880 : i64>, tensor<1x32x56x80xbf16, 1576960 : i64>) -> tensor<1x128x56x80xbf16, 0 : i64> loc(#loc61)
      %34 = "top.Weight"() {do_compress = true} : () -> tensor<1x128x9x128xbf16, 1099523264912 : i64> loc(#loc72)
      %35 = "top.Weight"() {do_compress = true} : () -> tensor<2x128x1x1xui16, 1099523812112 : i64> loc(#loc73)
      %36 = "tpu.Conv2D"(%33, %34, %35) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [2, 2], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x56x80xbf16, 0 : i64>, tensor<1x128x9x128xbf16, 1099523264912 : i64>, tensor<2x128x1x1xui16, 1099523812112 : i64>) -> tensor<1x128x28x40xbf16, 1146880 : i64> loc(#loc74)
      %37 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099528345936 : i64> loc(#loc75)
      %38 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099522697360 : i64> loc(#loc76)
      %39 = "tpu.LutBF16"(%36, %37, %38) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x28x40xbf16, 1146880 : i64>, tensor<1x1x32x8xbf16, 1099528345936 : i64>, tensor<1x1x32x8xbf16, 1099522697360 : i64>) -> tensor<1x128x28x40xbf16, 0 : i64> loc(#loc77)
      %40 = "top.Weight"() {do_compress = true} : () -> tensor<1x128x1x128xbf16, 1099517227856 : i64> loc(#loc78)
      %41 = "top.Weight"() {do_compress = true} : () -> tensor<2x128x1x1xui16, 1099525333776 : i64> loc(#loc79)
      %42 = "tpu.Conv2D"(%39, %40, %41) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [1, 1], kernel_zp = 0 : i64, pads = [0, 0, 0, 0], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x128x28x40xbf16, 0 : i64>, tensor<1x128x1x128xbf16, 1099517227856 : i64>, tensor<2x128x1x1xui16, 1099525333776 : i64>) -> tensor<1x128x28x40xbf16, 286720 : i64> loc(#loc80)
      %43 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099528345936 : i64> loc(#loc81)
      %44 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099522697360 : i64> loc(#loc82)
      %45 = "tpu.LutBF16"(%42, %43, %44) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x128x28x40xbf16, 286720 : i64>, tensor<1x1x32x8xbf16, 1099528345936 : i64>, tensor<1x1x32x8xbf16, 1099522697360 : i64>) -> tensor<1x128x28x40xbf16, 0 : i64> loc(#loc83)
      %46 = "tpu.Slice"(%45, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 64, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 0, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40xbf16, 0 : i64>, none, none, none, none) -> tensor<1x64x28x40xbf16, 0 : i64> loc(#loc84)
      %47 = "tpu.Slice"(%45, %0, %0, %0, %0) {axes = [], ends = [9223372036854775807, 128, 9223372036854775807, 9223372036854775807], hasparamConvert_axes = [1], offset = [0, 64, 0, 0], steps = [1, 1, 1, 1]} : (tensor<1x128x28x40xbf16, 0 : i64>, none, none, none, none) -> tensor<1x64x28x40xbf16, 143360 : i64> loc(#loc85)
      %48 = "top.Weight"() {do_compress = true} : () -> tensor<1x32x9x64xbf16, 1099523559824 : i64> loc(#loc86)
      %49 = "top.Weight"() {do_compress = true} : () -> tensor<2x32x1x1xui16, 1099523605904 : i64> loc(#loc87)
      %50 = "tpu.Conv2D"(%47, %48, %49) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x64x28x40xbf16, 143360 : i64>, tensor<1x32x9x64xbf16, 1099523559824 : i64>, tensor<2x32x1x1xui16, 1099523605904 : i64>) -> tensor<1x32x28x40xbf16, 286720 : i64> loc(#loc88)
      %51 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099528345936 : i64> loc(#loc89)
      %52 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099522697360 : i64> loc(#loc90)
      %53 = "tpu.LutBF16"(%50, %51, %52) {lut_mode = #tpu<lut_mode Slope>, max_range = 1.200000e+01 : f64, min_range = -1.200000e+01 : f64} : (tensor<1x32x28x40xbf16, 286720 : i64>, tensor<1x1x32x8xbf16, 1099528345936 : i64>, tensor<1x1x32x8xbf16, 1099522697360 : i64>) -> tensor<1x32x28x40xbf16, 1720320 : i64> loc(#loc91)
      %54 = "top.Weight"() : () -> tensor<1x64x9x32xbf16, 1099523623440 : i64> loc(#loc92)
      %55 = "top.Weight"() : () -> tensor<2x64x1x1xui16, 1099525330448 : i64> loc(#loc93)
      %56 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099528345936 : i64> loc(#loc94)
      %57 = "top.Weight"() : () -> tensor<1x1x32x8xbf16, 1099522697360 : i64> loc(#loc95)
      %58 = "top.Weight"() : () -> tensor<1x256x1x192xbf16, 1099522555152 : i64> loc(#loc96)
      %59 = "top.Weight"() : () -> tensor<2x256x1x1xui16, 1099522654736 : i64> loc(#loc97)
      %60 = "tpu.Group"(%53, %47, %46) ({
        %535 = "tpu.Load"(%53) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16896, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [32], d_idx = [0], d_slice = [1], h_idx = [0, 1, 3, 5, 7, 9, 11, 13, 15, 17, 19, 21, 23, 25], h_slice = [3, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 4, 3], w_idx = [0], w_slice = [40], id = 0, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x32x28x40xbf16, 1720320 : i64>) -> tensor<1x32x28x40xbf16> loc(#loc99)
        %536 = "tpu.Load"(%54) {do_bcast = false, ginfo = #tpu.lg<out_addr = 12288, out_size = 4608, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [9], w_idx = [0], w_slice = [32], id = 1, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x9x32xbf16, 1099523623440 : i64>) -> tensor<1x64x9x32xbf16> loc(#loc100)
        %537 = "tpu.Load"(%55) {do_bcast = false, ginfo = #tpu.lg<out_addr = 27264, out_size = 32, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [2], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [1], w_idx = [0], w_slice = [1], id = 2, stage = 0, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<2x64x1x1xui16, 1099525330448 : i64>) -> tensor<2x64x1x1xui16> loc(#loc101)
        %538 = "tpu.Load"(%56) {do_bcast = true, ginfo = #tpu.lg<out_addr = 18688, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 3, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099528345936 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc102)
        %539 = "tpu.Load"(%57) {do_bcast = true, ginfo = #tpu.lg<out_addr = 18176, out_size = 512, buffer_addr = 0, buffer_size = 0, eu_align = false, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [1], d_idx = [0], d_slice = [1], h_idx = [0], h_slice = [32], w_idx = [0], w_slice = [8], id = 4, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 0 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x1x32x8xbf16, 1099522697360 : i64>) -> tensor<1x1x32x8xbf16> loc(#loc103)
        %540 = "tpu.Conv2D"(%535, %536, %537) {coeff_merged = false, dilations = [1, 1], do_relu = false, dynweight_reorderd = false, ginfo = #tpu.lg<out_addr = 28672, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [40], id = 5, stage = 1, slice_idx = 0, group_type = 0>, group = 1 : i64, kernel_shape = [3, 3], kernel_zp = 0 : i64, pads = [1, 1, 1, 1], quant_mode = #tpu<rq_mode MultiplierShift>, relu_limit = -1.000000e+00 : f64, round_mode = #tpu<round_mode HalfUp>, strides = [1, 1], support_compress = true, use_3ic_optimize = 0 : i64, weight_is_coeff = 1 : i64, with_bias = true} : (tensor<1x32x28x40xbf16>, tensor<1x64x9x32xbf16>, tensor<2x64x1x1xui16>) -> tensor<1x64x28x40xbf16> loc(#loc104)
        %541 = "tpu.Load"(%47) {do_bcast = false, ginfo = #tpu.lg<out_addr = 16896, out_size = 1280, buffer_addr = 0, buffer_size = 0, eu_align = true, can_merge = false, in_hslice_offset = [], n_idx = [0], n_slice = [1], c_idx = [0], c_slice = [64], d_idx = [0], d_slice = [1], h_idx = [0, 2, 4, 6, 8, 10, 12, 14, 16, 18, 20, 22, 24, 26], h_slice = [2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2, 2], w_idx = [0], w_slice = [40], id = 6, stage = 1, slice_idx = 0, group_type = 0>, lmem_type = 1 : i64, support_compress = true, use_3ic_optimize = 0 : i64} : (tensor<1x64x28x40xbf16, 143360 : i64>) -> tensor<1x64x28x40xbf16> loc(#loc105)
